{"info": null, "refs": [["7 декабря состоялась церемония награждения лауреатов премии Рунета 2021 года. В этом году на премию было подано 1097 работ за вклад в развитие российского сегмента сети интернет в девять основных и четыре специальные номинации. Финалистами конкурса в каждой номинации стали по 10 организаций. \n\r\nЛауреатами премии Рунета 2021 стали 52 компании и 3 персоны. Причем раньше организаторы (Российская ассоциация электронных коммуникаций — РАЭК) награждали несколько лучших представителей в каждой из номинации, по мнению экспертного сообщества. В этом году они обратились к помощи искусственного интеллекта и добавили еще одного лауреата, который выбирался именно по мнению ИИ. \n\r\nНоминация «Государство и Общество», победители:\n\n\n Благотворительный фонд «Подари жизнь»;\n АНО «Диалог»;\n Правительство Москвы, проект Цифровая экосистема Москвы;\n ФНС России;\n Программа «Пушкинская карта» / АО «Почта Банк».\n\r\nНоминация «СМИ и Массовые коммуникации»: \n\n\n Телеканал 360;\n Медиахолдинг Independent Media;\n АО «Коммерсантъ».\n\r\nНоминация “Образование и Кадры”:\n\n\n Правительство Москвы, проект “Московская электронная школа” (МЭШ);\n Проект программы “Сбер для детей и родителей” совместно с Rambler&Co;\n ООО “Цифровое образование”, проект ИКОП “Сферум”;\n Образовательная платформа “Нетология” (ООО “Нетология”);\n Компания Samsung Electronics.\n\r\nНоминация «Наука, технологии и инновации»:\n\n\n Gett;\n Иннотех;\n Skillbox ;\n Промобот;\n SberDevices ;\n Билайн.\n\r\nНоминация “Культурные проекты в Сети”:\n\n\n Общественное телевидение России;\n Проект “Путь героя” информационного агентства ТАСС и киностудии “Союзмультфильм”;\n Эмпатия Манучи (авторский канал Манучарова Вячеслава);\n Федеральное государственное бюджетное учреждение культуры «Всероссийское музейное объединение “Государственная Третьяковская галерея”.\n\r\nНоминация “Игровая индустрия и киберспорт”:\n\n\n Федерация компьютерного спорта города Москвы — “Московский Киберспорт”;\n ESforce Holding;\n Cybersport.Metaratings;\n MetaMMA;\n Goose Gaming.\n\r\nНоминация “Креативные индустрии”:\n\n\n Ассоциация профессиональных участников творческой экономики “Федерация креативных индустрий”;\n ООО “Гэллэри Сервис”;\n Vinci Agency;\n Проект по веб-инклюзии (Студия Артемия Лебедева).\n\r\nНоминация “Здоровье и медицина”:\n\n\n Здоровье.ру;\n Проект „Здоровое Питание“ (Федеральная служба по надзору в сфере защиты прав потребителей и благополучия человека);\n Правительство Москвы, проект по использованию технологий компьютерного зрения на базе искусственного интеллекта (ИИ) для анализа медицинских изображений.\n\r\nНоминация “Экономика и бизнес”:\n\n\n СберМаркет;\n Balance Platform;\n Московская биржа;\n Метарейтинг.\n\r\nНоминация “За развитие среднего и малого бизнеса в Рунете”: \n\n\n Портал для предпринимателей Smallbusiness.ru;\n ПАО „МТС“, проект “Знаем лично”;\n Банк ВТБ ПАО, проект интернет-банк.\n\r\nНоминация “#СЧАСТЬЕЕСТЬ”: Автономная некоммерческая организация по развитию экологических, социальных и патриотических проектов „Сад Памяти“.\n\r\nНоминация “Развитие внутреннего туризма”: \n\n\n Проект Oh My Град;\n Россия: 85 приключений, проект онлайн-медиа Russia Beyond, входящее в телесеть RT;\n АНО “Проектный офис по развитию туризма и гостеприимства Москвы” Туристический сервис RUSSPASS;\n Комитет по туризму города Москвы, проект Discovermoscow.com.\n\r\nНоминация “Открытые коммуникации”:\n\n\n Мэр Вологды — Сергей Воропанов;\n Правительство Тульской области;\n Федеральное агентство по туризму, портал Russia.travel.\n\r\nНародном голосовании премии Рунета 2021 были выбраны такие лауреаты: \n\n\n в номинации “КТО”: Дмитрий Спиридонов;\n в номинации “ЧТО”: Forza;\n в номинациилучший цифровой регион (номинация “Где”): город Москва.\n\r\nВдобавок за персональный многолетний вклад в развитие интернет-отрасли награду премия Рунета 2021 получил экс-глава Роспечати Михаил Сеславинский. \n\n\n\r\nВ этом году Хабр также подавал заявку на участие в премии Рунета в номинации «Креативные индустрии». Заявлен был наш конкурс «Технотекст». Мы не стали лауреатами, но вошли сперва в шорт-лист, а затем и в число финалистов рядом с очень серьёзными соперниками. Описание заявки Хабра можно посмотреть на странице сайта конкурса.", {"day": "8", "month": "декабря", "time": "09:30"}, {"rate": 6, "views": 2300}], ["Из совместного исследования издателя компьютерных игр Wargaming и компании Global Web Index (GWI) стало известно, что самой популярной игрой среди россиян возрастом от 16 до 64 лет является World of Tanks, за нее проголосовали 18 % опрошенных. Тройку замыкают франшиза Need for Speed с 11,7 % и игра Minecraft с 11,3 %. Результаты глобального голосования отличаются от российского.Список франшиз продолжает спортивный симулятор FIFA, который выбрали 11,2 % респондентов. Далее идет симулятор жизни Sims с 10,5 %.В десятку популярных игровых серий также вошли Grand Theft Auto (10 %), Call of Duty (9,4 %), Counter Strike (9,1 %), Assassin’s Creed (9%) и DotA (8,6). Остальные геймеры в РФ (38 %) проголосовали за другие проекты.Топ популярных игр в мире отличается, его возглавляет франшиза Call of Duty, которую выбрали 21,5 % опрошенных. В тройку также вошли PUBG (20,1 %) и FIFA (19,8 %).Далее предпочтения участников глобального голосования сложились так: серия Mario (17,6 %), Minecraft (17,5 %), серия Plants and Zombies (17,3 %), серия Grand Theft Auto (16,4 %), серия Need for Speed (15,9 %) и Fortnite (13,9 %). Другие франшизы выбрали 18,7 % респондентов.PR-директор Wargaming по СНГ Иван Живица отмечает, что исследование показало своеобразность рынка видеоигровых развлечений в России и его отличие от мирового. Он отметил, что в голосование не вошли некоторые проекты, в частности, консольные, которые еще не так популярны в РФ.Главенствующие позиции на российском рынке видеоигр имеют free-to-play проекты, считает глава подразделения Global Trends в GWI Чейз Бакл. По его мнению, геймеры в России не склонны отдавать деньги за игры, как это делают игроки в других странах.Однако директор по стратегическим коммуникациям киберспортивного холдинга ESforce Holding Ярослав Мешалкин считает тезис о том, что российские геймеры не готовы платить за игры, спорным. Он подчеркивает, что в условно-бесплатных играх присутствуют дополнения и улучшения, приобретаемые за реальные деньги. В связи с этим компании, выпускающие free-to-play игры, зарабатывают значительно больше, чем издатели платных игр, поясняет Мешалкин. PR-директор говорит, что популярность World of Tanks доказывают и совместные исследования, которые проводили ESforce Holding совместно с компанией Nielsen в период с 2018 по 2020 года.Более 50 % российских геймеров играют на ПК, а предпочтение мобильным играм отдают 41,1 % отечественных игроков. Рынок последних за 2020 год вырос вдвое. Летом 2020 года Tele2 объявил о запуске специального тарифного плана «Игровой», который предусматривает начисление бонусов геймерам. Это совместный проект оператора с «Ростелеком» и Wargaming. Новый тариф предлагал премиум-аккаунт в World of Tanks, World of Warplanes и World of Warships. С начала 2021 года число пользователей тарифа увеличилось в 1,5 раза.", {"day": "29", "month": "июля", "time": "13:50"}, {"rate": 12, "views": 2800}], ["По статистике The Esports Observer за I половину 2019 года, впервые в топ-10 самых просматриваемых каналов в мире попал российский. График отсортирован по общему времени просмотра, в миллионах часов. Российский канал Dota2ruhub занял десятое место с 24,7 млн часов просмотра.\n\r\nИнтересно, что за последние семь дней в топ-10 ещё два русскоязычных канала: на шестом месте украинский канал Dota2mc_ru по Dota 2, а на третьем — ещё один канал Ruhub, уже по CS:GO.\n\n\n\r\nСреди всех игр Dota 2 занимает пятое место по популярности на Twitch (рейтинг Twitch Top Content за неделю). После «простого чата» и тактического канала лидеры рейтинга по контенту расположились так:\n\n\nJust Chatting — 15,7 млн просмотров за неделю\n\nTeamfight Tactics — 14,4 млн\n\nCounter-Strike: Global Offensive — 13,3 млн\n\nFortnite — 13,1 млн\n\nLeague of Legends — 12,1 млн\n\nGrand Thieft Auto V — 11,6 млн\n\nDota 2 — 7,4 млн\n\nApex Legends — 5,3 млн\n\nSuper Mario Maker 2 — 4,9 млн\n\nOverwatch — 4,8 млн\n\r\nПрежде ни одному русскоязычному каналу не удавалось попасть в список самых популярных, пишут «Ведомости», отмечая, что в отдельно взятом мае Dota2ruhub вообще занял первое место. Канал ведёт студия Ruhub, которая входит в киберспортивный холдинг Esforce. В начале 2018 года Mail.ru Group купила Esforce Holding за $100 млн у бывшего гендиректора Esforce Антона Черепенникова.\n\r\nСтудия Ruhub занимается производством контента — компания ведет стриминги соревнований и транслирует программы собственного производства о киберспорте. Кроме канала по Dota 2 у студии есть ещё около 30 каналов по разным играм.\n\r\nРусский язык — второй по популярности в мире на платформе Twitch после английского (15,5% и 63,3% просмотров в 2018 году, соответственно). Поэтому русскоязычные каналы изначально очень популярны. По данным SuperData, Россия — крупнейший рынок киберспорта в Европе (в прошлом году рекламодатели могли потратить здесь $45 млн, а в 2019 г. прогнозируется в $53 млн).\n\r\nПродюсер студии Антон Олейник объяснил, почему Dota2ruhub показала такой хороший результат по просмотрам в первой половине 2019 года, а особенно в мае. Секрет в коммерции: просто Ruhub удалось купить права на майский турнир по Dota 2 в парижском Диснейленде MDL Disneyland Paris Major. \n\r\nКроме того, хорошие показатели по аудитории были у московского турнира Epicenter Major 2019.\n\r\nПо мнению экспертов, за права на показ MDL Disneyland Paris Major российская студия (точнее, Mail.ru Group) могла заплатить $250 000, но покупка прав вряд ли окупилась. Спонсорских проектов Ruhub не хватит, чтобы окупить вложения в покупку трансляций, считает гендиректор агентства Winstrike Лина Комкова, зато дорогие трансляции позволили добиться заметного увеличения аудитории. Первое место на Twitch за месяц дорогого стоит.", {"day": "9", "month": "июля", "time": "09:33"}, {"rate": 18, "views": 6200}], ["Компании SuperData Research и PayPal провели совместное исследование европейского рынка киберспорта. Европейский рынок киберспорта в целом SuperData Research оценивает в $300 миллионов, а число «киберспортсменов» достигает 23 миллионов человек.\n\r\nСпециалисты SuperData Research анализировали проведенные трансакции, а также результаты опросов потребителей. \nКомпания PayPal занимается исследованиями в сфере киберспорта и является спонсором Гранд-финала 2016 Wargaming.net League, крупнейшего киберспортивного соревнования по игре World of Tanks. SuperData Research специализируется на анализе рынка компьютерных игр и киберспорта.По прогнозам исследователей, к 2018 году рынок вырастет до $389 миллионов, а аудитория — до 44,4 миллиона. Российский рынок киберспорта является самым крупным и по объемам, и по количеству киберспортсменов — эти показатели достигают $35,4 миллиона и 2 миллиона человек соответственно. \n\r\nНа втором месте — Франция, там объем рынка составляет $22,5 миллиона, на третьем — Испания. \n\r\nSuperData Research исследовала данные по Венгрии, Греции, Италии, Испании, Польше, России, Франции и Чехии. По данным PayPal и SuperData, большинство любителей киберспорта – мужского пола (79% мужчин против 21% женщин). Наиболее распространенные возрастные группы — от 18 до 24 лет (30%) и от 25 до 34 лет (30%). В России группа от 18 до 24 лет занимает большую долю, чем в среднем по Европе, — 47%, приводит данные «Коммерсант».\n\r\nИндустрия киберспорта привлекает новых рекламодателей из числа компаний, которые ранее использовали более традиционные каналы продвижения, в первую очередь ТВ. По оценке SuperData Research, в 2015 году доходы индустрии киберспорта от спонсорской рекламы превысят $570 миллионов, это всего на треть меньше аналогичных доходов NBA — самого крупного получателя рекламных бюджетов в спорте.\n\r\nАвторы исследования отмечают рост аудитории мобильных игр в сегменте киберспорта. К концу прошлого года доля мобильных игр на этом рынке в США превысила 20%. Наиболее доходными игровыми платформами в 2015 году стали (в порядке убывания): Dota 2, League of Legends и Counter-Strike: Global Offensive.\n\r\nНедавно стало известно, что Алишер Усманов построит один из крупнейших в мире киберстадионов. Об этом 4 апреля сообщало издание РБК со ссылкой на компанию ESforce, которая займется возведением арены. Ее площадь превысит 5 тысяч квадратных метров, в то время как крупнейшие киберстадионы в США занимают только 1,5 тысяч квадратных метров. Предварительное название здания — Arena Moscow. \n\r\nОсенью 2015 года миллиардер инвестировал в российский киберспорт рекордные $100 миллионов. \nКиберстадион — площадка для проведения соревнований по компьютерным играм. ESforce Holding (прежнее название — Virtus.pro Group) — одна из крупнейших киберспортивных организаций в мире и лидер российского компьютерного спорта. Компания владеет более чем 180 популярными интернет-ресурсами с совокупной аудиторией в 15 миллионов подписчиков и 40 миллионами уникальных посетителей в год.\r\nБольшинство профессиональных киберспортсменов имеют контракты со своими организациями и могут зарабатывать до $20 тысяч в месяц. Таких профессионалов намного больше, чем может показаться — они есть в Китае, Корее, Европе, США, Южной Америке и, конечно, в России. \n\r\nПоддерживают их крупные мультиигровые организации, которые, по сути своей, являются спортивными клубами, выбирающими подходящих спортсменов для подписания контракта. В конце концов, киберспортсмен — часть глобальной бизнес-структуры, которая необходима для зарабатывания денег, и за него готовы платить. \n\r\nИменно поэтому не существует жёсткого разделения между российскими и западными турнирами — всё зависит от организатора, делает вывод газета «Аргументы и факты». Изначально девизом киберспорта была фраза We are the world («Мы мир») — в нём нет географических привязок и границ.\n\r\nОднако в США, например, есть определенные проблемы с законодательством, которое позволяет делать ставки только на игры, в которых исход матча зависит от реальных способностей игроков или команд. Формулировки, которые можно применить практически к любой игре и трактовать в любую сторону, мешает рынку развиваться. \n\r\nТем не менее, бизнес готов идти на риск, ожидая огромной прибыли, пишет издание «Вести Экономика». Давно существующие платформы-букмекеры, например Betway, открывают специальные разделы на своих сайтах для киберспорта.\n\r\nУже существуют сверхпопулярные стартапы-тотализаторы вроде Unikrn, специализирующиеся исключительно на киберспорте. Эта компания привлекла $10 миллионов в рамках нескольких раундов инвестиций. Львиную долю денег в тотализатор Unikrn вложил владелец баскетбольного клуба Dallas Mavericks и звезда шоу про инвестиции Shark Tank Марк Кубан.", {"day": "11", "month": "апреля", "time": "12:43"}, {"rate": 11, "views": 10000}]], "refs_quant": 4}