{"info": null, "refs": [["7 декабря состоялась церемония награждения лауреатов премии Рунета 2021 года. В этом году на премию было подано 1097 работ за вклад в развитие российского сегмента сети интернет в девять основных и четыре специальные номинации. Финалистами конкурса в каждой номинации стали по 10 организаций. \n\r\nЛауреатами премии Рунета 2021 стали 52 компании и 3 персоны. Причем раньше организаторы (Российская ассоциация электронных коммуникаций — РАЭК) награждали несколько лучших представителей в каждой из номинации, по мнению экспертного сообщества. В этом году они обратились к помощи искусственного интеллекта и добавили еще одного лауреата, который выбирался именно по мнению ИИ. \n\r\nНоминация «Государство и Общество», победители:\n\n\n Благотворительный фонд «Подари жизнь»;\n АНО «Диалог»;\n Правительство Москвы, проект Цифровая экосистема Москвы;\n ФНС России;\n Программа «Пушкинская карта» / АО «Почта Банк».\n\r\nНоминация «СМИ и Массовые коммуникации»: \n\n\n Телеканал 360;\n Медиахолдинг Independent Media;\n АО «Коммерсантъ».\n\r\nНоминация “Образование и Кадры”:\n\n\n Правительство Москвы, проект “Московская электронная школа” (МЭШ);\n Проект программы “Сбер для детей и родителей” совместно с Rambler&Co;\n ООО “Цифровое образование”, проект ИКОП “Сферум”;\n Образовательная платформа “Нетология” (ООО “Нетология”);\n Компания Samsung Electronics.\n\r\nНоминация «Наука, технологии и инновации»:\n\n\n Gett;\n Иннотех;\n Skillbox ;\n Промобот;\n SberDevices ;\n Билайн.\n\r\nНоминация “Культурные проекты в Сети”:\n\n\n Общественное телевидение России;\n Проект “Путь героя” информационного агентства ТАСС и киностудии “Союзмультфильм”;\n Эмпатия Манучи (авторский канал Манучарова Вячеслава);\n Федеральное государственное бюджетное учреждение культуры «Всероссийское музейное объединение “Государственная Третьяковская галерея”.\n\r\nНоминация “Игровая индустрия и киберспорт”:\n\n\n Федерация компьютерного спорта города Москвы — “Московский Киберспорт”;\n ESforce Holding;\n Cybersport.Metaratings;\n MetaMMA;\n Goose Gaming.\n\r\nНоминация “Креативные индустрии”:\n\n\n Ассоциация профессиональных участников творческой экономики “Федерация креативных индустрий”;\n ООО “Гэллэри Сервис”;\n Vinci Agency;\n Проект по веб-инклюзии (Студия Артемия Лебедева).\n\r\nНоминация “Здоровье и медицина”:\n\n\n Здоровье.ру;\n Проект „Здоровое Питание“ (Федеральная служба по надзору в сфере защиты прав потребителей и благополучия человека);\n Правительство Москвы, проект по использованию технологий компьютерного зрения на базе искусственного интеллекта (ИИ) для анализа медицинских изображений.\n\r\nНоминация “Экономика и бизнес”:\n\n\n СберМаркет;\n Balance Platform;\n Московская биржа;\n Метарейтинг.\n\r\nНоминация “За развитие среднего и малого бизнеса в Рунете”: \n\n\n Портал для предпринимателей Smallbusiness.ru;\n ПАО „МТС“, проект “Знаем лично”;\n Банк ВТБ ПАО, проект интернет-банк.\n\r\nНоминация “#СЧАСТЬЕЕСТЬ”: Автономная некоммерческая организация по развитию экологических, социальных и патриотических проектов „Сад Памяти“.\n\r\nНоминация “Развитие внутреннего туризма”: \n\n\n Проект Oh My Град;\n Россия: 85 приключений, проект онлайн-медиа Russia Beyond, входящее в телесеть RT;\n АНО “Проектный офис по развитию туризма и гостеприимства Москвы” Туристический сервис RUSSPASS;\n Комитет по туризму города Москвы, проект Discovermoscow.com.\n\r\nНоминация “Открытые коммуникации”:\n\n\n Мэр Вологды — Сергей Воропанов;\n Правительство Тульской области;\n Федеральное агентство по туризму, портал Russia.travel.\n\r\nНародном голосовании премии Рунета 2021 были выбраны такие лауреаты: \n\n\n в номинации “КТО”: Дмитрий Спиридонов;\n в номинации “ЧТО”: Forza;\n в номинациилучший цифровой регион (номинация “Где”): город Москва.\n\r\nВдобавок за персональный многолетний вклад в развитие интернет-отрасли награду премия Рунета 2021 получил экс-глава Роспечати Михаил Сеславинский. \n\n\n\r\nВ этом году Хабр также подавал заявку на участие в премии Рунета в номинации «Креативные индустрии». Заявлен был наш конкурс «Технотекст». Мы не стали лауреатами, но вошли сперва в шорт-лист, а затем и в число финалистов рядом с очень серьёзными соперниками. Описание заявки Хабра можно посмотреть на странице сайта конкурса.", {"day": "8", "month": "декабря", "time": "09:30"}, {"rate": 6, "views": 2300}], ["Из новостей на этой неделе: Unity сменила логотип и систему  идентификации продуктов, Konami проводит конкурс для возрождения старых  IP, в бету вышли GDevelop и Mari 5.0, Eidos-Montreal переходит на  четырёхдневную рабочую неделю.Из интересностей: воссоздание дизайна уровней Monument Valley в  Unity, вводная статья про симуляцию жидкостей в реальном времени, про  особенности ценообразования в игровой индустрии.Обновления/релизы/новостиUnity сменила логотип и систему идентификации продуктовВ компании считают, что новое лого лучше отражает почти 20-летнию историю.По словам Unity, это изменение упростит пользователям идентификацию и поиск нужных продуктов.Konami проводит конкурс для возрождения старых IPИздатель предложит победителям 18000 долларов. Проекты могут быть основаны на Gradius, Goemon или десятках других франшиз.Если издатель решит коммерциализировать игру, представленную на  конкурс, он инвестирует в её разработку до 30 миллионов йен (271 000  долларов США). Помимо финансирования, Konami обеспечит наставничество,  помощь с локализацией и поддержку в продвижении.GDevelop 5 вышел из бетыЭто должно привлечь разработчиков, которые раннее с опаской посматривали на проект.GDevelop — это бесплатный кроссплатформенный игровой движок с  открытым исходным кодом, позволяющий создавать игры без знания языков  программирования.Французский издатель Voodoo объявил новый конкурс прототипов игр, открытый для всех студий по всему мируС 10 октября по 10 декабря студии могут выставить неограниченное количество прототипов в попытках выиграть до 1 миллиона долларов.Помимо денежных призов, все участники получат поддержку со стороны издательской и продуктовой команд Voodoo на протяжении всего конкурса.Вышла бетка Mari 5.0Ключевые изменения включают  поддержку Python 3.7, новый рабочий процесс на базе USD для экспорта  изображений предварительного просмотра в Katana, поддержку нескольких  цветов в мазках и возможность рисовать полноцветные надписи на  поверхности.Разработчики Godot в блоге выложили список игр с феста Steam’а, написанные на этом движкеДовольно много, на удивление.Eidos-Montreal переходит на четырёхдневную рабочую неделюКоличество рабочих часов сократится с 40 до 32. Зарплата при этом останется прежней.Радует, что компании подобные инициативы продвигают.Вышел MagicSquire 5.0В обновлении  добавлены новые настраиваемые мини-панели управления, обеспечивающие  быстрый доступ к основным свойствам кисти, а также возможность назначать  настраиваемые теги сразу нескольким кистям.Unity Robotics Visualizations PackageС помощью этого набора инструментов  для визуализации и отладки внутреннего состояния моделирования  робототехники Unity можно использовать как универсальный инструмент  моделирования и ROS визуализации.Вышел D5 Render 2.0Переосмыслили UI, улучшили инструменты по работе с растительностью, погодой и облаками.С полным внушительным списком можно ознакомиться на сайте.Халява/раздачи/бандлы/курсы7 бесплатных панорам неба и 23 бесплатных ландшафта для UE4Epic Games сделала Elite Landscapes: Bundle Pack, набор ресурсов окружения для проектов в реальном времени, доступным бесплатно через торговую площадку Unreal Engine.Project Anywhere XR: бесплатный пример проекта для трёхмерной геопространственной визуализации смешанной реальностиЕщё в конце 2020 года Epic Games объединилась с NVIDIA, Microsoft и  специалистом из Cesium, чтобы продемонстрировать Project Anywhere,  доказательство концепции масштабируемой интерактивной среды  моделирования в реальном времени.Теперь же Project Anywhere XR доступен как бесплатный образец проекта Unreal Engine, который можно транслировать в Microsoft HoloLens 2.Интересные статьи/видеоОтличная вводная статья про симуляцию жидкостей в реальном времени для программистов и технических художниковВсе исходники из статьи доступны на Гитхабе.Протестировано в Unity 2019.1.14f1.Создание магической сцены в Blender, Substance и UnityОпытный 3D-художник Кевин Кетфи поделился разбором проекта «Fairy Tale» и объяснил, как организовать рабочий процесс с соблюдением строгих сроков.«Цена игры не имеет никакого отношения к стоимости её производства»: особенности ценообразования в игровой индустрииТекстовая версия 329 выпуска подкаста «Как делают игры».Поговорили про ценообразование, про сравнение с конкурентами и про  то, как правильно ставить цену на свои игры, которые выходят в Steam,  EGS и консолях.Google Карты, никаких коробок: поиск реальных локаций для Untitled Goose GameВ своём выступлении на GDC в 2021 году Джейк Штрассер из House House  рассказывает об использовании геолокации для поиска реальных мест для  создания уровней в Untitled Goose Game.Ему было важно передать британский колорит, для этого пришлось  прошерстить множество мест на карте, пока не нашлось то, что ему было  необходимо для задумок.Нил Бломкамп об использовании Unity при работе над фильмом DemonicВиктор Мюллер из UPP был супервайзером визуальных эффектов Demonic (и исполнительным продюсером фильма). Вдобавок, работая с Unity,  создатели фильма использовали новую технологию игрового движка под  названием Project Inplay (текущее кодовое название), которая позволяла  вводить объёмные данные облака точек в движок и обрабатывать их в режиме  реального времени.Создание стилизованного дыма в Unity VFX GraphВ туториале показано, как создать стилизованный/мультяшний эффект дыма с помощью Visual Effect Graph и Shader Graph.Создание простого и забавного контроллера для дрифтингаА статье рассказывается, как создать аркадный, но массивный физический контроллер для автомобиля.Создание процедурной травы с помощью Megascans, SpeedTree и UE4Художник по 3d-окружению Карстен Мальмквист показал,  как создавалась процедурная трава в реальном времени, объяснил, как  использовать отсканированные атласы из Megascans для создания кластеров  травы в SpeedTree, и рассказал о настройке шейдера.BCn декодирование на GPUBC1-7 (также известные под более старыми названиями S3TC, DXTC, RGTC и  BPTC) — это стандартные форматы сжатия текстур на ПК. Новые форматы  BC6H и BC7 имеют точные спецификации, требующие точного побитового  декодирования, что означает, что кодировщики точно знают, какие  результаты они собираются получить. Более старые BC1-5 определены  гораздо более свободно, что в течение некоторого времени было источником  раздражения и проблем для авторов кодировщиков BCn.Один из разработчиков Oodle Texture провёл несколько экспериментов, пытаясь выяснить, что на самом деле делают различные аппаратные GPU декодеры.Трудности анимирования в многопользовательских шутерахСтарший технический аниматор Sony Santa Monica Дэн Лоу опубликовал в твиттере тред, в котором рассказал о трудностях создания анимации в мультиплеерных играх от первого лица. Мы выбрали из треда главное.Владимир Семыкин перевёл его для DTF.Что нового в Unity 2021 при работе с Shader GraphНикаких критических изменений нет. После крошечных изменений все старые туториалы по Shader Graph будут всё ещё актуальны.Как устранить баг с конвейерами в FactorioПроблема возникает, когда конвейер представляет собой петлю. Поначалу  помещённые на конвейер предметы работают нормально, двигаясь как  возвращаемый пассажирам багаж в аэропорту. Но как только конвейер  достигает полной загрузки, он останавливается. Патрик Бене, не имея  доступа к исходному коду Factorio, всё равно попытался объяснить, почему это происходит.PatientZero перевёл статью для Хабра.Ophidiophobia: создание жуткого проекта в HoudiniАюб Хамиди Алауи рассказал  о процессе разработки своего проекта Ophidiophobia, созданного в  Houdini, объяснил, как настроить движущихся змей, и поделился некоторыми  полезными уроками для начинающих художников.Оптимизация физики в многопользовательской игре — опыт разработчиков Shadow Fight ArenaПлоская иерархия и XPBD.Роман Терский, ведущий технический художник Banzai Games, рассказывает,  как команда оптимизировала и улучшала физику в Shadow Fight Arena.  Помимо реалистичности и кинематографичности необходимо было добиться и  согласованности движений персонажей на разных устройствах в синхронном  PvP.Советы по оптимизации LOD’овДелани Кинг в треде в Твиттере поделилась несколькими советами по уменьшению полигонажа моделей.Воссоздание дизайна уровней Monument Valley в UnityВ видео рассказывается о создании системы поиска пути, воссоздании  иллюзии, присутствующей в игре, а также даётся несколько советов о том,  как добавить ассеты, частицы и эффекты, чтобы сделать финальный уровень  сияющим. Разработчик использовал ProBuilder и ProGrids.Использование Houdini и Nuke для создания фантастических визуальных эффектовАндреа Сбабо рассказал  о том, как стать художником Houdini FX, объяснил, почему Houdini  является его основным инструментом, и поделился подробным описанием  некоторых проектов.Декомпозиция света: как работает освещение в играхPixonic написали статью о методах реализации глобального освещения в играх и о том, что это вообще такое.Создание шумного звукового ландшафта Нью-Йорка в Marvel’s Spider-ManВ своём выступлении на GDC в 2019 году Алекс Превити и Блейк Джонсон  из Insomniac Games рассказывают о деталях звукового дизайна открытого  мира Marvel’s Spider-Man, и объясняют, как создавался правдоподобный и  живой звуковой ландшафт Нью-Йорка.Советы по быстрому дизайну уровней от Кристофера ХолденаКристофер Холден (GRAVEN, Ghostrunner), опытный дизайнер уровней, проработавший в индустрии более 20 лет, решил поделиться в Твиттере парой советов, которые могут помочь новичкам создавать лучшие уровни.MARVEL Future Revolution: MMORPG с открытым миром, созданная для мобильных устройствВ интервью  разработчик Netmarble делится своими амбициозными целями в отношении  игры, как он подошёл к повышению точности при одновременном  балансировании производительности, и объясняет, как Level Streaming  вместе с другими инструментами Unreal Engine позволил студии создать  игру с открытым миром, адаптированную для мобильных устройств.РазноеИгра «Жизнь» в UE с помощью Niagara. Работает всё в одном эмиттере и выполняется на GPUНайдено на Реддите.", {"day": "13", "month": "октября", "time": "19:44"}, {"rate": 6, "views": 2500}], ["На игровую консоль не очень похоже, скорее — на китайский говорящий будильник \r\nЕще в 2019 году на Хабре публиковалась новость о новой карманной консоли для инди-игр от компании Panic. Она известна своими разработками для iOS, вроде Firewatch и Untitled Goose Game. Теперь же Panic решила создать принципиально новую консоль, которая может понравиться многим.\n\r\nПринципиально новая — не значит, что это нечто гениальное. Просто концепция консоли действительно не похожа ни на что другое. У нее небольшой дисплей, причем без всяких супернаворотов, это «электронная бумага». Разрешение всего 400*240. Есть беспроводные модули связи, разъем USB-C, но самое интересное — поворотная ручка для управления. Она позволяет управлять как временем, так и движением. Подробнее о новинке — под катом, штука действительно интересная.\n\nЧто это за дурдом?\n \r\nДа, девайс не похож ни на что, что мы видели до сих пор в игровом сегменте. Какой-то гибрид GameBoy с шарманкой. Идея появилась у разработчиков довольно давно, а к реализации они приступили пару лет назад вместе с компанией по производству электроники Teenage Engineering.\n\r\nУ приставки 2,7-дюймовый монохромный дисплей, который выполнен по технологии Sharp Memory с разрешением 400×240 пикселей, плюс крестовина D-pad, плюс две кнопки управления, как у Nintendo (А и B). ОЗУ немного — всего 16 МБ, внутренней памяти — 2 ГБ. Рукоятка предназначена для управления специально разработанными играми, она будет использоваться не во всех тайтлах.\n\r\nЧто касается операционной системы, то это собственная разработка компании, которая называется PlayDate OS. Еще у консоли есть встроенный динамик, разъем для стандартных наушников, порт USB-C, плюс модуль связи Wi-Fi и Bluetooth.\n\n \r\nУже в этом году консоль получила еще и Stereo Dock — док-станцию с держателем для ручек и стереодинамиками. Крепится консоль при помощи магнитов. Док-станция еще и используется для зарядки девайса.\n\r\nКонсоль не проприетарная, это открытая система, которая позволит к тому же загружать игры без необходимости что-либо взламывать.\n\r\nЕдинственное, что пока неясно: будет ли поставляться док-станция с приставкой или эти $179 — это стоимость самой консоли с играми и ручкой. Хотелось бы надеяться, что все входит в комплект.\n\nКое-что еще\n \r\nИнтересна консоль не только «железом», но и играми. Сначала поговорим о схеме их распространения. Поставляется консоль с 12 тайтлами, стоимость игр входит в стартовый прайс. Но самое интересное начинается потом: владельцы приставки будут получать новые игры на регулярной основе. Насколько известно, это минимум две игры в неделю.\n\n \r\nЗагрузка бесплатная. Продолжительность цикла — 12 недель, в течение которых игроки получат 24 игры.\n\r\nКомпания заявила, что не хочет демонстрировать длинные видео с геймплеем, поскольку желает оставить приятный сюрприз на потом. Котом в мешке консоль не назовешь, поскольку видео самой приставки и парочки игр (короткие видео) выложены компанией на YouTube. В ролике разработчики рассказывают о новинке достаточно подробно, чтобы решиться на покупку (или нет).\n\n \r\nВот список игр на старте:\n\n\nCrankin’s Time Travel Adventure, разработка uvula (Keita Takahashi, Ryan Mohler), Matthew Grimm и Shaun Inman\nBattleship Godios, разработка TPM.CO SOFT WORKS\nBoogie Loops, разработка May-Li Khoe и Andy Matuschak\nCasual Birder, разработка Diego Garcia; музыка Max Coburn\nDemonQuest 85, разработка Alex Ashby, Lawrence Bishop, Duncan Fyfe, Belinda Leung и Jared Emerson-Johnson\nEchoic Memory, разработка Samantha Kalman, Everest Pipkin, Carol Mertz и Rachelle Viola\nExecutive Golf DX, разработка davemakes\nFlipper Lifter, разработка Serenity Forge\nForrest Byrnes: Up in Smoke, разработка Nels Anderson и Christina “castpixel” Neofotistou\nHyper Meteor, разработка Vertex Pop\nLost Your Marbles, разработка Sweet Baby Inc. & Friends\nOmaze, разработка Gregory Kogos.\nPick Pack Pup, разработка Nic Magnier и Arthur Hamer; музыка Logan Gabriel\nQuesty Chess, разработка Dadako\nRatcheteer, разработка Shaun Inman, Matthew Grimm и Charlie Davis\nSasquatchers, разработка Chuck Jordan; музыка Jared Emerson-Johnson\nSnak, разработка Zach Gage; графика Neven Mrgan\nSpellcorked!, разработка Jada Gibbs, Nick Splendorr, Ryan Splendorr и Tony Ghostbrite; музыка A Shell in the Pit (Em Halberstadt)\nZipper, разработка Bennett Foddy\nSaturday Edition, разработка Chris Makris; музыка A Shell in the Pit (Gord McGladdery, Alfonso Salinas)\nWhitewater Wipeout, разработка Chuhai Labs\n\nА что для разработчиков?\r\nСкорее всего в будущем компания откроет собственный каталог игр, где будут как платные, так и бесплатные игрушки. Плюсом этой консоли является то, что разрабатывать игры может любой желающий. Как уже говорилось выше, система полностью открытая, так что рады всем.\n\r\nДо конца 2021 года компания выпустит бесплатный набор инструментов для создания игр на PlayDate. DevKit будет доступен из браузера.\n\n \r\nКстати, на консоль уже портировали Doom (как же без этого). Стрелять в игре можно при помощи той самой ручки или кнопки А. На монохромном дисплее игра выглядит не очень, но если учесть, что Doom портировали даже на продвинутый электронный тест для беременности, то все нормально, играть можно.\n\r\nВ продаже консоль появится в июле 2021 года, по цене в $179.", {"day": "9", "month": "июня", "time": "16:18"}, {"rate": 41, "views": 8800}], ["Всем привет, в июне OTUS вновь запускает курс «Разработчик игр на Unity». В преддверии старта курса, мы подготовили перевод интересного материала по теме.\n\n\n\r\nСегодня мы поговорим о том, как делать блендинг меша с террейном (или с другими мешами) в Unity. Это руководство довольно продвинутое, но я постарался разбить его на отдельные этапы. Предполагается, что у вас есть общие навыки работы с Unity и базовое знание С#. Руководство разработано для amplify, но я думаю, что его можно также применить и к Shader Graph. Это мое первое руководство, поэтому надеюсь, что оно получится достаточно понятным. Если вы захотите что-то добавить, дайте знать. Я включил сюда стартовый набор, в котором есть некоторые дополнительные шейдеры для этого проекта, а также базовый комплект для начала работы. Все файлы проекта из сегодняшнего руководства доступны моим патронам за $5, но в ближайшем будущем, они будут доступны всем желающим.\n\r\n→ Стартовый набор \r\n→ Весь проект\n\nПримечание: Учитывая длину этого руководства, я хочу быть уверен, что вы знаете о преимуществах и недостатках этого шейдера. Сегодня мы поговорим о двух версиях шейдера. Первая позволяет выполнять блендинг одной текстуры, поэтому шейдер подходит для текстур с высоким разрешением, но получается, что вы ограничены всего одной текстурой. Второй шейдер позволяет делать блендинг любого количества текстур террейнов с низким разрешением или одного цвета (или мешей текстур террейнов с некоторыми модификациями) и работает на террейнах unity и на мешах террейнов. У этих шейдеров нет нормального полнофункционального блендинга, что возможно пригодилось бы в нестилизованных играх, однако есть способ реализовать его самостоятельно. \r\nИтак, начнем. Для начала я выделю проблему и углублюсь в теорию, на которой будет основано решение. Чтобы сделать блендинг между террейном и другими мешами нужно как-то сказать шейдеру, где происходит пересечение с террейном. Сказать легче, чем сделать, но способ есть. И в чем же он заключается? Нам поможет Render Texture!\n\nЧто такое Render Texture?\nRender Texture – это, по сути, позиция камеры, которая сохранена в asset-файле. Render Texture в играх чаще всего используется для таких вещей, как создание экранов видеонаблюдения. Мы можем использовать Render Texture для сохранения вида с камеры в редакторе, чтобы затем эту текстуру можно было использовать как шейдер. Полезно это, потому что мы можем запекать информацию о нашем террейне, такую как высота, нормали и цвета, в текстуру, которую затем можно использовать в рантайме для блендинга между мешами и террейном.\n\n\nРендеринг текстур используется для вывода изображения гуся на телевизоры в Untitled Goose Game\n\nНастройка\r\nДля начала давайте создадим новую сцену и террейн. Установим какой-нибудь удобный для работы размер, например, 200x200. Теперь вы можете обустроить террейн, как вам захочется. Затем создайте новый слой и назовите его “Terrain” и присвойте террейн этому слою. Это нужно, чтобы маска камеры могла записывать террейн в Render Texture.\n\n\nМой шедевральный террейн\n\r\nВ исходных файлах проекта есть префаб, который называется “BlendBakingCamera” – перетащите его на сцену. Вы получите простую ортографическую камеру. На камере вам нужно поставить culling mask на новый слой террейна. Расположите камеру по центру террейна немного выше самой высокой точки на террейне. Затем отрегулируйте far clip plane так, чтобы камера видела пол террейна. В итоге выглядеть сцена должна примерно так:\n\n\nReplacement Shader\r\n Теперь, когда камера настроена, нужно найти способ записывать данные террейна. Для этого нам понадобятся Replacement Shaders. Replacement Shader кажется сомнительной перспективой, я и сам долгое время не понимал, как он работает. Но на самом деле все очень просто и эффективно. Использование Replacement Shader, по сути, означает визуализацию каждого объекта в поле зрения камеры с помощью одного шейдера, независимо от того, какой шейдер наложен на объекты. В итоге все объекты будут рендериться с помощью выбранного Replacement Shader, который на самом деле просто является обычным шейдером.\n\r\nШейдер, который нам понадобится для блендинга – это шейдер глубины. Он рендерит глубину сцены и является ключевым компонентом в создании нашего эффекта блендинга, поскольку он записывает значения глубины нашей камеры в текстуру, чтобы позже мы смогли их прочитать. Чтобы узнать больше об этом шейдере и о Replacement Shader в целом, рекомендую ознакомиться с этим руководством от Making Stuff Look Good in Unity.\n\n\nПример шейдера глубины\n\nНачнем запекать\r\n Давайте создадим новый класс и назовем его “TerrainBlendingBaker”. Начнем с реализации маски глубины для базового террейна. Позже мы еще вернемся к этому скрипту, чтобы добавить цвета и нормали.\n\r\nОпределим несколько переменных.\n\n//Shader that renders object based on distance to camera\npublic Shader depthShader;\n//The render texture which will store the depth of our terrain\npublic RenderTexture depthTexture;\n//The camera this script is attached to\nprivate Camera cam;\r\n Теперь давайте создадим новый метод и назовем его «UpdateBakingCamera». В этом методе мы определим данные о камере, которые могут понадобиться шейдеру для рендера блендинга в глобальных переменных.\n\nprivate void UpdateBakingCamera()\n    {\n        //if the camera hasn't been assigned then assign it\n        if (cam == null)\n        {\n            cam = GetComponent<Camera>();\n        }\n \n        //the total width of the bounding box of our cameras view\n        Shader.SetGlobalFloat(\"TB_SCALE\", GetComponent<Camera>().orthographicSize * 2);\n        //find the bottom corner of the texture in world scale by subtracting the size of the camera from its x and z position\n        Shader.SetGlobalFloat(\"TB_OFFSET_X\", cam.transform.position.x - cam.orthographicSize);\n        Shader.SetGlobalFloat(\"TB_OFFSET_Z\", cam.transform.position.z - cam.orthographicSize);\n        //we'll also need the relative y position of the camera, lets get this by subtracting the far clip plane from the camera y position\n        Shader.SetGlobalFloat(\"TB_OFFSET_Y\", cam.transform.position.y - cam.farClipPlane);\n        //we'll also need the far clip plane itself to know the range of y values in the depth texture\n        Shader.SetGlobalFloat(\"TB_FARCLIP\", cam.farClipPlane);\n \n        //NOTE: some of the arithmatic here could be moved to the shader but keeping it here makes the shader cleaner so ¯\\_(ツ)_/¯\n    }\r\n Теперь давайте запечем глубину террейна в текстуру.\n\n// The context menu tag allows us to run methods from the inspector (https://docs.unity3d.com/ScriptReference/ContextMenu.html)\n[ContextMenu(\"Bake Depth Texture\")]\npublic void BakeTerrainDepth()\n{\n    //call our update camera method \n    UpdateBakingCamera();\n \n    //Make sure the shader and texture are assigned in the inspector\n    if (depthShader != null && depthTexture != null)\n    {\n        //Set the camera replacment shader to the depth shader that we will assign in the inspector \n        cam.SetReplacementShader(depthShader, \"RenderType\");\n        //set the target render texture of the camera to the depth texture \n        cam.targetTexture = depthTexture;\n        //set the render texture we just created as a global shader texture variable\n        Shader.SetGlobalTexture(\"TB_DEPTH\", depthTexture);\n    }\n    else\n    {\n        Debug.Log(\"You need to assign the depth shader and depth texture in the inspector\");\n    }\n}\r\n Значения станут понятнее, когда мы начнем работать с шейдером. Вот небольшая картинка, которая может пролить немного света:\n\n\nМы собираемся перенести террейн на текстуру глубины, чтобы впоследствии прочитать ее и понять, где делать блендинг\n\r\nТеперь у нас есть все, что нужно для создания базового эффекта блендинга в шейдере. На данном этапе скрипт выглядит примерно так: pastebin.com/xNusLJfh\n\r\nХорошо, теперь, когда у нас есть скрипт, мы можем добавить его к baking camera, которую мы добавили ранее. В начальных ассетах есть шейдер, который называется ‘DepthShader’ (Inresin/Shaders/DepthShader) и Render Texture, которая называется ‘DepthTerrainRT’ (Inresin/RenderTextures/DepthTextureRT), вам нужно поместить их в соответствующие поля в инспекторе. \n\r\nПосле этого просто запустите метод через контекстное меню, чтобы запечь нашу глубину террейна в Render Texture.\n\n\nШейдер\r\n Давайте, наконец, создадим шейдер для блендинга. Создайте новый стандартный amplify shader и откройте его, назовите ‘TerrainBlending’ или около того.\n\r\nТеперь нам нужно создать UV для Render Texture. Это будет разница между точкой, которая рендерится и позицией baking camera, масштабированной относительно общей площади. Три глобальные переменные здесь те, которые мы только что объявили в коде. Также мы задаем worldY как локальную переменную, она нам понадобится позже.\n\n\n\r\nДавайте возьмем текстуру глубины, которую мы назначили в качестве глобальной переменной (для этого добавьте texture sample node, сделайте его глобальным и назовите ‘TB_DEPTH’), если мы поместим выходные данные в поле debug amplify shader’a, мы сможем увидеть, что происходит. Создайте плоскость с материалом, к которому будет применен наш новый шейдер.\n\n\r\n Итак, в шейдере у нас есть информация о глубине, теперь нужно добавить смещение по y, чтобы получить блендинг.\n\n\n\r\nЭтот блок масштабирует положение по y маски far clip plane, вычитает это значение из позиции мира по оси у точки, которая рендерится, а затем, наконец, смещает его на к нижней стороне ограничительной рамки камеры (положение камеры по оси y минус farclip plane).\n\r\nУже что-то! Мы видим, как края плоскости сливаются с террейном.\n\n\n\r\n Хорошо, давайте сделаем блендинг более подконтрольным.\n\n\n\r\n Теперь мы можем контролировать толщину и область блендинга террейна.\n\n\n\r\n Думаю, что мы можем даже добавить немного шума. Давайте воспользуемся world position, чтобы сгенерировать шум из текстуры.\n\n\n\r\n Текстуры шума лежат в папке с текстурами в стартовом проекте, их можно назначить в инспекторе или как константу в самом шейдере.\n\r\nНаконец-то пришло время добавить немного текстур! Для начала давайте используем несколько простых одноцветных текстур, я добавил две текстуры в папку с ассетами текстур. Сделайте текстуру ‘SingleColorGrass’ текстурой террейна. Затем в шейдере нужно создать текстуру террейна и object texture node. Мы будем переключаться между ними по красному каналу маски, которую мы только что создали.\n\n\n\n\nА вот и полный шейдер\n\n\n\r\n Добавление кастомного освещение toon или модели unlit lighting обеспечит лучшие результаты работы этого шейдера. Я включил unlit шейдер террейна и unlit версию шейдера в полный пакет, доступный спонсорам.\n\n \nUnlit террейн и меши\n\r\nТакже я рекомендую добавить трипланарный шейдер террейну и, возможно, другим мешам. Я могу рассмотреть этот вопрос в следующем руководстве.\n\r\nЧто же, мы почти закончили с основной темой сегодняшнего руководства. Я добавил несколько разделов, которые могут помочь с расширением шейдера.\n\nРасширение шейдера — нормали\r\n Я добавил в файлы обычный шейдер, вы можете использовать его для записи нормалей к поверхности террейна и также использовать блендинг. Для моей игры мне не нужен блендинг нормалей, поэтому я просто немного поэкспериментировал, и похоже, что эксперимент удался, и моя идея хорошо работает для террейна без высокой степени изменения высоты. Я включил шейдер маппинга нормалей в директорию с шейдерами стартового набора. Здесь вы можете увидеть мою базовую реализацию карты нормалей:\n\n\n\r\n Код почти такой же, как и в случае с картой глубины, но на этот раз мы будем использовать карту нормалей в качестве replacement shader. Также я добавил набор render texture для записи нормали (здесь может понадобиться дополнительная настройка).\n\r\nЧтобы нормали работали хорошо, может понадобиться чуть больше усилий связанных с настройкой, также может возникнуть ограничение, связанное с низко находящимися террейнами (но я не проводил достаточно тестов, чтобы утверждать это).\n\nРасширение шейдера – все цвета\r\n Я не собираюсь глубоко вдаваться в подробности этой темы, поскольку она выходит за рамки того, что требуется для моей игры, но я додумался до этого во время написания этого руководства. Чтобы добавить блендинг множества цветов, мы можем выбрать unlit цвета террейна и сохранить их как текстуры. В этом случае мы ограничены достаточно низким разрешением, но этот метод хорошо работает при использовании одноцветных текстур террейна и текстур с низким разрешением, или же при использовании faint bleed. С учетом небольших корректировок, они также могут быть применены к мешам террейнов.\n\r\nЗдесь приведен код для многоцветного варианта:\n\n[Header(\"The following settings are only if using the multi-color terrain shader\")]\n//Shader that renders the unlit terraom of an object\npublic Shader unlitTerrainShader;\n//The render texture which will store the normals of our terrain\npublic RenderTexture surfaceTexture;\n//An unlit terrain material used to capture the texture of our terrain without any lighting\npublic Material unlitTerrainMaterial;\n//The terrain you want to capture the textures of\npublic Terrain yourTerrain;\n \n[ContextMenu(\"Bake Surface Texture\")]\npublic void BakeTerrainSurface()\n{\n    UpdateBakingCamera();\n \n    //return if there is no terrain assigned\n    if (yourTerrain == null)\n    {\n        Debug.Log(\"You need to assign a terrain to capture surface texture\");\n        return;\n    }\n \n    StartCoroutine(BakeColors());\n}\n \nIEnumerator BakeColors()\n{\n    Material tempTerrainMaterial = yourTerrain.materialTemplate;\n \n    yourTerrain.materialTemplate = unlitTerrainMaterial;\n \n    yield return 0;\n \n    cam.SetReplacementShader(unlitTerrainShader, \"RenderType\");\n    cam.targetTexture = surfaceTexture;\n    Shader.SetGlobalTexture(\"TB_SURFACE\", surfaceTexture);\n \n    yield return 0;\n \n    cam.targetTexture = null;\n    yourTerrain.materialTemplate = tempTerrainMaterial;\n \n    yield return null;\n \n}\r\n Единственное изменение в шейдере заключается в том, что вместо использования предопределенной текстуры мы используем глобально заданную текстуру поверхности террейна, которая будет использовать относительное положение в качестве UV. Дополнительное расширение позволит получить более приятный блендинг текстур.\n\n \nБлендинг нескольких текстур\n\r\nЗдесь представлен полный многоцветный граф с шейдером блендинга нормалей:\n\n\n\nЗаключение\r\n Поздравляю вас, если вы дочитали до этого момента! Как я уже говорил, это мое первое руководство, поэтому я буду очень признателен за обратную связь. Если вы хотите поддержать меня в создании игр и руководств, загляните сюда или подпишитесь на мой Twitter.\n\n\nУзнать подробнее о курсе", {"day": "30", "month": "мая", "time": "04:12"}, {"rate": 7, "views": 4000}], ["Источник: knowyourmeme\n\r\nИгра-мем Untitled Goose Game про гуся, который терроризирует округу в поисках колокольчика, может навредить компьютерам пользователей из-за уязвимости в обработке файлов сохранений.\n\nДенис Анджакович в статье на Pulse Security раскрыл механизм уязвимости. Он пишет, что Untitled Goose Game (UGS) была уязвима из-за небезопасной десериализации в загрузчике сохраненных игр. Злоумышленник, способный управлять сохранением игры пользователя, мог использовать эту уязвимость для выполнения вредоносного кода при загрузке сохраненной игры.\n\r\nUGS использует дотнетовский BinaryFormater для чтения и десериализации сохранений. Так как SerializationBinder не указан, злоумышленник, управляющий файлами с сохранениями, может использовать процесс десериализации и выполнить произвольный код. Для этого нужно записать вредоносный сериализованный объект в файл сохраненной игры, который впоследствии будет прочитан Untitled Goose Game. \n\r\nДесериализация происходит в классе StandaloneSaveSystem, расположенном в Untitled_Data\\Managed\\Assembly-CSharp.dll. Анджакович продемонстрировал уязвимость в коде, добавив что для использования этой уязвимости потребовалась модифицированная версия гаджет десериализации TypeConfuseDelegate Джеймса Форшоу.\n\npublic SaveGameData LoadSlot(int slot)\n\t{\n\t\tstring savePath = this.GetSavePath(slot);\n\t\tSaveGameData result;\n\t\tif (File.Exists(savePath))\n\t\t{\n\t\t\tDebug.Log(\"loading from \" + savePath);\n\t\t\tusing (FileStream fileStream = File.Open(savePath, FileMode.Open))\n\t\t\t{\n\t\t\t\tresult = (SaveGameData)new BinaryFormatter().Deserialize(fileStream);\n\t\t\t}\n\t\t\tDebug.Log(\"sucessfully loaded savegame data from \" + savePath);\n\t\t}\n\t\telse\n\t\t{\n\t\t\tDebug.Log(\"savefile doesn't exist. didn't load any data\");\n\t\t\tresult = new SaveGameData();\n\t\t}\n\t\treturn result;\n\t}\r\nВ качестве примера Анджакович создал POC-файл с сохранением, который запускает калькулятор, после того, как игра его прочитала. Теоретически, злоумышленник мог воспользоваться уязвимостью UGS, чтобы установить на компьютер игрока шпионский или другой вредоносный софт. \n\r\nКомпания House House, создавшая UGS, выпустила патч 1.0.6, который делает сохранения более надежными. Всем игрокам настоятельно рекомендуют обновиться как минимум до этой версии игры (последняя на данный момент — 1.0.7) Примечательно, что на странице, посвященной обновлениям есть благодарность Анджаковичу. The Register.uk советует всем владельцам UGS не только обновить игру, но и не открывать сторонние файлы с сохранениями.\n\r\nСлучай с UGS — не единственный пример того, как файлы, связанные с играми, могут стать лазейкой для хакеров. Сайт Hackerone весной 2019 сообщал об уязвимости в Steam (в котором UGS еще не вышла), которая позволяла угонять аккаунты и подгружать на компьютеры пользователей вредоносное ПО.\n\r\nВ Steam и других продуктах Valve есть функция поиска игровых серверов. Этот поиск осуществляется при помощи специально сформированных UDP-запросов к этим серверам. Формат запросов хорошо описан в публичном руководстве для разработчиков Steam. Благодаря этому описанию пользователь vinnievan с Hackerone успешно реализовал собственный сервер на Python, который отвечает клиенту. После успешной реализации автор изменил несколько параметров и заметил, что клиент завис. Это произошло, когда Steam-клиент получил ответ от кастомного сервера. В этом ответе в параметре A2S_PLAYER содержалось слишком длинное имя игрока. При подключении отладчика vinnievan заметил сбой из-за переполнения буфера в стеке.\n\r\nПосле дальнейшей проверки он выяснил, что переполнение произошло в библиотеке serverbrowser. В какой-то момент имя игрока преобразуется в Unicode, и происходит переполнение, потому что нет проверки на длину строки. Кроме того, отсутствовала canary-защита, что позволило перезаписать адрес возврата и выполнить произвольный код в Windows. \n\r\nЗлоумышленник мог выполнить произвольный код на компьютере любого пользователя Steam, который просматривал информацию об этом вредоносном сервере. Обычно злоумышленник инициировал backdoor-соединение с инфраструктурой C2, чтобы получить доступ к компьютеру жертвы. После этого злоумышленник мог угнать аккаунт, завладеть внутриигровыми предметами или установить вредоносное ПО на компьютер жертвы. Vinnievan предложил вероятный сценарий взлома: пользователь открывает сайт, где инициирует запрос к Steam через браузер — steam://connect/1.2.3.4. При этом вероятность успешного взлома vinnievan оценивал в 0,2%. Автор сообщил об уязвимости Valve и получил вознаграждение в 18 000 долларов. На данный момент баг исправлен. \n\r\nПропатченный UGS только готовится выйти в Steam, но он уже доступен пользователям PC и Mac через Epic Games, а также на Nintendo Switch. Utitled Goose стал очень популярен в первые же две недели продаж — за это время игру купили более 100 000 раз, а интернет заполонили мемы о деструктивной натуре гуся. \n\nНа Хабре также есть перевод интервью с одним из создателей Untitled Goose Game.", {"day": "31", "month": "октября", "time": "12:44"}, {"rate": 12, "views": 3700}], ["Похоже, сегодня все стали крякать чуть больше обычного, ведь недавно вышла потрясающая игра Untitled Goose Game студии House House, в которой игрок управляет вредным гусём, терроризирующим ничего не подозревающих жителей небольшого городка.\n\r\nПрограммист игры Нико Диссельдорп из House House недавно ответил на все наши вопросы про гусей.\n\nGamasutra: кто вы, что такое House House, и что такое Untitled Goose Game?\n\nНико Диссельдорп: House House состоит из чётырёх людей — Нико Диссельдорпа (меня), Майкла Макмастера, Джейка Страссера и Стюарта Гиллеспи-Кука. Хотя в повседневной жизни у каждого из нас есть своя специализация (я, например, программист), более важная часть нашей работы заключается в том, что мы всё обсуждаем совместно. Всё решается консенсусом, поэтому все четверо выбирают, какой будет игра.\n\r\nВсе мы были друзьями ещё до того, как начали делать видеоигры, и взялись за нашу первую игру Push Me Pull You, потому что нам показалось, что это отличный способ проводить время вместе. Игра привлекла внимание нескольких человек, всё очень медленно разрасталось, и в конечном итоге мы превратились в игровую компанию.\n\r\nВ игре про гуся вы управляете противным гусём, который пытается испортить всем жизнь. Идея игры зародилась из этой предпосылки, и постепенно мы придумывали, какие забавные вещи может делать гусь, как смешно могут реагировать люди, пока наконец вокруг этой идеи не начала образовываться игра.\n\r\nНад Untitled Goose Game работали не только мы четверо. Нам помогали саунд-дизайнер Эм Хэлберштадт, Калоника Куигли, создававшая дополнительную графику и анимации, Дэн Голдинг, писавший музыку, и Чери Дэвисон, которая программировала перенастраиваемое управление.\n\n\nGamasutra: Untitled Goose Game впервые появилась на сцене два года назад, в незабываемом видео с YouTube, разошедшемся по множеству сайтов. Насколько полезными оказались социальные сети в афишировании и рекламе игры?\n\nДиссельдорп: это видео было записано одним из разработчиков, Джейком. Он имел опыт работы в кинематографе и на телевидении, поэтому работа над трейлером оказалась для него вполне естественной. Само видео было изготовлено довольно быстро, потому что мы предполагали, что его увидит не так много людей. Теперь я считаю, что отсутствие «чрезмерной продуманности» помогло этому видео.\n\r\nПосле публикации этого видео онлайн оно оказалось довольно популярным, и с ним случилось нечто странное: сайты репостили его скорее как часть «забавного видео», а не как «трейлер игры». Возможно, этому поспособствовало то, что у игры не было названия? Большой успех видео стал для нас сюрпризом и определённо повлиял на наше восприятие разрабатываемой игры.\n\nВ целом мы придерживаемся такой стратегии относительно социальных медиа: как можно меньше думать о социальных медиа. Мы хотели сосредоточиться на создании игры. Но мы знали, что Джейк может делать хорошие видео, поэтому обычно игнорировали социальные медиа, пока не могли сказать что-то важное, например, заявление о платформе или дате выпуска, и под это событие уже делали видео.\n\r\nХотя мне часто казалось, что следует писать больше твитов, думаю, эта стратегия сработала достаточно неплохо. Один человек сказал мне, что ему нравится «загадочность» нашего поведения в соцсетях, что очень великодушно с его стороны. Я бы скорее сказал, что это просто «небрежность».\n\nGamasutra: любопытен тон игры. В ней никто не говорит, но поведение и жесты персонажей сообщает о них очень многое. Чем вы вдохновлялись при создании такого стиля? Не беспокоились ли, что получится заурядная юмористическая игра? Было ли у вас искушение сделать её более масштабной?\n\nДиссельдорп: вся идея игры зародилась с осознания того, что столкновение человека с пугающим гусём — это именно такой, обычный и приземлённый конфликт. Когда человека преследует гусь — это абсурдно, но такое постоянно происходит с людьми. Поэтому такая обыденность, повседневность ситуации была очень важной.\n\r\nВ процессе разработки у нас постоянно возникала мысль сделать нечто большее, например, чтобы гусь испортил чью-нибудь свадьбу, но мы не давали таким идеям развития, потому что хотели, чтобы чувствовалось, что это совершенно обычный день из жизни персонажей. Всё, что возникало неординарного, было результатом действий гуся.\n\r\nДумаю, такое отсутствие эскалации событий тоже помогло в создании структуры игры, которую мы хотели. Персонажи-люди способны устранять большинство неполадок и возвращать вещи на место, давая гусю шанс снова и снова совершать одни и те же шалости. Его безобразия достаточно цикличны.\n\n\nGamasutra: у каждого персонажа есть важные ему вещи и собственные реакции на их исчезновение. Как вы создавали и шлифовали такой эмерджентный геймплей? Сколько итераций вы провели, и как он менялся в процессе разработки? И когда вы осознали, что игра по-настоящему забавна, как вы выделяли и совершенствовали юмор?\n\nДиссельдорп: у нас не было какого-то специального предварительного плана о том, как всё должно работать. В этом смысле процесс был очень итеративным. Мы начали с предпосылки «вы вредный гусь» и смутных идей типа «гусь может воровать вещи у людей», которые казались забавными. А потом мы пошли в обратном направлении и начали добавлять системы, реализующие нужные нам моменты.\n\nМы создали одного ИИ-персонажа (предшественника садовника из игры) и просто постепенно добавляли новые поведения, которые казались подходящими к нужным нам ситуациям. Первым делом мы дали ему несколько предметов, которые мог воровать гусь, и сделали так, чтобы персонаж преследовал гуся, чтобы вернуть их. На этом этапе у нас не было никакого понимания, как будет развиваться игровой процесс, будут ли у гуся какие-то цели, мы просто стремились добавлять вещи, чтобы кража вещей была интереснее.\n\r\nПостепенно это привело нас к созданию циклов пассивных действий, в которых люди используют свои предметы, добавлению анимаций реакций для переходов между состояниями. Также мы добавили конусы видимости, запоминаемые позиции, «пузыри» с мыслями. Сейчас можно сказать, что многие из этих аспектов мы почерпнули из стелс-игр, но брали мы их по одному, чтобы добиться именно тех маломасштабных взаимодействий, которые нам нужны.\n\nGamasutra: пока об этом мало говорили, но те, кто заметили, уделили этому внимание: интерактивный музыкальный аккомпанимент просто великолепен. Наверно, это самый лучший процедурный саундтрек из тех, что я слышал… Как саундтрек адаптируется к текущей ситуации; как он откладывает музыкальные доли, подбирая идеальное время для нужных нот; как он иногда кажется триумфальным, когда гусю удаётся выполнить одно из ограблений; как темы разных персонажей начинают играть при смене областей, и так далее. Что ещё он может делать, и как вам удалось всего этого добиться? Планируете ли вы продавать саундтрек?\n\nДиссельдорп: история музыки игры началась с того, что на ранних этапах разработки нам понравилось, как она ощущается под старые пианинные соло из прелюдий Дебюсси. Они напомнили нам немые фильмы или старые музыкальные мультфильмы, но были гораздо мягче. Удобно, что эти композиции уже были в общественном достоянии, и мы могли их использовать.\n\r\nМы решили взять Дебюсси в качестве музыки для трейлеров, и спросили Дэна Голдинга (который писал музыку и для Push Me Pull You), сможет ли он сделать новую запись для трейлера. Этот трейлер оказался очень популярным, и комментаторы часто упоминали, как им нравится «реагирующая» на геймплей музыка. Это было заблуждение, музыка не реагировала на игру (но мы обрезали трейлер под музыку, а не наоборот). Однако этот конкретный трек перепрыгивал между несвязанными друг с другом музыкальными фразами, из-за чего люди на самом деле думали, что в игре «реагирующая» музыка.\n\n\r\nОптимистично (и, возможно, наивно) мы подумали, что нужно создать именно такую систему, которую ошибочно обнаружили зрители: воспроизводить разные части композиции Дебюсси несвязанными фрагментами так, чтобы игра реагировала на то, что делает игрок. Мы решили, что если сделать всё правильно, то создастся ощущение, будто игровому процессу аккомпанирует живой пианист.\n\r\nНа поиск работающего решения нам понадобилось несколько попыток, но в результате у нас получилась система, которой мы очень довольны. Готовая система содержит две версии каждого трека; один звучит как оригинальная композиция, а другая является версией с «низкой энергией», которая воспроизводится более приглушённо. Дэн разделил каждую версию на сотни разных аудиофайлов, каждый из которых представлял два такта музыки. В зависимости от действия на экране игра может без заметных стыков переключаться между воспроизведением версий с высокой и низкой энергией, приостанавливать или приглушать мелодию.\n\r\nВ текущий момент времени существует только два возможных аудиофайла, которые могут воспроизводиться следующими, но поскольку у игры так много возможностей переключаться на высокую или низкую энергию или приглушать музыку, ей очень просто создавать идеально подобранные по времени переходы между энергиями, которые кажутся намеренными и точными.\n\r\nСаундтрек мы выпустим (надеемся, что скоро), но нам нужно ещё разобраться, как он будет работать. Очевидно, что в игре музыка каждый раз играет по-разному, а саундтрек всегда будет одинаковым. Думаю, у Дэна есть мысли о том, как это реализовать, и я с удовольствием оценю получившиеся результаты.\n\nGamasutra: изучив старый трейлер 2017 года, можно заметить незначительные отличия. Например, что в готовой игре немного больше несаундтрековой музыки. Появились тихие «топ-топ» гуся, а его голос стал намного реалистичнее (раньше он был просто грубым кряканьем). Ещё я заметил, что у радиоприёмников в игре есть несколько радиостанций. Насколько важно для вас было правильно реализовать звук, и какая часть усилий по созданию игры на это была потрачена?\n\nДиссельдорп: в старом трейлере использовались стандартные звуки, взятые из бесплатных онлайн-коллекций.\n\r\nВ 2018 году к нам пришла Эм Хэлберштадт и заменила их на те звуки, которые вы слышите сегодня. Она была чрезвычайно дотошна и приложила огромные усилия для поиска уникальных звуков в разных местах. Вот один из примеров: в игре около 160 уникальных объектов, и все они имеют уникальные звуки поднимания, бросания, удара о бетон, падения на траву, перетаскивания по разным поверхностям. Мне такая работа кажется невероятной. В результате получилась очень увлекательная система — когда ты просто касаешься всего в игре, это само по себе кажется игрой, тебе интересно узнать, какие звуки может издавать каждый предмет.\n\nGamasutra: после прохождения основной игры игроки продолжают возвращаться в неё, чтобы изучить неожиданные взаимодействия между разными предметами. Хотя немного грустно, что мы не можем заставить старика надеть шляпу садовника (да, я пробовал это сделать), мне было приятно узнать, что если спрятаться в коробке во дворе «аккуратного соседа», то гуся выбросят за забор! Многие такие аспекты подчёркиваются пунктами списка в конце игры.\n\nПланировали ли вы такие вещи изначально, или некоторые взаимодействия возникали из свойств предметов? Удивляли ли вас самих какие-то взаимодействия? Хотели бы вы обратить внимание на какие-то особые взаимодействия?\n\nДиссельдорп: подобные вещи были сочетанием системного геймплея, который заработал после того, как мы всё правильно настроили, и созданных вручную взаимодействий — мы пытались предугадать, что ещё люди могут попробовать сделать или предположить, что это сработает. Мы очень довольны тем, что граница между этими двумя подходами оказалась очень размытой — игроку не всегда очевидно, что является «базовым поведением», а что прописано вручную.\n\r\nНам важно было учесть пограничные случаи, которые по мнению людей «должны» сработать, чтобы они верили в возможность своих экспериментов. Наша игра для людей, верящих, что их глупые идеи могут сработать, поэтому если у нас было правило «можно стащить тапочки, пока ноги владельца не на земле», то надо было искать и другие ситуации, в которых тапочки находятся не на земле, чтобы их тоже можно было украсть.\n\r\nКажется, мы не добавляли особо много пунктов специально для списков задач, которые появляются после финальных титров. Мы просто пытались придумать интересные вещи, которые игрок уже мог делать в игре, и записывали их.\n\r\nТеперь, когда люди играют в игру дома, некоторые вещи очень нас удивляют. За последнюю неделю мы посмотрели несколько видео и стримов, и многое удивляло даже нас, например, когда игрок ломал швабру, перетягивая её с другим персонажем, и тому подобное.\n\r\nВ то же время мы понимали, что не сможем учесть любую возможность, некоторые вещи могли не сработать у игроков по техническим причинам или потому, что у нас не было времени на их реализацию. Поэтому нам нужно было сигнализировать игрокам, что некоторые вещи не сработают. Например, одним из первых объектов в игре становится ярко-красная газонокосилка, которая выглядит так, как будто её можно включить. Мы так и не успели добавить для неё взаимодействия, но оставили её на уровне, потому что обнаружили, что это хороший способ калибровки ожиданий игроков. В этой игре многие вещи работают, а некоторые нет, и это нормально.\n\n\nGamasutra: мне кажется, что большей частью обаяния и забавности Untitled Goose Game обязана неповоротливости самого гуся… Но гусь управляется хорошо; это идеальное сочетание неуклюжести и ловкости; несмотря на то, насколько гибкой и адаптивной выглядит его модель, он всегда выглядит и ощущается не как модель, а как настоящий, реалистичный гусь, и из-за этого некоторые задачи, например «Забей гол», становятся намного сложнее. Как вы моделировали внешний вид гуся и управление им?\n\nДиссельдорп: управление гусём требует немного больше активного внимания к низкоуровневым аспектам, например, к вытягиванию и движению, чем во многих других подобных играх. Мне кажется, что такое усложнение помогает снижать масштаб взаимодействий. Некоторые вещи, настолько тривиальные, что в других играх они даже не упоминаются, например «подойди сюда и возьми предмет», в нашей игре сделаны немного более физическими и интересными. Их достаточно для того, чтобы понять, качественно ли разработчик справился со своей работой.\n\r\nКрайней степенью сосредоточенности на подобных мелкомасштабных движениях являются игры наподобие QWOP, где двигаться почти невозможно, и простая ходьба становится огромным достижением. Мне кажется, мы хотели добавить гусю тот же ингредиент, но только в очень маленькой дозе. Это как 1 процент от QWOP.\n\n\r\nЕсли говорить в более общем смысле, то вопрос здесь заключается в том, чтобы избежать искусстенности. Во множестве игр подразумевается, что движение тривиально, а сложность игры связана с чем-то жанровым, например, со стрельбой или прыжками. Но такие вещи приводят к тому, что бОльшую часть времени персонаж кажется очень естественным, а потом убивает сотню людей или прыгает по штабелям ящиков. Один из способов избежать этого заключается в создании игры, не имеющей подобных видов сложностей, например, симулятора ходьбы, и мы тоже попытались создать сложность в других аспектах. В нашей игре немного более сложное движение, менее очевидные подсказки, и тому подобное.", {"day": "10", "month": "октября", "time": "10:28"}, {"rate": 24, "views": 6100}], ["В Оксфорде наступает яркое утро четверга, и в кафе \"Иссохшие фишки\" [Thirsty Meeples] на рынке в Глостершире стоит тихий гул. Мы сидим у окна за столом, разогретым солнцем, и менеджер заведения, Гарет, представляется и даёт нам список рекомендаций.\n\r\nСначала он предлагает \"Запретную пустыню\" [Forbidden Desert]. И это не коктейль. «Ваш самолёт разбился в пустыне, где вы ищете потерянную цивилизацию»,- поясняет Гарет, одетый в футболку с надписью «Игровой гуру». «Внезапно набегает буря, и вам нужно найти все части мифического летающего корабля, чтобы убежать от неё». Потом он предлагает \"Побег: проклятие храма\" [Escape: The Curse of the Temple], в котором мы примеряем на себя роль Индианы Джонса, убегающего из древней и разрушающейся гробницы. «Или,- говорит Гарет – как насчёт борьбы с пожаром?». В конце он рекомендует \"Точку воспламенения\" [Flash Point], в которой я с женой и двумя сыновьями будем спасать людей из горящего здания. Выигрываешь, если вытащишь достаточно много людей. Но если слишком многие погибнут – ты проиграл. Мы выбираем последнюю игру.\n\r\nИ пока мы боремся с пожаром, парочка возрастом за 30 за соседним столом соревнуется в постройке железнодорожных путей в Нидерландах. Где-то ещё молодая женщина с двумя детьми играют за лис, атакующих ферму. Парочка из поколения миллениума делают картонные суши по образцам, изображённым на картах. Одинокий человек из Борнмута сидит перед сложным игровым полем, защищая Лондон 1920 года от нашествия лавкрафтовских чудовищ.\n\n \nВладельцы «Иссохших фишек» Джон и Зюзи.\n\r\nОбед только начался, а заведение уже почти заполнилось. «Фишки» описывают себя как «первое и единственное в Оксфорде кафе с настолками», и они относятся к возрастающим числом заведениям, появляющимся по всей Британии и вдохновлённым популярностью подобных заведений в США. Что привело сюда этих людей, от хардкорных игроков до семей? Эвелин, учёная из Нидерландов, играющая в игру про железную дорогу, «Билет на поезд» [Ticket to Ride] со своим бельгийским мужем Роджером, считает, что знает ответ. Она оглядывает других посетителей и библиотеку игр на полках. «Я бы сказала, что это изначальная версия социальной сети».\n\r\nВозможно, наш мир – это мир Facebook, Pokémon Go, Netflix и iPad'ов, но настольные игры процветают. Даже взрыв настолок XX-го века, давший нам такие неувядающие хиты, как Monopoly, Cluedo и Scrabble, не сравнится с сегодняшним днём. Фирма NPD, занимающаяся исследованиями рынка, утверждающая, что владеет информацией по 70% торговли игрушками в UK, отметила, что за последний год продажи настольных игр увеличились на 20% (включая карточные игры, игры с кубиком, военные игры с миниатюрами и ролевые игры типа Dungeons & Dragons).\n\r\nБен Хогг, управляющий рекламным отделом у британского дистрибьютора Esdevium Games (импортирующего, в числе прочего, из США игру \"Билет на поезд\" [Ticket to Ride]), прикидывает, что рост на самом деле может достигать 35%. По его словам, в 2012 году полный набор игр «Билет на поезд» (а для разных стран есть разные вариации) продался в UK в количестве 16 000 штук. В 2016 году к концу сентября продажи уже составили 21 000 штук. Начиная работать в Esdevium, Хогг отмечал, что в основном покупателей интересовали более «гиковские» игры, типа фэнтезийной Warhammer. Сегодня, по его словам, «аудитория гораздо шире. Уровень интереса высок, как никогда».\n\r\nМало кто находится в лучшей позиции для наблюдения за этим явлением, чем Питер Вудинг [Peter Wooding]. В 70-х он играл на гитаре в панк-группе The Jerks (попавших в сотню лучших в 1977 году с песней «Get Your Woofing Dog Off Me»). В 1987 году он открыл магазин игр \"Орочье гнездо\" [Orc’s Nest] в лондонском Ковент-Гардене. Они с певцом группы Саймоном Эллисом [Simon Ellis] подсели на Dungeons & Dragons и военные настолки. Но специализированных розничных магазинов было мало, поэтому они решили открыть свой, в маленьком и наполовину необустроенном помещении. «Там даже пола не было,- говорит Вудинг. – Просто мусор валялся». Они лазали по мусоркам в поисках декораций в средневековом стиле, и разбросали по полу солому. В основном они продавали книжки по Dungeons & Dragons и исторические военные игры, но лучше всего шли свинцовые миниатюры для военных игр, свисавшие с досок, которыми были отделаны стены помещения на первом этаже.\n\r\n«Первые несколько лет мы бедствовали»,- говорит Вудинг (Эллис ушёл на пенсию), в нашей беседе у стойки в «Орочьем гнезде». Он носит соломенную шляпу, пирсинг на лице и ухоженную бороду. Он разговорчивый мужчина за 50, гордящийся своим панковским наследием. «Нас проверяли налоговики. И спрашивали: 'зачем вы этим занимаетесь? Вы ведь зарабатываете всего 50 фунтов в неделю!' Они думали, что мы тут деньги отмываем, или что-то такое».\n\n\n\n\n\r\nСпустя почти 30 лет логотип «Орочьего гнезда» с орком, засунувшим язык в левую ноздрю, не поменялся, но солому на полу и старую обстановку заменили полированный алюминий и жёлто-чёрные стропила, в результате чего магазин выглядит, как космическая станция из НФ 80-х. Клиентура и ассортимент тоже сильно поменялись.\n\n \nПитер Вудинг в своём магазине\n\r\n«Лет пять назад я заметил, что миниатюры стали идти хуже,- говорит Вудинг,- так что я начал размещать на витрине настольные игры – он жестом показывает на ряды красочных коробок с громкими названиями, Small World, Agricola, Carcassonne, Pandemic – и после этого продажи возрастали». Он отметил постепенное вымирание «стереотипных игроков» – одетых в шерстяные свитера одиноких белых мужчин.\n\r\n«Сейчас у нас гораздо больше парочек – молодых, профессиональных. Они всё ещё любят встречаться с друзьями, но уже не для того, чтобы нажраться. Им нравится принести игру, немного выпить, и приятно провести за столом 2-3 часа».\n\r\nЭти более мейнстримовые игроки, обычные люди, особенно девушки, в прошлом наверняка сильно удивились бы, зайдя в его магазин. Он показывает на обложку игры «Пандемия» [Pandemic], ключевого товара в возрождении настолок, в которой игрокам нужно вместе бороться против эпидемий болезней. На обложке – женщина-учёный. «Гораздо меньше дискриминации, гораздо больше аудитория. Более дружественные игры».\n\r\nКатерина Хауэлл [Catherine Howell], заведующая игровым отделом музея детства V&A Museum of Childhood в Лондоне, описывает «Пандемию» как «коньюнктурную игру». Она выбрала её вместе с тремя другими характерными играми – шахматами, монополией и «Гусиными яйцами» [Game of the Goose] на выставке \"Игровой план: повторное открытие настольных игр\". Хауэлл считает себя традиционным игроком, воспоминания детства которого связаны с игрой в Scrabble и Cluedo в кругу семьи. Она признаётся, что до задумки выставки, пять лет назад, ей не была известна волна новых настольных игр, занимающих полки в «Орочьем гнезде» и «Иссохших фишках». Частично она относит эту волну к «возрождению под руководством дизайнеров», начавшемуся в Германии, а затем распространившемуся по Европе и Северной Америке. Но она удивилась, как сильно продвинулся дизайн игр, сделавший процесс игры более беспокойным и интересным, чем та же Монополия.\n\r\n«Евроигры», как их называют, характерны достаточно спокойными темами (фермерство, ландшафтный дизайн, работа на пристани), уменьшением значимости случайности, и, что важнее всего – заботой о том, чтобы до конца игры игроки не выбывали. Стартом этой волны служит \"Поселенцы Катана\" [The Settlers of Catan], а теперь просто «Катан» (у нас известная, как «Колонизаторы»), созданная немецким дизайнером Клаусом Тойбером. С момента публикации в 1995 году она уже продана в количестве 22 миллионов копий на 30 языках. Игроки соревнуются в организации поселений на острове и торгуют ресурсами с другими игроками, при этом разворачивающиеся события держат игроков в погружении в игру до самого конца. «Это очень важно,- говорит Хауэлл,- поскольку никто не чувствует себя исключённым. Это самое неприятное в Монополии – тот, кто первый становится банкротом, ждёт в углу, пока доиграют остальные».\n\r\nЭта тема находит своё развитие в последнем тренде настолок, кооперативных играх, в которых игроки выигрывают или проигрывают всей командой, сражаясь с огнём или спасая мир от инфекции. «Это приводит к более серьёзным социальным взаимодействиям»,- говорит Хауэлл.\n\r\n«Пандемию» придумал 43-летний калифорниец Мэтт Ликок [Matt Leacock], один из самых успешных дизайнеров настолок. Его вдохновила евроигра 2000 года \"Властелин колец\" от Райнера Книциа. В ней игроки сообща отыгрывают за хоббитов из саги Толкина. «Когда я играл в неё с друзьями, нам было страшно,- вспоминает Ликок. – Были самопожертвования, взлёты и падения, и в конце все были удовлетворены, независимо от того, выиграли они или проиграли. Мне захотелось понять, могу ли я сделать что-нибудь подобное».\n\n\n\r\nСтрасть Ликока к настолкам восходит корнями к его детским разочарованиям играми. «Я больше всего любил получать в подарок игры,- говорит он,- я очень радовался, а затем мы открывали игру, играли в неё, и меня постигало разочарование. Игры мне всегда казались недостаточно хорошими». С помощью своего дяди, энтузиаста игр, молодой Ликок переворачивал игровые поля и пробовал придумать что-нибудь получше, используя имеющиеся компоненты.\n\r\nДесятилетиями позже, руководя командой дизайнеров в стартапе, связанном с коммуникациями, он придумал «Пандемию», просто чтобы проверить, сможет ли он сделать игру, «где было бы множество возможностей опасного нелинейного роста» – то есть, неожиданных сюрпризов и поворотов. В то время пандемии были в новостях, с эпидемиями птичьего гриппа и атипичной пневмонии, «поэтому всё это было у меня в голове».\n\r\n«Пандемия» стала оглушительным успехом, и последняя версия, «Наследие пандемии: первый сезон» [Pandemic Legacy: Season One] представляет собой ещё один скачок в разработке игр. Она создана в соавторстве с восходящей звездой дизайна настолок, Робом Давьо [Rob Daviau], и в ней, по словам Ликока, «очень большая история. Она похожа на компьютерную игру с прокачкой персонажей, где правила и состояние мира меняются. Причём безвозвратно. История разворачивается. Мы назвали её „Первый сезон“, поскольку в ней есть сюжетная арка. Словно вы смотрите сезон любимого сериала на HBO».\n\r\nРост индустрии видеоигр, как ни странно, стал крупнейшим фактором в процветании инновационных настолок – потому, что игровые приставки и мобильные игры нормализовали процесс игры.\n\r\n«Видеоигры и настолки очень много переняли друг у друга»,- говорит Бен Хогг. – Все играют в игры на мобильниках. У каждого на смартфоне есть хотя бы одна любимая игра. И теперь количество людей, не отказывающихся играть в игры, гораздо больше\". Также часто можно встретить электронные версии настолок, например, Carcassonne, хорошо идущую на планшетах.\n\r\nВ то же время краудфандинг снизил барьер для желающих войти в индустрию настолок. Настольные игры способны собирать на Kickstarter больше денег, чем их цифровые аналоги. Дизайнеры будущей, перешедшей с компьютеров на настолки, адаптации Dark Souls, хотели собрать £50 000. Эту сумму они набрали за 3 минуты, а всего кампания собрала £3,8 миллиона.\n\r\nИнтернет способствует улучшению работы сарафанного радио, на которое надеется индустрия настолок. Сайты вроде BoardGameGeek собирают архивы обзоров и видео с YouTube вроде \"Shut Up & Sit Down\" или \"TableTop\", в котором снимается американский актёр Уил Уитон, пробуждают интерес к играм. Существует «эффект TableTop» – если Уитон рассказывает в шоу об игре, и он с другими звёздами в неё играют и комментируют решения, то её продажи резко возрастают. «Эффект TableTop огромен,- говорит Питер Вудинг. – Если Уил рассказывает об игре, она тут же заканчивается в продаже!».\n\r\nУитон практически одержим настолками. «Миссия TableTop – разделять радость от игр с миром»,- говорит он. – Думаю, что мы живём во времена разделённого мира, и если мы выживем после этого пожара на помойке, нам нужно будет объединяться, и я надеюсь показать на примере, что настольные игры могут быть совместным путешествием людей. Они могут учить нас дружбе и формированию отношений. Так что, когда я слышу о хороших продажах игр, я радуюсь. Это значит, что люди, ещё не ставшие игроками, или не так сильно фанатеющие от игр, как я, идут и покупают их. Словно магглы покупают билеты в Хогвартс\".\n\r\nВ «Иссохших фишках» в Оксфорде я беседую с Джоном и Зюзи Морган. В 2012 году они решили начать продавать билеты магглам, уволились с работы и попробовали превратить свою любовь к настолкам в бизнес.\n\r\nУ них уже была большая коллекция игр, и Джон услышал о кафе в Торонто под названием «Змеи и латте» – в меню которого были перечислены игры, а не блюда. Это кафе вдохновило распространение игровых кафешек по Северной Америке. После пробного визита, Морганы открыли «Иссохшие фишки», и эта затея окупилась. «Тренд идёт вверх»,-отвечает на вопрос о бизнесе Джон.\n\r\nЗюзи считает, что любовь к настолкам выросла настолько, что они смогли превратить своё хобби в образ жизни. «В жизни так много технологий, все заняты, и хочется снова свести людей вместе, чтобы они не просто пялились в экраны. Это естественно для людей. Мы должны собираться вместе и общаться». \n\n\n\r\nКакое-то время видеоигры подразумевали физическое общение, либо в аркадах, либо в совместных играх на диванах между друзьями и членами семей. А затем мультиплеер переместился в онлайн, и игроки физически разделились. На некоторых игровых аренах анонимность привела к появлению отравляющей атмосферы.\n\r\n«Мультиплеерные игры были интересными,- говорит Уил Уитон. — А затем всякие придурки всё испортили. Всё превратилось в агрессию и неприятное поведение. Интересно, не привело ли это к тому, что люди, которым раньше нравилось играть в них, начали искать другие способы развлечься, чтобы можно было видеть человека, с которым играешь».\n\r\nПрямое взаимодействие важно и для Мэтта Ликока. «Вы объединяетесь с людьми за столом,- говорит он. – Это очень по-человечески». И тактильно. «Вам нужно обращаться с физическими компонентами, вы чувствуете текстуру карт и деревянных фишек».\n\r\nУ игр всегда была социальная составляющая. Фернанд Гобе [Fernand Gobet], профессор психологии Ливерпульского университета, соавтор «Ходы в голове: психология настольных игр», говорит, что в некоторых странах настольные игры – это часть культуры. Например, манкала в Африке. Их можно рассматривать, как ритуал посвящения. Но в большинстве стран настолки предлагают возможность семьям играть вместе. Смысл в том, чтобы заниматься совместным делом, а не в том, что происходит в игре\".\n\r\nС этим согласны и посетители «Иссохших фишек». «Сегодня это очень социально»,- говорит Марк, 35-летний специалист по информационным моделям из Портсмута.\n\r\nРоджер и Эвелин, играющие в «Билет на поезд», рассказывают, что находятся в процессе переезда в Нидерланды, поскольку, по словам Роджера, они уже не могут себе позволить жить в Оксфорде. Они часто ходили в это кафе и не могли уехать, не посетив его на прощание. «В наш век мы, кажется, начинаем бояться нашей сложности»,- говорит он. «Мы ищем аутентичных вещей. Тех, что напоминают нам о простых временах детства». Настолки – «невинность, возвращающаяся в мир, который…». Он смотрит на меня и улыбается. «Кто бы мог подумать, что Дэвид Боуи был той мистической силой, что скрепляла нас всех вместе?». \n\r\nДля Роджера, Эвелины и Уила Уитона настолки уже стали чем-то большим, чем развлечение. «Игра – это не загадка, которую надо разгадать,- считает Уитон,- но история, которую нужно рассказать». И в нашем обществе, уходящем в онлайн, это история, которую надо разделить – напрямую и через физический контакт в реальном мире.     Только зарегистрированные пользователи могут участвовать в опросе. Войдите, пожалуйста. Ваше отношение к играм \n            13.49%\n           Предпочитаю классику — шахматы, шашки \n            77\n           \n            57.62%\n           Играю с друзьями \n            329\n           \n            31.87%\n           Играю с семьёй \n            182\n           \n            9.81%\n           Играю в клубах \n            56\n           \n            23.82%\n           Играл бы, но негде и не с кем \n            136\n           \n            11.38%\n           Играю в карты \n            65\n           \n            1.58%\n           Играю на бирже \n            9\n           \n            58.14%\n           Играю в компьютерные, сингл \n            332\n           \n            43.26%\n           Играю в компьютерные, мультиплеер \n            247\n           \n            4.9%\n           Не играю \n            28\n            \n       Проголосовал 571 пользователь. \n\n       Воздержались 64 пользователя.", {"day": "28", "month": "сентября", "time": "16:01"}, {"rate": 19, "views": 16000}]], "refs_quant": 7}