{"info": null, "refs": [["7 декабря состоялась церемония награждения лауреатов премии Рунета 2021 года. В этом году на премию было подано 1097 работ за вклад в развитие российского сегмента сети интернет в девять основных и четыре специальные номинации. Финалистами конкурса в каждой номинации стали по 10 организаций. \n\r\nЛауреатами премии Рунета 2021 стали 52 компании и 3 персоны. Причем раньше организаторы (Российская ассоциация электронных коммуникаций — РАЭК) награждали несколько лучших представителей в каждой из номинации, по мнению экспертного сообщества. В этом году они обратились к помощи искусственного интеллекта и добавили еще одного лауреата, который выбирался именно по мнению ИИ. \n\r\nНоминация «Государство и Общество», победители:\n\n\n Благотворительный фонд «Подари жизнь»;\n АНО «Диалог»;\n Правительство Москвы, проект Цифровая экосистема Москвы;\n ФНС России;\n Программа «Пушкинская карта» / АО «Почта Банк».\n\r\nНоминация «СМИ и Массовые коммуникации»: \n\n\n Телеканал 360;\n Медиахолдинг Independent Media;\n АО «Коммерсантъ».\n\r\nНоминация “Образование и Кадры”:\n\n\n Правительство Москвы, проект “Московская электронная школа” (МЭШ);\n Проект программы “Сбер для детей и родителей” совместно с Rambler&Co;\n ООО “Цифровое образование”, проект ИКОП “Сферум”;\n Образовательная платформа “Нетология” (ООО “Нетология”);\n Компания Samsung Electronics.\n\r\nНоминация «Наука, технологии и инновации»:\n\n\n Gett;\n Иннотех;\n Skillbox ;\n Промобот;\n SberDevices ;\n Билайн.\n\r\nНоминация “Культурные проекты в Сети”:\n\n\n Общественное телевидение России;\n Проект “Путь героя” информационного агентства ТАСС и киностудии “Союзмультфильм”;\n Эмпатия Манучи (авторский канал Манучарова Вячеслава);\n Федеральное государственное бюджетное учреждение культуры «Всероссийское музейное объединение “Государственная Третьяковская галерея”.\n\r\nНоминация “Игровая индустрия и киберспорт”:\n\n\n Федерация компьютерного спорта города Москвы — “Московский Киберспорт”;\n ESforce Holding;\n Cybersport.Metaratings;\n MetaMMA;\n Goose Gaming.\n\r\nНоминация “Креативные индустрии”:\n\n\n Ассоциация профессиональных участников творческой экономики “Федерация креативных индустрий”;\n ООО “Гэллэри Сервис”;\n Vinci Agency;\n Проект по веб-инклюзии (Студия Артемия Лебедева).\n\r\nНоминация “Здоровье и медицина”:\n\n\n Здоровье.ру;\n Проект „Здоровое Питание“ (Федеральная служба по надзору в сфере защиты прав потребителей и благополучия человека);\n Правительство Москвы, проект по использованию технологий компьютерного зрения на базе искусственного интеллекта (ИИ) для анализа медицинских изображений.\n\r\nНоминация “Экономика и бизнес”:\n\n\n СберМаркет;\n Balance Platform;\n Московская биржа;\n Метарейтинг.\n\r\nНоминация “За развитие среднего и малого бизнеса в Рунете”: \n\n\n Портал для предпринимателей Smallbusiness.ru;\n ПАО „МТС“, проект “Знаем лично”;\n Банк ВТБ ПАО, проект интернет-банк.\n\r\nНоминация “#СЧАСТЬЕЕСТЬ”: Автономная некоммерческая организация по развитию экологических, социальных и патриотических проектов „Сад Памяти“.\n\r\nНоминация “Развитие внутреннего туризма”: \n\n\n Проект Oh My Град;\n Россия: 85 приключений, проект онлайн-медиа Russia Beyond, входящее в телесеть RT;\n АНО “Проектный офис по развитию туризма и гостеприимства Москвы” Туристический сервис RUSSPASS;\n Комитет по туризму города Москвы, проект Discovermoscow.com.\n\r\nНоминация “Открытые коммуникации”:\n\n\n Мэр Вологды — Сергей Воропанов;\n Правительство Тульской области;\n Федеральное агентство по туризму, портал Russia.travel.\n\r\nНародном голосовании премии Рунета 2021 были выбраны такие лауреаты: \n\n\n в номинации “КТО”: Дмитрий Спиридонов;\n в номинации “ЧТО”: Forza;\n в номинациилучший цифровой регион (номинация “Где”): город Москва.\n\r\nВдобавок за персональный многолетний вклад в развитие интернет-отрасли награду премия Рунета 2021 получил экс-глава Роспечати Михаил Сеславинский. \n\n\n\r\nВ этом году Хабр также подавал заявку на участие в премии Рунета в номинации «Креативные индустрии». Заявлен был наш конкурс «Технотекст». Мы не стали лауреатами, но вошли сперва в шорт-лист, а затем и в число финалистов рядом с очень серьёзными соперниками. Описание заявки Хабра можно посмотреть на странице сайта конкурса.", {"day": "8", "month": "декабря", "time": "09:30"}, {"rate": 6, "views": 2300}], ["Это — подкаст о контент-маркетинге и о тех, кто пишет, редактирует и руководит подготовкой материалов о технологиях и бизнесе. Сегодня делимся нашей беседой с Марией Лапук, соосновательницей Vinci Agency. Ее команда специализируется на работе с технологическими компаниями и помогает им продвигать продукты и сервисы в целом спектре стран. Для этого интервью у нас есть и видеоверсия, ее можно послушать фоном или пролистать текстовую версию под катом.Disclaimer: Этот выпуск мы записали еще до пандемии, поэтому последние новости о проектах Марии лучше найти ее в Facebook-профиле. В интервью мы не делаем рекламу каким-либо брендам и не даем ссылки на сайты каких-либо компаний.Какие форматы нужны для технологического PRТаймкод — 00:16Алина: В одном из интервью ты говорила, что вы выделяете текстовый контент как отдельную составляющую. Сколько вы делаете материалов для клиентов?Мария: Мы делим PR на стратегию (что мы делаем, как мы делаем), контент и его дистрибуцию. Без контента PR невозможен, но точное число материалов сложно сказать. Это может быть от пятидесяти публикаций в неделю.Алина: Если оценить эти составляющие в процентном соотношении, какую долю во всем скоупе работ занимает текстовый контент?Мария: Для какой-то части клиентов мы делаем только коммуникационную стратегию, другим — нужна дистрибуция, а материалы они делают сами. Намного реже приходят с задачами, когда нужен исключительно контент, но и для нас все-таки важно понимать, куда уходят публикации, чтобы их адаптировать.Форматы и подача материала сильно отличаются, даже если брать только топовые медиа вроде РБК, Коммерсанта и Forbes. Но роль контент-маркетинга выросла — если раньше весь PR строился на новостях, то сейчас больше разнообразия.По распределению — стратегия занимает 5%, а все остальное — это контент в связке с дистрибуцией.Алина: Какие форматы сейчас более востребованы у компаний?Мария: Сейчас довольно много блогов, экспертных колонок и всего, что связано с подачей контента от лица компании. Удивительно, но стало больше экспертных комментариев в СМИ, хотя все говорят, что нужно фокусироваться на подготовке полноформатных материалов. Но и новостной формат все еще жив. Еще — компании стали чаще готовить и выпускать собственные исследования.Сегодня позиционирование — это про сторителлинг. Если раньше все было в духе «купил/продал бизнес, сменился директор» (кстати, сегодня такие публикации все еще актуальны для публичных фирм), то сейчас к этому добавился целый спектр тем о непосредственной деятельности компаний. Все-таки аудиторию интересуют не только услуги, но и история, которую бизнес о себе рассказывает. Раньше напрямую редко кто о себе говорил. Могли выходить новости, какие-то заявления регулятора и так далее. Сейчас коммуникации стали более я-ориентированными.Алина: Как правило, «я» в этом случае — это компания как самостоятельная единица или все-таки основатели?Мария: Иногда персональные коммуникации убирают полностью, бывает симбиоз — компания и человек рядом. Есть формат личной экспертизы основателей. Выбор подхода к общению с внешним миром зависит от внутреннего устройства бизнеса. Есть примеры, когда коммуникации компании и владельца не пересекаются.Как воспринимают PR разные отраслиТаймкод — 05:47Алина: Есть ИТ-компании, есть условно сырьевые. Всем нужен разный контент.Мария: Сырье, производство продукции, предоставление услуг и просто впечатлений — это условные четыре уровня проработки контента. Для последнего тебе нужна очень высокая вовлеченность аудитории и затраты на продвижение, для компаний первого уровня — практически нет разницы, что о них думают.Понятно, что для работы на финансовых рынках нужна какая-то деятельность в этом отношении, но если ты единственный поставщик или один из немногих монополистов в мире, то и контент, скорее всего, будет соответствующий.Между двумя крайностями есть товары и услуги. Здесь больше вариативности. Те, кто плотно сидит на контенте, научились с этого зарабатывать. Например, Skyeng. У них прекрасные коммуникации. Но не все уделяют этому моменту внимание.Проблема в том, что изменилась механика распространения контента. Если раньше все читали то, что хотела рассказать редакция условной газеты, то сегодня мы уже и не вспомним, где наткнулись на конкретную новость — в ленте у друга, мессенджере, телеграм-чате — вариантов много. Существенная часть из них — это соцсети, использующие алгоритмы, направленные на повышение вовлеченности аудитории. Об этом много говорит Даниел Канеман.Сегодня соцсети окружают тебя инфококоном и становятся проводником к еще более экстремальным версиям тех воззрений, которые ты уже исповедуешь— Даниел Канеман, психолог, экономист, лауреат премии по экономике памяти Альфреда Нобеля 2002 годаАлина: Поэтому достаточно странно видеть, что Facebook предлагает мне публикации про автосервисы с пометкой «вам понравится».Мария: Из такого информационного мешка сложно выбраться — мы не видим новости, которые не входят в круг наших интересов. Получается, что компаниям нужно уметь работать с таким положением дел — готовить нужный контент, понимать принцип действия алгоритмов и попадать к потенциальным клиентам. Если у тебя уже есть комьюнити, этот процесс становится более доступным, но для тех, кто не занимается коммуникациями, он постепенно становится дороже.Так ли нужна ли публичностьТаймкод — 11:02Мария: В России исторически есть утверждение: «деньги любят тишину». Понятно, почему сформировался и долгое время существовал такой подход — чем меньше знали про твое состояние или твою деятельность, тем было лучше с точки зрения безопасности. Ситуация в какой-то момент изменилась.Почему PR в США — такая огромная ниша: есть множество публичных компаний, а коммуникации — значимый инструмент влияния на их стоимость. В России не всегда можно сказать, к чему вообще относится PR. То это — маркетинг, то контент или еще что-то. Так происходит потому, что у нас мало публичных компаний.Но никто не отменял работу с инвесторами, партнерами и клиентами. Зависимость чуть менее прямая, но она есть. Хотя, если вспомнить скандалы в PR, будет смешно от того, что они практически не сказываются на продажах в России.Алина: Когда контент готовят в духе «так плохо, что даже хорошо».Мария: Да, у нас скандалы только-только начали влиять на B2B-сегмент, раньше такого не было. Но есть и компании, которые с помощью негатива или достаточно резкого контента умудряются цеплять свою аудиторию. Такой подход должен быть в ценностях бренда — например, как у Aviasales или Burger King. У них крутые коммуникации. Для меня это — хороший уровень сарказма.Алина: Но коммуникация Burger King в США и в России отличается.Мария: Да. Большой вопрос, как они умудряются согласовывать то, что делают в России, со штаб-квартирой. Это международная организация. Все-таки это — смелость местной команды. Она отражается на продажах.Люди больше любят негатив. Про него мы рассказываем друг другу практически всегда, а про позитив — только если развитие событий в разы превзойдет наши ожидания. Поэтому коммуникации через негатив — хорошие.Но есть рынки, где негатив не заходит. Например, в Азии.Региональные особенностиТаймкод — 18:38Мария: Те, кто занимается глобальными коммуникациями, знают, что невозможно осуществлять дистрибуцию без понимания особенностей рынка.Алина: Делать одинаковый контент для всех регионов.Мария: Да. Есть инфополе и культурные особенности в той или иной стране. Мы иногда смеемся над тем, что американские пиарщики часто считают, что везде все устроено, как в США. Но специалисты из других стран гораздо лучше понимают их специфику. Просто люди, которые работают на емких рынках, замыкаются на локальной аудитории, а остальной мир для них теряет значимость.Алина: Как дела обстоят с контентом в Китае? Вы же работаете там.Мария: Там свои платформы. Много видеоконтента — в разы больше. Из-за присутствия цензуры в медиа, блогеры — важнейший и самостоятельный инструмент для рекламных кампаний. В Китае нет деления на ютуберов и обычных блогеров. Они выглядят как медиа с большим числом собственных каналов, и к ним относятся соответствующим образом.Алина: А что с точки зрения тональности публикаций?Мария: Если вспомнить, есть 9gag. Это гонконгская история.Но внезапные провокации там воспринимают плохо. Шутки и юмор есть, но в «злобном» (в нашем понимании) виде там особо и нет контента. Вообще еще же есть японцы, которые очень любят поддерживать компании, испытывающие условные сложности с серверами или проблемы с техническими сбоями.Бесплатный и закрытый контентТаймкод — 28:53Мария: У нас много бесплатного контента. Но к платному люди начинают по-другому относиться — чаще предъявляют требования к содержанию. Это классно. Производство контента тоже дорожает.Есть спрос на закрытые сообщества. Их становится больше. Люди готовы платить за это. Например, В США есть The Information. Это рерайты новостей и экспертная аналитика за $399 в год. У них огромная база, они очень интересные и крутые, но представить что-то подобное несколько лет назад было сложно.Людям хотелось бы платить за то, на что они влияют напрямую, без помощи рекомендательных систем и алгоритмов. Такая модель будет востребована.Алина: Если кто-то из наших слушателей или читателей захочет запустить что-то подобное, что бы ты могла порекомендовать для старта?Мария: Важно понимать конкурентное поле, найти нишу. Если это бизнес, то в таких коммуникациях вполне может звучать мнение компании, а не просто новости. Контент должен эмоционально затрагивать людей и давать им что-то полезное.Текстовые версии наших других интервью на Хабре:Как превратить свое хобби в новое медиаЧто делает внешняя редакция для IT-компанийРабота редактора — своеобразная «военная драма»Как КиноПоиск делает своё медиаЧто такое генеративная музыкаКак размять «гзом» редактораКогда ты — главред Rusbase", {"day": "5", "month": "октября", "time": "11:23"}, {"rate": 4, "views": 883}], ["Привет, Хабр! Меня зовут Алсу Хлуднева, я — управляющий партнер компании QED.Consulting. Сегодня хотела бы обсудить такую специфическую тему, как b2b-бизнес в IT-отрасли. А именно — стратегию выхода на крупных клиентов и, что не менее важно, удержание этих клиентов.\n\r\nСтатья построена на основе личного опыта, в ней приводится несколько кейсов, которые могут оказаться полезными для читателей. В общем, под катом много интересного для тех, кто вовлечен в отрасль продаж и маркетинга и часто взаимодействует с крупным бизнесом, либо же только планирует выходить на новый для себя уровень.\n \nБизнес средний и большой — выбирай себе любой \r\nРаз уж мы говорим о крупных b2b-клиентах, в самом начале статьи хочу показать разницу между работой с компаниями среднего и большого масштаба. Разница весьма ощутима — она гораздо больше, чем особенности работы с малым и средним бизнесом.\n\r\nЧто касается среднего бизнеса, в большинстве случаев работа ведется с самой компанией, которой предоставляется презентация продвигаемого продукта. Контактировать придется с небольшим кругом лиц — чаще всего, с руководителем и/или одним из его заместителей. Можно сказать, что взаимодействие выполняется в 1-2 касания, не больше.\n\r\nВ случае выхода на крупные компании все гораздо сложнее. Вам придется работать не с одним человеком, а сразу с несколькими — центрами принятия решения в компании, которые часто противодействуют. У каждого из них свои цели, задачи и потребности, а значит и вы должны ваш продукт показывать под разными углами. \n\r\nЗа последние несколько лет появилось несколько важных нюансов:\n\n\nХолодные звонки практически не работают.\nКонференции, где можно было бы обратить на себя внимание представителя потенциального клиента, проводятся в онлайне.\nБольшинство бизнес-процессов и задач клиента уже закрыто тем или иным решением.\n \r\nЧто касается третьего пункта, то, согласитесь, сложно представить себе компанию масштаба «Сбера», Яндекса или Норникеля, у которой нет CRM-системы, отсутствует BI-аналитика и не внедрены облачные сервисы. Соответственно, есть две задачи — либо предложить новый продукт, который закрывает какую-то новую потребность компании, позволит ей сделать новый рынок вперед за счет инновационных решений, либо же эффективнее работает с задачей, для решения которой у компании уже есть инструмент.\n\nПодробнее о нюансах работы с крупным b2b-бизнесом\r\nВ случае корпораций круг людей, с кем придется взаимодействовать, гораздо шире, чем при работе со средним бизнесом. У больших компаний, как правило, есть несколько источников бюджетирования для покупки сторонних решений. Это может быть не только IT-отдел, но и операционный директор или директор по маркетингу. Какие-то решения о приобретении того или иного инструмента, решения, может принимать сотрудник, который обладает влиянием по определенным вопросам внутри компании. В моей практике был случай, когда окончательное решение о закупке решения по документообороту было принято благодаря личному помощнику и референту владельца нефтяной компании. Вы бы никогда на нее не вышли в рамках холодного звонка.\n\r\nВполне логично, что на людей, которые принимают решение (ЛПР) нужно выходить, но если они недоступны, вам нужно озаботиться выходом на людей, влияющих на принятие решения (ЛВР). Поскольку холодные звонки не работают, как уже говорилось выше, нужна стратегия, которая включает в себя несколько этапов:\n\n\nФормирование списка аккаунтов и сегмента людей, принимающих решения, которые могут быть заинтересованы в предлагаемом решении.\nФормирование максимально персонализированного предложения продукта для каждого из ЛВР. Для IT-директора это должно быть одно предложение, для маркетинг-директора — другое и т.п., хотя продукт один и тот же, ракурс разный. Индивидуальных предложений может быть 5-6, и в каждом необходимо фокусироваться на области интересов и зоне ответственности конкретного человека.\n \r\nСделать это не так просто. Для примера возьмем решение по автоматизации маркетинга. Если с ним мы хотим выйти на ритейл-сеть, необходимо проанализировать нюансы ведения маркетинга в компании, посмотреть публикуемые потенциальным клиентом статьи, сайт компании, рекламу, которую она дает. Кроме того, важным может быть и анализ закупочных тендеров, а также изучение публикуемых вакансий. Например, когда-то перед тем как прийти к ИТ-директору ГК “Росатом”, мы проанализировали все тендеры за 2 года всех ее дочерних компаний, и сразу подготовили ROI, сколько сэкономим компании благодаря нашему решению. Подготовительная работа заняла несколько месяцев, но разговор на языке точных цифр позволил нам сразу зацепить его внимание. Встреча длилась всего 25 минут, но зато нашему проекту сразу присвоили менеджера с пометкой “пилот”. \n\r\nКроме того, нужно изучить тренды в отрасли, понять, что представляют из себя конкуренты. Если мы хотим предложить что-то ритейлеру Х, нужно понять, что делают его конкуренты Y и Z… А если вы планируете выйти к монополисту или лидеру рынка — то международные тренды и лидеры. Зачем? Чтобы определить, куда движется рынок, какие существуют на нем тенденции и что важно указать при формировании оффера.\n\r\nФормирование точечных цепочек продвижения под каждого из ЛПР. Это может быть встреча на сторонней тематической конференции, вебинар, либо же собственноручно организованное мероприятие. На нем обязательно нужно раскрывать ключевые тренды отрасли, поднимать актуальные вопросы, которые могут быть интересны конкретному заказчику. Кроме того хорошо работают персонализированные подарки. Изучив соц.сети одного из ЛПР, мы выяснили, что он любит большой теннис. На одну из встреч мы принесли специально созданную закладку для ежедневника в виде теннисной ракетки. \n\nПарочка кейсов\nРабота с «Форс», дистрибьютором Oracle\n\r\nКомпания «Форс» продвигала программно-аппаратный комплекс для серверных крупных компаний. Стоимость этого продукта составляла от $50 тыс, так что необходимо было разработать четкий и эффективный план продвижения нового для российского рынка комплекса.\n\r\nНа первом этапе нами был сформирован круг целевых лидов, для которых решили провести ряд тематических мероприятий с целью привлечения этих лидов. Мы выбрали стратегию точечного подхода с проведением бизнес-завтраков, на которых рассказывали о том, как решаются задачи по оптимизации затрат для разных систем хранения и развертывания информации на облачных серверах.\n\r\nВ частности, в программу входило информирование о трендах в отрасли и особенностях выбора специфического оборудования. Потенциальные клиенты получали индивидуальную точечную рассылку с предложением принять участие в бизнес-завтраке. Затем им отправляли два гайда — для IT-директоров и гайд по мероприятию. После подтверждения участия мы звонили участникам и получали уже устное подтверждение. \n\r\nБлагодаря такому подходу удалось провести презентацию нового для рынка решения и привлечь на бизнес-завтрак 18 ИТ-директоров крупных производств.\n\nРабота с SAPRUN \n\r\nВторой кейс заключался в выходе на руководителей кадровой службы металлургических производств в рамках сопровождения одного из партнеров компании SAP в России. Решение, которое продвигали тогда — аттестация сотрудников для получения доступа к производственной линии. Для металлургии это крайне важно, поскольку отсутствие аттестата у сотрудника чревато огромными штрафами и частичной или полной остановкой производства.\n\r\nКомпании обычно заинтересованы в соблюдении всех правил и регламентов аттестации. Для того, чтобы привлечь потенциальных клиентов для продвижения решения по аттестации, мы провели образовательный вебинар для участников отрасли. Спикеры рассказывали, как избежать штрафов, какая документация должна быть у металлургического завода, а также как правильно опротестовать штрафы, если что-то все же пошло не так.\n\r\nОтмечу, что вебинар был крайне успешным с точки зрения получения клиентов — на продвижение вебинара ушло всего около 15 тысяч рублей, при этом удалось привлечь 4 крупных целевых лида, готовых к дальнейшему обсуждению внедрения. При стоимости решения порядка 9-12 млн.руб. — это был отличный результат. Это были представители крупнейших металлургических предприятий страны, с которыми затем встретились лично представители компании, которая поставляла решения по аттестации сотрудников.\n\r\nСтатистика по вебинару: \n\n\n​​Бюджет: 15 597,33 руб \nДлительность кампании: 2 недели\nОхват: 41 655 пользователей\nКлики по ссылке: 326\nРегистраций: 25\nРезультат: 12 лидов, 4 квалифированных лида готовых к обсуждению \n \nAccount based marketing\r\nВсе, о чем идет речь выше — маркетинг ключевых клиентов (Account-based marketing), сейчас это наиболее эффективный способ получения новых партнеров в крупном B2B. В случае его использования у компании, которая продвигает свои решения, должна быть крайне тесная и синхронная связь между департаментом продаж и департаментом по маркетингу.\n\r\nОбязанности между департаментами следует разделить заранее. Распределение должно быть очень четким и понятным — например, если нужно позволить и сделать первое касание, то команда маркетинга запускает несколько постов в социальных сетях. Сейлз может запросить у маркетинга разработку кастомной презентации или индивидуальные подарки для потенциальных клиентов. После привлечения клиента маркетинг делает пару «утепляющих» рассылок и лишь после этого сейлз делает звонок для индивидуального контакта. В этом случае конверсия значительно выше, чем при использовании холодных звонков от сейлза.\n\r\nКстати, не стоит пренебрегать и пиаром. Правда, традиционный PR работает уже не так хорошо. Поэтому многие агентства — например, Vinci Agency — для максимальной отдачи комбинируют разные каналы коммуникации.\n\r\nВажный момент — клиента нужно не только получить, но и удержать, ведь в b2b-сегменте клиентов не так и много. Некоторые компании могут обеспечивать 50% и выше плана продаж на год. Мы много раз сталкивались с тем, что даже очень успешные ИТ-интеграторы не умеют качественно проактивно развивать своих клиентов, они ждут входящих обращений. Более того, часто происходит так, что клиент идет на рынке искать определенное решение, даже не подозревая о том, что его текущий поставщик может предложить это решение. Особенно эта проблема актуальна для ИТ-интеграторов. \n\r\nНа мой взгляд, наиболее эффективной стратегией удержания клиентов является стратегия 4I:\n\n\nInvolve — вовлечение заказчика.\nImplement — внедрение решения в среде заказчика и демонстрация результатов. \nImprove — исправление ошибок первых двух стадий, сбор обратной связи и регулярное улучшение клиентского пути.\nIncrease — расширение сотрудничества, когда мы приходим с допродажей или пролонгацией.\n \r\nДля того, чтобы удержать клиента, стоит наглядно и регулярно показывать компании эффективность используемого решения. Если клиент ожидает роста выручки на 10%, и решение действительно обеспечивает такой рост, следует предоставлять доказательства роста, кроме тех, что есть у самого партнера. \n\r\nПомните, что если кто-то из ЛВР пролоббировал внедрение вашего продукта внутри компании, ему крайне важно показать эффективность этого внедрения. Зачастую такие инициативы строятся на желании продвинуться по карьерной лестнице. Если вы дадите ему такой инструмент — он не забудет о вас, даже если уволится и перейдет в другую компанию. \n\r\nЕсли все сделать правильно, вашему сейлз-менеджеру не придется бегать за представителем клиента с вопросами о продлении контракта, компания с большой вероятностью сама предложит продлить договор.", {"day": "2", "month": "сентября", "time": "17:34"}, {"rate": 1, "views": 2200}], ["Алексей Скорик из Vinci Agency специально для блога Нетологии расспросил руководителей стартапов и технологических компаний о том, как их команды создают пользовательские интерфейсы.\n\r\nЧто мы вынесли из этой беседы:\n\n\nглавное — это продукт, а не оформление;\n\nобщение с пользователями и пользовательская аналитика позволяют сделать максимально удобный в использовании интерфейс (но это не точно);\n\nодин из самых эффективных методов оценки пользовательских действий — тестовое задание;\n\nне стоит рассматривать UI в отрыве от UX — первое всегда стоит на страже второго;\n\nсубъективный вкус в интерфейсах — это хорошо, но data-driven подход всё же лучше;\n\nсамый простой и дешевый способ проверить продукт — «коридорное тестирование», которое в любом случае намного лучше, чем отсутствие какого-либо пользовательского тестирования вообще;\n\nчаще всего новые итерации какой-либо готовой функциональности направлены на её упрощение, а не на увеличение возможностей: а всё потому, что конечный пользователь не очень хочет вникать в интерфейс;\n\nдаже если показать результаты А/B-теста заказчику, у него всё равно могут возникнуть неконструктивные замечания — тут помогает спокойная планомерная работа и постоянный диалог по важным вопросам;\n\nUI должен помогать пользователю решать свои задачи в интерфейсе, и рассматривая его вне этого контекста, есть риск сместить смысл с пользы на украшательство;\n\nвсегда спрашивайте себя: зачем мы это делаем? решает ли это нашу задачу? какую пользу это принесет?\n\n\nАлександр Петерман, основатель Notify.Network:\n «чтобы UI был максимально удобным, мы используем собственную аналитику и прямое общение с пользователями»\n У нас объединенная команда разработчиков-дизайнеров для всех проектов, которыми мы занимаемся: от головной компании инвестиционного фонда до ключевых проектов, генерирующих денежный поток. Это позволяет эффективно использовать ресурсы, всегда предоставлять разработчикам интересные и новые задачи, а дизайнерам повышать квалификацию за счет применения подходов из разных отраслей. Самое главное, что наш подход позволяет привлекать самых талантливых людей из отрасли, которые одновременно обладают опытом и не скованы в своей творческой реализации. У нас прекрасно себя чувствуют специалисты по дизайну из Sberbank CIB и ряда европейских банков.\n\r\nТак как основная сфера деятельности связана с инвестициями и корпоративным рынком, мы создаем интерфейсы и стили, наиболее востребованные в деловой среде, поэтому эмоджи и селфи-смайлики — это не про нас.\n\r\nКакой алгоритм мы используем для утверждения макетов? \n\n\nПостановка задачи.\n\nИзучение референсов.\n\nРазбор референсов с целью определения ключевых точек для усовершенствования.\n\nРазработка дизайнерами нескольких первичных макетов.\n\nВыбор направления из представленных макетов или разработка нового.\n\nДоработка ключевой идеи выбранного макета.\n\nСдача на верстку.\n\n\r\nПосле разработки макета и интеграции дорабатываем его в живой среде. Менять что-то кардинально никогда не приходилось, так как у нас правильная поэтапная стратегия разработки.\n\nЧтобы UI был максимально удобным, мы используем собственную аналитику и прямое общение с пользователями. \r\nТакже делаем ставку на опытных специалистов, которые работают в отрасли не первый год и точно знают, что будет полезно пользователю.\n\r\nВ конце хочу сказать, что уже много лет назад усвоил правило: «если продукт не нужен, то как его ни упаковывай, толку не будет». Главное — это продукт, а не оформление. \n\nСергей Подшивалин, CPO Movista: \n«невозможно сразу сделать идеальный продукт, поэтому не стоит бояться разрабатывать сервис вместе с пользователями»\n Для Movista — сервиса по планированию путешествий  — мы в первую очередь мы изучили существующих на рынке потенциальных конкурентов: прямых и косвенных, отечественных и зарубежных. \n\r\nЗатем составили первую версию карты поведения пользователя в сервисе и собрали первый прототип, визуализированные в Figma. Так получилось оценить функциональность сервиса, проверить гипотезы и подготовиться к экспериментам с фокус-группами, чтобы уже с осознанными результатами реализовать концепции с дизайн-агентством.\n\r\nНа входе концепция продукта была сформирована нашим стратегическим маркетингом исходя из того, что главное конкурентное преимущество — возможность строить сложные мультимодальные маршруты. Нам нужно было объединить несколько существующих поведенческих шаблонов по покупке ЖД, авиа и автобусных билетов в одном интерфейсе, а также встроить поиск и продажу для всех видов транспорта в одной корзине.\n\r\nПри выборе и утверждении макетов мы руководствовались двумя аспектами: оценкой технических возможностей для реализации всех необходимых функций и последующими фокус-группами для выявления сильных и слабых сторон макетов. \n\nСамым эффективным методом оценки пользовательских действий в сервисе мы считаем тестовое задание. \r\nДля этого просим пользователя приобрести определенный маршрут и смотрим, как именно он это делает. Шаги, на которых он проводит много времени или начинает задавать вопросы, мы помечаем как моменты для анализа и доработки, а действия, которые он совершает быстро, относим к удобным и понятным. Такие итерации проводим после внедрения изменений и на разных группах пользователей, что позволяет делать сервис более универсальным и понятным.\n\r\nНам удалось уйти от стереотипного представления о сервисе по поиску маршрутов и покупке билетов, где пользователям необходимо заполнить два соответствующих окна «куда» и «откуда». На фокус-группах пользователи оценили краткое и лаконичное текстовое обращение «Я хочу добраться…» и выделили это как отличительную черту от других транспортных сервисов.\n\r\nНа рынке продажи билетов сложились различные типы поведений: авиабилеты чаще покупают туда и обратно, и пользователи хотят видеть сразу весь маршрут, в то время как в ЖД-сфере типична покупка билета сначала в одну сторону, а потом в другую.Мы не сразу выявили эти поведенческие особенности и реализовали универсальную выдачу маршрутов сначала туда, а потом обратно. Сейчас планируем сделать это нашим преимуществом, ведь когда пользователь привыкнет покупать билет на один вид транспорта, ему будет так же просто приобрести и билет на другой вид транспорта.\n\r\nГлавное — не бояться экспериментировать, с самого начала тестировать продукт на разных группах пользователей и улучшать UI. \n\nНевозможно сразу сделать идеальный продукт, поэтому не бойтесь разрабатывать сервис вместе с пользователями.\nИван Ардинцев, CPD Worki: \n«в визуальной составляющей мы не доверяем вкусовщине, а используем data-driven подход, поэтому разные варианты интерфейсных решений запускаем только через А/B-тестирование»\n Мы не рассматриваем UI в отрыве от UX. Первое всегда стоит на страже второго. В работе над UI мы не сильно отличаемся от большинства коллег: работаем над графическим представлением в последнюю очередь, когда все вопросы уже решены. Если задача попроще, то создаем решение сразу, если сложная — декомпозируем и делаем прототипы. \n\r\nВся техническая работа над интерфейсами у нас проходит в Sketch с системой контроля версий Abstract. Когда макеты готовы, соединяем их через Overflow, который генерирует удобную карту функциональности. Исходники для разработчиков загружаем в Zeppelin.\n\r\nНаш UI связан c UX, a UX — c умными алгоритмами формирования ленты вакансий и кандидатов. Мы используем машинное обучение, чтобы показывать кандидатам наиболее подходящие вакансии, а рекрутерам — наиболее подходящих кандидатов при холодном поиске в базе. Мы достигаем этого за счет четырех аспектов:\n\nСоциально-демографические характеристики кандидатов. У нас накопилась большая история просмотров и откликов вакансий от кандидатов, и сейчас мы ее используем, чтобы cделать продукт лучше, извлекая пользу из этих данных. Например, девушку восемнадцати лет, скорее всего, не заинтересуют вакансии грузчика или водителя, но могут заинтересовать мужчину сорока лет. Кроме того, скоро у нас появятся «Желаемые профессии», и кандидат сможет указывать, кем именно он хочет работать в первую очередь. Это еще больше улучшит ML-ленту. Сейчас мы генерируем персонализированную ленту с помощью 150 фичей.\n\nМгновенный интерес. Если мужчина сорока лет часто просматривает или добавляет в избранное вакансии кассиров, наши алгоритмы понимают, что ему интересны именно вакансии кассиров, а вовсе не грузчики или водители.\n\nШтрафы.Если рекрутер не обрабатывает отклики в течение определенного времени, мы делаем вывод, что по данной вакансии потребность в кандидатах удовлетворена, и понижаем ее в выдаче. Так мы стимулируем рекрутеров быстрее отвечать кандидатам.\n\nГруппировки вакансий. Существуют действительно массовые вакансии, вроде кассиров в KFC. Чтобы кандидат видел более разнообразную ленту, мы группируем их в одну вакансию, при этом показывая в ленте наиболее подходящую ему.\n\r\nВ визуальной составляющей мы не доверяем вкусовщине, а используем data-driven подход, поэтому разные варианты интерфейсных решений запускаем только через А/B-тестирование. Вместе с отделом аналитики мы внимательно следим за целевыми показателями каждого решения и спустя некоторое время оставляем максимально эффективный.\n\r\nЗаранее понять, что будет удобно, а что нет — сложно. В процессе работы над интерфейсами важен опыт дизайнера, когда он уже знает, какие шаблоны поведения работают и привычны для пользователя, а какие точно вызовут затруднения. Это не исключает возможности экспериментирования, но жестко-авангардные решения для массовой аудитории лучше не использовать.\n\r\nСамый простой и дешевый способ проверить себя — показать коллегам, провести «коридорное тестирование». Большинство нелогичных или непонятных вещей проявляются сразу же.\n\r\nБолее сложный и дорогой: UX-тесты на реальных пользователях с записью всех взаимодействий с интерфейсом на камеру и последующим мини-интервью. В условиях стартапа на это не всегда есть время и ресурсы, но для зрелых компаний это может стать основным вариантом, особенно если у сервиса большая аудитория.\n\r\nСамый частый случай для внесения изменений — это то, что конечный пользователь не очень хочет вникать в интерфейс. Каждые новые итерации какой-либо готовой функциональности чаще направлены на её упрощение, а не на увеличение возможностей, хоть и это тоже немаловажно. \n\r\nС каждой новой итерацией нужно просеивать интерфейсы и выносить на первый план наиболее важные элементы, а второстепенные отодвигать на второй план.\n\nЕсли вы работаете не над узкоспециализированным интерфейсом, правило «проще — лучше» должно быть на первом месте. \r\nНе стоит пытаться поразить пользователя богатством возможностей, нагружая каждый функциональный экран по-максимуму: в лучшем случае большинством из представленного просто не будут пользоваться.\n\nАлександр Жулин, директор по продукту Rubrain.com: \n«если всю работу начать с формирования общего визуального языка, это сильно облегчит работу сразу в нескольких направлениях в будущем и при этом почти ничего не будет стоить» \nКогда отвечаешь за продукт, тем более в стартапе, ты защищаешь решения внутри команды, а затем непосредственно перед пользователями. Слушаешь фидбэк, взаимодействуешь с бизнесом, оптимизируешь решения. Ты всегда можешь сразу анализировать живые цифры. А вот в проектной работе все сложнее. Тут приходится идти на компромиссы — убедить заказчика, что решение оптимальное, что бизнес-задачи в таком же приоритете, как и опыт пользователя. И если с UX это сделать чуть проще, то с UI все более субъективно. Даже если ты покажешь результаты А/B-теста, у многих заказчиков будут неконструктивные замечания. Тут помогает спокойная и планомерная работа с заказчиком — его надо выводить на конструктивный диалог по важным вопросам. Также помогает перед работой составить и утвердить гайдлайн — это сильный аргумент в будущих неконструктивных спорах. \n\nЧтобы понять, что для пользователя удобно, а что нет, на раннем этапе проектирования нужно пройти путь самому, протестировать все в сервисах на этапе прототипов, определить основные профили пользователей и прописать под них кейсы. \r\nВсе кейсы, разумеется, должны заканчиваться успешно, а сами критерии и параметры успешности тоже надо определить. Основная часть проблем уйдет с опытом, появится понимание поведения пользователей, их паттерны взаимодействия. Все это сэкономит много времени на начальных этапах в будущем.\n\r\nТе времена, когда между версиями могло проходить больше года, давно прошли. Всё ускорилось. В текущем мире бизнес-цели, задачи и среда меняются гораздо быстрее, чем продукт выходит в релиз. Так что продукт — это не монолит. Это система, которая должна меняться и подстраиваться под изменяющуюся среду с одной стороны и бизнес-задачи с другой.\n\r\nТакже важен простой, понятный и при этом эмоциональный и выразительный визуальный язык, по возможности еще до начала работы над экранами. Стиль, рифмы, приемы, ограничения. Все это нужно описать, продумать, сформулировать и оформить. Можно протестировать стиль на офлайн-носителях и даже на полиграфии. Это никогда не будет лишним, зато в будущем вы избавитесь от проблем несогласованности продукта и маркетинга, презентаций, документации, офлайн-материалов, лендингов и рекламы. \n\r\nМногие почему-то упускают это, но если всю работу начать с формирования общего визуального языка, это сильно облегчит работу сразу в нескольких направлениях в будущем и при этом почти ничего не будет стоить. Даже если сейчас вам это кажется абсолютно лишним. \n\nНикита Ушаков, сооснователь и директор по маркетингу TraceAir и Александр Сметанка, дизайнер TraceAir:\n\n«чтобы понять, что нашим пользователям кажется удобным или неудобным, нужно их знать, а для этого нужно много с ними общаться» \nМы делаем софт для эффективного управления строительством с помощью дронов. Хоть это и B2B-продукт, мы делаем его как B2C. В отличие от многих компаний, которые делают похожий софт для стройки, наша задача — сделать его полезным для полевого состава, а не только для инженеров, которые технически более подкованы и уже работают в различных сложных инженерных программах. В итоге мы устраняем дефицит информации для строителей, у которых нет времени ждать, пока геодезисты дадут им актуальную информацию о площадке или получат нужную информацию в сложном инженерном ПО. Поэтому мы делаем наш софт крайне простым. Почти каждый может научиться пользоваться нашим продуктом за полчаса или меньше.\n\nУ нас B2B-продажи, но с точки зрения пользования продуктом у нас больше B2C. Мы сторонимся неприятных, сложных для восприятия и использования многослойных интерфейсов, которые свойственны многим B2B-продуктам. Мы внимательно прислушиваемся к пользователям, к людям, как они пользуются продуктом, и адаптируем интерфейс, чтоб им стало ещё удобнее и проще решать свои проблемы. Процесс разработки UI не сильно отличается от аналогичного для B2C-продуктов: человек и его удобство во главе угла.\n\r\nУ нас два фронта сбора обратной связи — внутренняя команда и клиенты. Вся команда влияет на дизайн, каждый может внести свои изменения. Далее мы тестируем прототипы на наиболее лояльных клиентах, которые помогают довести его до рабочей версии. Финальное слово остается за дизайнером, и важно понимать, что это продуктовый дизайнер, решения всегда обоснованы и взвешены, и включают в себя возможности реализации в указанные сроки с определенными ресурсами разработки.\n\r\nЧтобы понять, что нашим пользователям кажется удобным или неудобным, нужно их знать, а для этого нужно много с ними общаться. Непрерывное общение и погружение в суть их профессий обеспечивает начальное понимание того, что им удобно. Но инновация не делается только с помощью общения с пользователями. Она также исходит от команды, стратегических целей, которые вы себе поставили, и принципов, следуя которым вы идете к этой цели. Наша цель — автоматизация стройки. Один из принципов — делать максимально простой продукт, которым может пользоваться каждый. Активно общаясь с клиентами и совмещая наши цели и принципы, мы формулируем гипотезы о том, что будет удобно или неудобно, а потом тестируем их.\n\r\nТакже у нас есть менеджеры по работе с клиентами, которые непрерывно общаются с клиентами и получают обратную связь. Особенно хорошо у них получается узнавать, что работает не так, как хотелось бы — об этом им рассказывают с большой охотой. Пользователи увлечены нашим продуктом и его развитие им не безразлично. \n\r\nПока мы все еще стартап, поэтому у есть ограничения по времени и ресурсам, и зачастую не получается просчитать всё, ошибки неизбежны. Например, мы не проводим масштабных A/B-тестирований интерфейсов из-за недостаточно большой для этого базы пользователей. Мы разрабатываем интерфейс, используя подробный фидбек от наиболее лояльных клиентов. Это быстро и удобно, но выводы, сделанные на основе общения с такой ограниченной аудиторией, рискуют не понравиться многим другим пользователям продукта. У нас никогда не было критических ошибок интерфейса, которые блокировали бы работу, но хот-фиксы интерфейса приходилось делать. Тут опять же очень помогала быстрая и проактивная связь от наших клиентов. \n\nСергей Киреев, руководитель дизайн-отдела AIC:\n«мы любим красивые и проработанные интерфейсы, но если продукт работает плохо, UI не заставит людей им пользоваться»\nUI должен помогать пользователю решать свои задачи в интерфейсе. Рассматривать его вне этого контекста чревато смещением смысла с пользы на украшательство. Поэтому для молодых продуктов вектор развития в работе с UI должен быть таким: сначала помогать и вовлекать, затем формировать привычки и создавать новый уникальный опыт. \n\r\nВ каждой отрасли есть свои особенности, свои сложившиеся паттерны поведения и тренды. Но есть и универсальные конструкции, применяемые везде. Отслеживать, интерпретировать и грамотно их применять — задача профессионального дизайнера, а осознанность — основной критерий в работе с UI. Всегда спрашивайте себя: зачем мы это делаем? Решает ли это нашу задачу? Какую пользу это принесет?\n\r\nВот несколько правил для эффективной работы с UI, которые я выделил для себя:\n\n\nТестировать продукт постоянно. Важно проводить количественные и качественные тестирования. Количественные помогут оптимизировать сценарии и понять, где кроется проблема, а качественные — докопаться до сути проблемы и узнать глубокие инсайты. \n\nДизайн — это постоянная работа над ошибками. Важно быстро реагировать, исправлять и из каждого промаха извлекать опыт, фиксируя его, чтобы не допускать похожих ошибок в будущем. \n\nДействовать аккуратно. Не стоит выкатывать новый дизайн сразу на всех пользователей — люди боятся всего нового и неизвестного. Надо определить ключевые метрики, найти лояльную аудиторию и начать с нее. Собрать фидбек, понять, где ошибки, поправить и сделать обновление. Действовать короткими итерациями.\n\nСформулировать 10 принципов, определяющих, что такое хороший дизайн для того продукта, над которым работаешь. Пусть они станут ориентиром и проверкой решений дизайн-команды. Эти принципы могут касаться самых разных аспектов, которые вы посчитаете важными для вашего продукта или компании, но не должны иметь двоякого или абстрактного трактования. Примеры таких принципов можно посмотреть на designprinciplesftw.com.\n\nЗаставить дизайн-команду документировать свои решения, проводить ревью макетов, составлять библиотеки элементов и паттернов. Это нужно для тех ситуаций, когда есть риск получить элементы интерфейса, которые выглядят по-разному, хотя и выполняют одинаковую функцию, или наоборот.\n\n\nОт редакции\r\nКурсы «Нетологии» для дизайнеров интерфейсов:\n\n\nпрофессия «Продуктовый дизайнер»\n\nпрофессия «UI-дизайнер»\n\nпрофессия «UX-дизайнер»", {"day": "4", "month": "марта", "time": "18:39"}, {"rate": 14, "views": 4800}], ["This post is a continuation of the first part of the real story of Android Robotics describing the field from the beginning up to 2019.\n\r\nOsaka University continued to collaborate with Kokoro Dreams constructing robots for academia. There was CB2 created in 2006 as a project for Exploratory Research for Advanced Technology (ERATO) at Japan Science and Technology Agency (JST). The robot was designed to resemble a child, a big one, but nevertheless, a child, to experiment on artificial intellegence and learning. In this sense CB2 was similar to quite an successful European project iCub beginning from 2009.\n\n\r\nProfessor Hiroshi Ishiguro at the time became interested in what i would describe «looking for a minimal human-likeness», creating robots that would not in a sense be fully human-like, but which would still retain human features. Telenoid, produced in August 2010 was the main robot that came out of that period, a sort of «large phone» in a robot form, controlled by an operator. There also was Elfoid created a year after, «a small phone». For most people these robots fell straight into the uncanny valley, but this did not meant that no research could've been done using those.\n\n\r\nArguably one of the most popular projects by Hiroshi Ishiguro was experimenting with teleoperation via androids of the likeness to a person who is supposed to be the operator. The first of such robots was Geminoid-HI-1, with HI meaning «Hiroshi Ishiguro», released on July 2006. Geminoids were all built by Kokoro Dreams, were air-driven, and were all lacking any autonomous functionalities (there could be some idle animations, though), and were fully remotely controlled by an operator. There were multiple versions of Geminoid-HI produced, if i recall correctly, four in total, and to this day research is happening using these robots.\n\r\nDuring his 2012 lecture at Moscow State University, Hiroshi Ishiguro told an anecdote on how the university denied him payment if he was to use a teleoperated android to give a lecture instead of being present at the stage himself. Hiroshi Ishiguro likes to raise quite a lot of questions far beyond simple engineering, questions «what makes human a human», the kind of questions that documentary filmmakers like to put in the beginning of their films about androids. One of the points i find particularly interesting he made during that lecture, was on how android robotics is another way of researching humans, similarly how an artist might learn a lot about art by smartly copying others' works, an android roboticist learns about humans by recreating them in the form of androids.\n\n\r\nAnother Geminoid was created in 2009, this time based on a woman's image. Geminoid–F was similar to the earlier models of Geminoid–HI (later Geminoid-HI models received hand movements), and in 2011 Kokoro Dreams had shown Actoid-F based on the same design. Geminoid-F had not a research career, but a theatre one, performing in a stage play called «Sayonara» («Goodbye») in a role of an android. Later this stage play was adapted into a movie. There also was a stage play based on Anton Chekhov's «Three Sisters» in which Geminoid-F participated. Usage of androids in art and theatre is one of the expansions of the initial entertainment field, and as it turns out, androids work there quite well. Currently, to my knowledge, Geminoid-F stays with the Tokyo University of Arts.\n\n\n\r\nNext, Geminoid-DK was released, with DK standing for «Denmark». This time the focus was again academic, and this was the first Geminoid to move overseas, as it was created in an image of a professor Henrik Schärfe from Aalborg University in Denmark. Geminoid-DK is notable for being one of the most realistic of the series, and it is also known how much the robot was cost to built, it was mentioned in the interviews that the total cost was $200,000. \n\n\r\nAt one point, three Geminoids with the people who were the source images met at one place, creating quite a scene.\n\n\r\nHiroshi Ishiguro's and Advanced Telecommunications Research Institute android robotics research in teleoperation, autonomous operation and art had combined in a sense with the opening of a new «What is Human?» exhibition in June of 2014. \n\r\nTwo robots had opened the exhibition, Otonaroid («Adult-roid») and Kodomoroid («Child-roid»). Otonaroid is teleoperated by the museum's staff or by a guest, and can be seen at the museum to this day, although, the current version is a second iteration. \n\r\nKodomoroid had since moved to London to quietly perform idle animation at London Science Museum until late 2017, but initially she was reading the automatically parsed news articles. It was quite a curious sight, seeing a child robot reading, in a calm child TTS voice all the world news. \r\nThe third robot arrived soon after. Alter as it's called, is, like Telenoid, a «simplistic» android robot, created essentially as an art project. Random movements around Alter get scrambled and turn into movements of the robot, resulting in chaotic yet somewhat organic action. Currently, at the museum the second iteration of Alter is present.\n\n\n\n\r\nA recent major project of Hiroshi Ishiguro, Advanced Telecommunications Research Institute (ATR) and Exploratory Research for Advanced Technology (ERATO) at Japan Science and Technology Agency (JST) and A-Lab is ERICA, shown to the world on August 2015. ERICA is an acronym for The ERATO Intellegent Conversational Android and she is the most complicated android of the team, possibly hardware-wise and definitely software-wise. There is plenty of documentaries and articles regarding ERICA, but i'll briefly describe the project. \n\r\nERICA was created not in an image of someone, but instead, modelled on DaVinci's principles of a perfect proportions. ERICA is a base for artificial intellegence research, but in addition to pure science, ERICA appears on television, and even has her own Twitter account, where she currently videoblogs daily. Of course, for videoblogs and TV shows, she is controlled, but the AI routines are quite impressive, and she can quite decently lead a conversation in English and Japanese without losing track of what being said, like even the Loebner prize winning Mitsuku.\n\n\n\r\nERICA also performed in a rap song about the AI research the team did, and it feels if out of the all videos in the story you were to watch one, this should be this one video, it's a perfect example of a nerdcore.\n\n\nhttps://www.youtube.com/watch?v=nr867hoQB-M</oembed\nA-Lab needs to be mentioned a bit more than in the list of collaborators for ERICA, as it comes to be another major Japanese player in a last few years when it comes to constructing androids. The company is founded by Takeshi Mita in Tokyo and Hiroshi Ishiguro is the company's tech advisor. A-Lab first appeared in 2013 with the release of an android called Asuna. Asuna looks like a 15-year old girl, she is a teleoperated android with a bit of autonomous idle motion.\n\n<oembed>https://www.youtube.com/watch?v=QNidindbyI8\n\r\nA-Lab was in charge of engineering side of building an android copy of Leonardo da Vinci, which was designed by Professor Minoru Asada of Osaka University. The android was commissioned by Leonardo da Vinci Android Initiative and displayed at the National Museum of Science and Technology in Milan appropriately named «Leonardo da Vinci» at the same time World Expo 2015 was taking place near the city. The robot then returned to Japan, and for a brief moment was displayed at a showroom for JTEKT, a bearing-producing company.\n\n\r\nWith the financial support of PARCO, a Japanese retailer, Hiroshi Ishiguro in 2016 and 2017 advised on Androidol U and (possibly) Samantha U. The first android was planned to be used in an online show series, and went on a few publicity stunts, and in November of the last year went on an exhibition in India. The second so far had only been displayed at a Samantha Thavasa luxury bag bag shop earlier last year. The second video is by a Twitter user @missbitcoin_mai.\n\n\n\r\nA-Lab continued to produce androids, Keieisyaroid, a couple of androids in the likeness of modern Japanese TV show celebrities (such as Totto which is notable for pseudo-AI or weak AI routines present). A-Lab has more androids in the likeness of other people in development.\n\n\r\nOne of the latest robots of theirs is an impressive android in the likeness of a Japanese classic writer Natsume Soseki. Natsume Soseki android was first displayed in December 2016, and to this day appears before students. While DaVinci mentioned above has a pre-recorded routine in Japanese and Italian, Natsume Soseki seems to be remotely controlled, but might have some pre-recorded routines and idle motions. \n\n\r\nThe latest project of Hiroshi Ishiguro and JST ERATO is ibuki, first shown to the public in July 2018. ibuki is a child android on a robotic-looking wheel body. One of the first researches published straight away is a research on how to imitate walking yet using the wheel body. ibuki is the base of a new Symbiotic Human-Robot Interaction Project, with the project continuing the research in AI and human-robot interaction of Hiroshi Ishiguro. ibuki is motor-powered unlike most of the androids, which are air-powered, and he's also mobile, which is a new thing for Hiroshi Ishiguro android robots (there have been mobile robots in his laboratory since the beginning, but never androids).\n\n\n\r\nParallel to ibuki, in the last year, another child-looking android head was shown, created by a different team in Osaka University, an update to 2011 android Affetto.\n\n\r\nReturning to Kokoro Dreams, they have not only produced research robots for Osaka University and the projects of Hiroshi Ishiguro. Actroid-SIT (nicknamed Eri) from 2010-ish resides in Nara Institute of Science and Technology (NAIST) and is used for human-robot interaction research performed by a team under the lead of Yutaka Kondo. \n\n\n\r\nTwo robots were commissioned from Kokoro Dreams in 2013 by Anhui Province Key Laboratory of Affective Computing and Advanced Intelligent Machines of Hefei University of Technology (P.R. China), one in the likeness of professor Xiao Sun, the research team leader. The woman robot utilises a similar base as Actroid DER3. \n\n\r\nOne fairly simple android built by Kokoro Dreams went to the T Stone Robotics Institute of The Chinese University of Hong Kong.\n\n\r\nIn 2015 a robot in a likeness of professor Yang Song («President of Shanghai Shenquing Industry and Japan Sanlian Robot Professor of Sanlian College») was revealed, and Hiroshi Ishiguro was involved with the design. It is quite an impressive android hardware-wise, but after an initial presentation all sources went quite quiet.\n\n\r\nThe next robot is far from being unknown, built by Kokoro Dreams in 2015, Nadine, is quite a popular figure. Nadine, an android built in the likeness of professor Nadia Thelman from Institute for Media Innovation, Nanyang Technological University (IMI NTU) is used for artificial intellegence and human-robot interaction research, and Nadia Thelman seem to be quite open with describing and showing the project to the public, to the level, that even the Wikipedia page for Nadine looks impressive. \n\n\n… continued in part three ...\n\nAndroid Robotics up to 2019: The real story; in five parts; part 1; part 2; part 3; part 4; part 5", {"day": "21", "month": "января", "time": "14:54"}, {"rate": 13, "views": 3000}]], "refs_quant": 5}