{"info": null, "refs": [["7 декабря состоялась церемония награждения лауреатов премии Рунета 2021 года. В этом году на премию было подано 1097 работ за вклад в развитие российского сегмента сети интернет в девять основных и четыре специальные номинации. Финалистами конкурса в каждой номинации стали по 10 организаций. \n\r\nЛауреатами премии Рунета 2021 стали 52 компании и 3 персоны. Причем раньше организаторы (Российская ассоциация электронных коммуникаций — РАЭК) награждали несколько лучших представителей в каждой из номинации, по мнению экспертного сообщества. В этом году они обратились к помощи искусственного интеллекта и добавили еще одного лауреата, который выбирался именно по мнению ИИ. \n\r\nНоминация «Государство и Общество», победители:\n\n\n Благотворительный фонд «Подари жизнь»;\n АНО «Диалог»;\n Правительство Москвы, проект Цифровая экосистема Москвы;\n ФНС России;\n Программа «Пушкинская карта» / АО «Почта Банк».\n\r\nНоминация «СМИ и Массовые коммуникации»: \n\n\n Телеканал 360;\n Медиахолдинг Independent Media;\n АО «Коммерсантъ».\n\r\nНоминация “Образование и Кадры”:\n\n\n Правительство Москвы, проект “Московская электронная школа” (МЭШ);\n Проект программы “Сбер для детей и родителей” совместно с Rambler&Co;\n ООО “Цифровое образование”, проект ИКОП “Сферум”;\n Образовательная платформа “Нетология” (ООО “Нетология”);\n Компания Samsung Electronics.\n\r\nНоминация «Наука, технологии и инновации»:\n\n\n Gett;\n Иннотех;\n Skillbox ;\n Промобот;\n SberDevices ;\n Билайн.\n\r\nНоминация “Культурные проекты в Сети”:\n\n\n Общественное телевидение России;\n Проект “Путь героя” информационного агентства ТАСС и киностудии “Союзмультфильм”;\n Эмпатия Манучи (авторский канал Манучарова Вячеслава);\n Федеральное государственное бюджетное учреждение культуры «Всероссийское музейное объединение “Государственная Третьяковская галерея”.\n\r\nНоминация “Игровая индустрия и киберспорт”:\n\n\n Федерация компьютерного спорта города Москвы — “Московский Киберспорт”;\n ESforce Holding;\n Cybersport.Metaratings;\n MetaMMA;\n Goose Gaming.\n\r\nНоминация “Креативные индустрии”:\n\n\n Ассоциация профессиональных участников творческой экономики “Федерация креативных индустрий”;\n ООО “Гэллэри Сервис”;\n Vinci Agency;\n Проект по веб-инклюзии (Студия Артемия Лебедева).\n\r\nНоминация “Здоровье и медицина”:\n\n\n Здоровье.ру;\n Проект „Здоровое Питание“ (Федеральная служба по надзору в сфере защиты прав потребителей и благополучия человека);\n Правительство Москвы, проект по использованию технологий компьютерного зрения на базе искусственного интеллекта (ИИ) для анализа медицинских изображений.\n\r\nНоминация “Экономика и бизнес”:\n\n\n СберМаркет;\n Balance Platform;\n Московская биржа;\n Метарейтинг.\n\r\nНоминация “За развитие среднего и малого бизнеса в Рунете”: \n\n\n Портал для предпринимателей Smallbusiness.ru;\n ПАО „МТС“, проект “Знаем лично”;\n Банк ВТБ ПАО, проект интернет-банк.\n\r\nНоминация “#СЧАСТЬЕЕСТЬ”: Автономная некоммерческая организация по развитию экологических, социальных и патриотических проектов „Сад Памяти“.\n\r\nНоминация “Развитие внутреннего туризма”: \n\n\n Проект Oh My Град;\n Россия: 85 приключений, проект онлайн-медиа Russia Beyond, входящее в телесеть RT;\n АНО “Проектный офис по развитию туризма и гостеприимства Москвы” Туристический сервис RUSSPASS;\n Комитет по туризму города Москвы, проект Discovermoscow.com.\n\r\nНоминация “Открытые коммуникации”:\n\n\n Мэр Вологды — Сергей Воропанов;\n Правительство Тульской области;\n Федеральное агентство по туризму, портал Russia.travel.\n\r\nНародном голосовании премии Рунета 2021 были выбраны такие лауреаты: \n\n\n в номинации “КТО”: Дмитрий Спиридонов;\n в номинации “ЧТО”: Forza;\n в номинациилучший цифровой регион (номинация “Где”): город Москва.\n\r\nВдобавок за персональный многолетний вклад в развитие интернет-отрасли награду премия Рунета 2021 получил экс-глава Роспечати Михаил Сеславинский. \n\n\n\r\nВ этом году Хабр также подавал заявку на участие в премии Рунета в номинации «Креативные индустрии». Заявлен был наш конкурс «Технотекст». Мы не стали лауреатами, но вошли сперва в шорт-лист, а затем и в число финалистов рядом с очень серьёзными соперниками. Описание заявки Хабра можно посмотреть на странице сайта конкурса.", {"day": "8", "month": "декабря", "time": "09:30"}, {"rate": 6, "views": 2300}], ["Согласно информации издания «РБК», 24 марта 2020 года Минкомсвязи предложило включать в список проекта «Доступный интернет» только сайты и сервисы, работающие на российском ПО, имеющие отечественный контент и принадлежать гражданам России. \n\r\nПредварительный февральский список Минкомсвязи российских социально значимых интернет-сервисов с бесплатным доступом проекта «Доступный интернет» включал в себя государственные информационные ресурсы (портал госуслуг, сайты президента России, правительства, Госдумы, Совета Федерации, всех федеральных органов исполнительной власти и восьмидесяти пяти региональных правительств, причем доступ к сайтам региональных министерств и департаментов через сайт регионального правительства также должен быть бесплатным), отдельные социальные сети и мессенджеры, а также некоторые почтовые сервисы. \n\r\nВ настоящее время Минкомсвязи предлагает, чтобы бесплатные отечественные социально значимые информационные ресурсы одновременно отвечали требованиям:\n\n\n используют домен, относящийся к группе составляющих национальную доменную зону (используют домен .ru или.рф);\n функционируют с использованием компьютерных программ и баз данных, включенных в реестр российского программного обеспечения;\n предоставляют возможность доступа исключительно к российским социально значимым информационным ресурсам и контенту;\n имеют провайдером хостинга российское юрлицо, которое использует серверы, имеющие заключение о подтверждении промышленной продукции на территории России, и софт, внесенный в реестр отечественного ПО;\n владельцем является российское юрлицо или гражданин России.\n\r\nПричем к пользователю тоже есть требования — он получит право на бесплатный доступ к ресурсам проекта «Доступный интернет» только после идентификации через Единую систему идентификации и аутентификации (ЕСИА).\n\r\nС требованием по программному обеспечению не все так просто. Так как разных движков, то есть программной основы, для больших сайтов не так много. Большинство проектов используют две веб-сервера с открытым кодом — Nginx и Apache, а также решение от Microsoft. Хотя Nginx и российского происхождения, но оба этих решения сейчас принадлежат не российским компаниям, и соответственно не входят в реестр отечественных программ. В реестре есть, например, система Битрикс (Bitrix), на которую потенциально могли бы перейти сайты. Однако она, во-первых, платная, а, во-вторых, многие высоконагруженные проекты, к которым относятся любые сервисы, изначально упомянутые в проекте, от почты до соцсетей и картографических сервисов очень зависят от производительности веб-сервера, собственно, именно под такие задачи и был разработан, например, Nginx.\n\r\nВ настоящее время получается, что под разработанные Минкомсвязи критерии подпадают только сервисы и порталы типа Gosuslugi.ru или Mos.ru и российские интернет-ресурсы, работающие на веб-сервере Bitrix. Вдобавок не у всех государственных сайтов есть домен в национальной доменной зоне. «Многие сайты региональных министерств и муниципалитетов изначально не подойдут, но постепенно будут брать себе кириллические доменные зоны и переходить на отечественный веб-сервер Bitrix, что будет довольно затратно для бюджета», — пояснил изданию «РБК» разработчик сайта Kremlin.ru Артем Геллер.\n\r\nПресс-служба Минкомсвязи сообщила изданию Forbes, что полученная изданием «РБК» версия документа с критериями к ресурсам проекта «Доступный интернет» не окончательная и еще может поменяться. \n\r\n2 марта 2020 года по данным издания «Коммерсантъ», из-за проблем с согласованием необходимых документов и постановлений, Минкомсвязи не смогло с 1 марта 2020 года запустить в активную фазу реализацию первого этапа проект «Доступный интернет». Таким образом, организация бесплатного доступа россиян к социально значимым интернет-ресурсам была отложена на неопределенное время, как минимум на несколько месяцев.\n\r\nРанее 15 января 2020 года президент России Владимир Путин поручил в ежегодном послании Федеральному собранию подготовить и реализовать проект «Доступный интернет», в рамках которого гражданам предоставят бесплатный доступ к социально значимым интернет-сервисам.\n\r\n21 января 2020 года Минкомсвязи сообщило, что с 1 марта 2020 интернет-провайдеры перестанут взимать плату за доступ к порталу госуслуг и сайтам органов власти.\n\r\n24 января 2020 года Минкомсвязи опубликовало предварительный список российских интернет-сервисов с бесплатным доступом. Предполагалось, что воспользоваться сервисами из списка с 1 марта 2020 года можно было даже при нулевом балансе счета абонента. Посещение сайтов из списка не будет засчитываться биллинговыми системами операторов связи в общий тарифицированный объем использованного мобильного трафика.\n\r\n11 марта 2020 года глава Минкомсвязи Максут Шадаев рассказал, что список социально-значимых сайтов и сервисов для проекта «Доступный интернет» находится на рассмотрении специалистов министерства, но в нем уже есть определенности по некоторым категориям.", {"day": "24", "month": "марта", "time": "14:30"}, {"rate": 10, "views": 5900}], ["3 июня в Москве прошёл myDribbble Meetup 2017. На этой неформальной конференции для дизайнеров выступили полтора десятка сильных и начинающих специалистов, многие из которых представленны в одной из главных тематических социальных сетей Dribbble. Создатели инструментов Principle и Sympli, Георгий Квасников (Fantasy), Олег Береснев (Beresnev Design), Макс Орлов (ONY), Николай Иванов (AIC), Артём Геллер (Дизайн государственных систем), Иван Васильев (Альфа-Лаборатория), Илья Гришин и Олег Андрианов (ВКонтакте), Дмитрий Чута (Screens Today / Chapps), Радик Загидуллин, Даниал Сиддики, Лена Аникеева (Pixies), Роман Храмов (Tappawards / Cuberto), Андрей Сундиев, Дмитрий Осадчук, Евгений Долгов и Дарья Ганцева (Mail.Ru Group). Было много практически полезных рассказов и историй из жизни дизайнеров и компаний с живым и веселым диалогом со слушателями.\n\n\n\r\nВместе с Олегом Андриановым мы проводим митап уже в шестой раз при поддержке Mail.Ru Group и Dribbble, а в этом году наша команда расширилась — подключились Андрей Сундиев, Дмитрий Осадчук, Евгений Долгов, Денис Шумов, Дарья Ганцева и Слава Яшков. Московский митап — один из самых крупных в мире. За шесть лет на сцене выступили 78 спикеров, а гостей набралось несколько тысяч. В этот раз мы побили все рекорды — в зале в течение дня побывало 1000 гостей, онлайн-трансляцию смотрело около 10 000 человек, на афтепати было около 70. Неплохой рост: 70 в 2012 году, 400 в 2013, 550 в 2014, 600 в 2015 и 900 в 2016. Четвёртый год мероприятие проходит в офисе Mail.Ru Group на Ленинградском проспекте.\n\nМитап за шесть лет\r\n2012 — 70\r\n2013 — 400\r\n2014 — 550\r\n2015 — 600\r\n2016 — 900\r\n2017 — 1000\n\n\n\n\n\n\n\n\n\n\n\r\nПрограмму открыл Георгий Квасников из нью-йоркского офиса Fantasy. Он в деталях рассказал о дизайн-процессе в студии на примере условного проекта от исследований до запуска, а также своём пути в компанию. В прошлом году его выступление сорвалось в последний момент, но этим летом всё срослось.\n\n\n\n\n\r\nСледующим был создатель инструмента Sympli для передачи макетов разработчикам Максим Игнатьев. Он вкратце рассказал о продукте и анонсировал решение для версионности макетов на базе Git. Сейчас это одна из самых востребованных вещей и уже можно записаться на бета-тестирование.\n\n\n\n\n\r\nВместе с Дмитрием Чутой из студии Chapps мы попробовали новый формат портфолио-ревью — несколько дизайнеров рассказали об одном недавнем проекте. Недавно он запустил сервис Screens Today, который помогает дизайнерам публиковать свежие работы и пытается решить текущие ограничения других площадок. Формат портфолио-ревью отлично вписывается в митап и в следующем году мы проработаем его, чтобы получилось совсем хорошо.\n\n\n\n\n\nРадик Загидуллин показал, как развивался стиль иллюстраций MAPS.ME.\n\n\n\n\n\nДаниал Сиддики презентовал огромное количество концептов для конкурса Badoo.\n\n\n\n\n\nЛена Аникеева из Pixies рассказала о создании айдентики Chefshows.\n\n\n\n\n\r\nПосле обеда Илья Гришин и Олег Андрианов сделали целую пачку анонсов от VK. Кусочки процесса работы над дизайном VK Mobile и VK Live, конкурс на лучший дизайн раздела Discover, подробности запуска мобильного оператора.\n\n\n\n\n\r\nDaniel Hooper, один из создателей Principle, приехал к нам вместе со-основателем Stan Stevens. Он рассказал об инструменте, его возможностях и истории создания. В ходе плотной сессии вопросов и ответов они намекнули на следующую версию, а также дали понять, в какую сторону будет развиваться Principle, а какие возможности противоречат их видению. Оказалось, что у Стэна был день рождения \n\n\n\n\n\r\nПосле перерыва Роман Храмов из Cuberto анонсировал награду для мобильных приложений Tappawards. Она предназначена для реально работающих продуктов, которые уже находятся в магазинах приложений и собрала неплохое жюри.\n\n\n\n\n\nМакс Орлов из ONY сделал презентацию на одну из самых актуальных сейчас тем — связка бренда с интерфейсом. Сравнительно небольшое количество компаний нашли способ отразить язык и ценности бренда в цифровых продуктах, а на системном уровне — и вовсе единицы. Макс собрал, наверное, все имеющиеся на текущий момент примеры из мировой практики и показал, как это делает ONY — они одна из редких компаний в России, которая осознаёт важность этой проблемы и старается решить её в своих проектах.\n\n\n\n\n\r\nЕщё одним экспериментом в рамках митапа стала панельная дискуссия по дизайн-системам с участием Артёма Геллера из Дизайна государственных систем, Ивана Васильева из Альфа-Лаборатории и Андрея Сундиева из Mail.Ru Group. Это одна из самых актуальных тем в последние несколько лет, хотя в России пока не так много компаний, которые имеют внедрения на технологическом уровне. Формат таких круглых столов отлично работает у нас на UX-Среде, но в рамках большой конференции дискуссия идёт сложнее, поэтому мы повторим эту тему осенью в более тесном кругу.\n\n\n\n\n\nНиколай Иванов из AIC рассказал о противоречии в мировоззрении дизайнера, который работает над большими проектами и хочет публиковать работы на Dribbble. Зачастую полезный и востребованный людьми продукт, сделанный на хорошем уровне, достаточно скучен для публикации на Dribbble, так что нужно добавить «сока», не относящегося к реальной задаче.\n\n\n\n\n\r\nВ этом году мы ещё больше заморочились с айдентикой myDribbble Meetup 2017 и сделали целостный стиль, который распространился на всё оформление конференции — сцена и интерьер, сайт, футболки, видео-отбивки, пиво, пакеты и уйма приятных мелочей. Дизайнеры из разных подразделений компании Андрей Сундиев, Дмитрий Осадчук, Евгений Долгов и Дарья Ганцева собрались в инициативную группу для этой задачи и рассказали о том, как создавался этот стиль. К сожалению, Денис Шумов слёг с температурой и не смог подключиться к выступлению.\n\n\n\n\n\r\nЗакрыл программу Олег Береснев, студия которого делает безумно крутые анимированные иллюстрации. Он рассказал о том, как начинал карьеру, как менялся формат работы с клиентами и как добавление анимации поменяло их видение и формат работы — они открыли игровую студию и делают ещё более яркие и погружающие проекты. Это был идеальное выступление для концовки — от души и про то, что движет ярким дизайнером.\n\n\n\r\nВ прошлом году мы попробовали много нового, а в этот раз развили и улучшили идеи — единая айдентика для цифровых каналов и интерьера, дизайнерское пиво без проблем с баром для афтепати, лучшее оформление сцены, два фургона с едой (включая лучшие бургеры на выезде в Москве от Burger Heroes), трансляция в 360, новый подход к программе с портфолио-ревью и круглым столом. Ещё есть что улучшать во всех отношениях, но уже сейчас видно, что митап выходит на новый уровень. В следующем году нужно будет усилить работу по самому главному — программе — потому что старый подход неформального мероприятия уже даёт сбои. В общем, есть над чем работать.\n\n\n\n\n\n\n\n\n\n\n\r\nИменно подход «каждый раз чуть больше, чуть лучше» позволил нам вырасти из партизанского междусобойчика в одну из крупнейших дизайн-конференций в России. В следующем году мы, наверное, скорректируем формат чуть заметнее — уже есть идеи и желание исправить основные косяки. Но митап всё также пройдет в первую субботу лета — например, 2 июня. Следите за анонсами в Фейсбуке, Твиттере, ВК, Телеграме и на сайте мероприятия.\n\n\n\n\n\n\n\n\n\nP.S. Спасибо всем, кто выступал и пришёл послушать — именно вы сделали этот митап. В плане организации в этом году к нам с Олегом Андриановым подключились Андрей Сундиев, Дмитрий Осадчук, Евгений Долгов, Денис Шумов, Дарья Ганцева и Слава Яшков — они придумали и реализовали все эти безумные идеи по единому стилю конференции. Ничего этого не было бы возможно без нашей безумно крутой команды внутренних мероприятий, и особенно Даше Прохоровой — она с нами не первый раз и помогает реализовать самые безумные идеи в последнюю минуту Команда администраторов с Сергей Черепков, административная служба с Анна Латкина-Туркова — на них держится вся инфраструктура события.\n\nФотографии", {"day": "31", "month": "мая", "time": "14:37"}, {"rate": 21, "views": 1600}], ["Дайджест собирает свежие статьи по дизайну интерфейсов, а также инструменты, паттерны, кейсы и исторические рассказы с 2009 года. Я тщательно фильтрую большой поток подписок, чтобы вы могли прокачать свои профессиональные навыки и лучше решить рабочие задачи. Предыдущие выпуски: апрель 2010-март 2018.\n\n\n\nПаттерны и лучшие практики\nScrolling and Attention\r\nСвежие выкладки Therese Fessenden из Nielsen/Norman Group о том, насколько пользователи готовы прокручивать страницы. Хотя основная часть всё ещё не опускается ниже первого экрана, эта цифра упала с 80% в 2010 году до 57% сейчас.\n\n\nBanner Blindness Revisited — Users Dodge Ads on Mobile and Desktop\r\nKara Pernice из Nielsen/Norman Group описывает знакомые и свежие выкладки из исследований, посвящённых «баннерной слепоте».\n\n\n\nMobbin — Latest Mobile Design Patterns\r\nЕщё одна библиотека паттернов мобильных интерфейсов.\n\nIntroducing Boosts — an all-new way to show your support in Basecamp\r\nJonas Downey из Basecamp рассуждает о плюсах, минусах и подводных камнях использования лайков в productivity-сервисе. Они сначала внедрили их в более-менее базовом виде, а потом пересмотрели в сторону графичных мини-комментариев.\n\nTop 10 Design Mistakes in the Unsubscribe Experience\r\nKim Flaherty из Nielsen/Norman Group приводит рекомендации по интерфейсу отписки от рассылки. Многие компании стараются удержать пользователя на этому пути, но в итоге делают отношение пользователя к себе ещё хуже.\n\nSeven principles of effective digital navigation\r\nGerry McGovern рассказывает о своих принципах хорошей навигации в вебе.\n\nИсследования Baymard Institute\n\nРекомендация форматировать описание продуктов с выделением ключевых функций и особенностей.\nВажность гибких фильтров.\n\nТёмные паттерны\n\nFlavio Lamenza собрал свежие тёмные паттерны.\n\nWhat You Need To Know To Increase Mobile Checkout Conversions\r\nСерия советов по оптимизации мобильных интернет-магазинов от Suzanne Scacca.\n\nДизайн-системы и гайдлайны\nДизайн Альфа-Банка\r\nАльфа-Банк оформил свою дизайн-систему в отдельный сайт (до этого была просто библиотека на GitHub). Есть как компоненты в коде, так и описание принципов дизайна, а также шаблоны в Sketch ― один из лучших примеров на нашем рынке, да ещё и удачно сопровождённый их новым стилем иллюстраций.\n\n\n\nКниги о дизайн-системах\r\nАктуализировал прошлогоднюю заметку про книги о дизайн-системах. Мне было интересно разобраться в первоисточниках, поэтому в прошлом году я засел за чтение всего, что выходило на тему паттернов, компонентов и модульности. Идеальной книги нет, но часть из них показывает очень правильные точки зрения.\n\n\n\nCreating Themeable Design Systems\r\nBrad Frost описывает принцип создания тем оформления в дизайн-системах по всем модным канонам ― токены, единая архитектура элементов интерфейса.\n\n\n\nYesenia Perez-Cruz @ An Event Apart — Scenario-Driven Design Systems\r\nYesenia Perez-Cruz из Vox Media рассказывает о подходе команды к развитию дизайн-системы — они ориентируются в первую очередь на сценарии использования, а не просто паттерны.\n\nStorybook Tutorial\r\nОнлайн-курс по работе с живыми гайдлайнами для компонентов дизайн-системы Storybook. Анонс.\n\n\n\nBuilding the Clarity Date Picker — Achievements and Challenges\r\nAditya Bhandari из команды дизайн-системы VMWare Clarity рассказывает о создании поля для выбора даты, которое поддерживает локализацию. Также вышла вторая часть рассказа команды дизайн-системы Clarity о создании тёмной темы оформления.\n\nCards and Composability in Design Systems\r\nNathan Curtis разбирает структуру популярного паттерна «карточка».\n\nДизайн-система. Определение понятия\r\nДизайн-системы стали одной из главных тем в дизайне продуктов за последние годы — наконец-то нашлось работающее решение для поддержки нескольких продуктов в унифицированном виде. Коллекция styleguides.io собрала огромное количество примеров, публикаций и книг на тему выше крыши. И всё равно на конференциях и в обсуждениях в интернетах встречаем непонимание самой сути явления. Два главных заблуждения: «да это же то же самое, что классические руководства по стилю» и «у нас дизайн-система в Sketch». Мой коллега Андрей Сундиев​ на пальцах рассказал, что такое дизайн-система и почему так много компаний считает их серебряной пулей.\n\nФреймворки\n\nCSS Blocks, фреймворк для дизайн-систем от LinkedIn.\nГенератор статических сайтов на базе фреймворка Vue.js.\n\nMicrosoft Fluent Design System\n\nГлава дизайн-системы Microsoft Fluent Joey Pitt рассказывает о принципах работы её команды. Как строится цикл обновлений, как они завязаны на версии Windows.\nMike Jacobs из Microsoft рассказывает о принципах интерфейсного «материала» акрил в дизайн-системе Fluent.\n\nПонимание пользователя\nOur Exact Customer Research Process for Userlist.io\r\nОтличнейший кейс исследования по методике Jobs to Be Done для запуска сервиса Userlist от Claire Suellentrop. Неплохо пошагово рассказано о процессе исследования и сделанных выводах по функциональности и интерфейсу продукта.\n\n\n\nAccessibility\n\nВ блоге компании Altexsoft пишут о разнице между терминами «универсальный дизайн», «инклюзивный дизайн» и accessibility. В дополнение к этому идёт памятка по улучшению доступности интерфейсов для пользователей с ограниченными возможностями.\nВалерия Курмак из Сбербанка рассказывает об инициативах компании по обеспечению доступности. В том числе они планируют выпустить приложение-чеклист для дизайнеров.\n\nПроектирование и дизайн экранов интерфейса\nFigma\n\nFigma выпустили свой конвертер макетов в код для React на GitHub. Karl Jiang рассказывает, как это устроено и что он умеет. Это важный шаг по связке инструментов дизайна и технологических фреймворков, но без связки с основной библиотекой компонентов это всё ещё игрушка, а это самая сложная задача.\nCarmel DeAmicis приводит примеры свежих экспериментов по использованию API Figma. Экосистема стремительно развивается и это выглядит более правильной и надёжной версией плагинов Sketch.\nJon Rohan из GitHub рассказывает о том, как устроен экспорт библиотеки иконок из Figma в продукт с помощью нового API инструмента.\nPagedraw, Ещё одна попытка конвертировать макеты Sketch и Figma в код на React.\n\nSketch\r\nСтудия Icons8 продолжает эксперименты с просмотрщиками макетов в Sketch — новый онлайн-сервис Sketch the Ripper позволяет разобрать их.\n\nStackswell, ещё один плагин для адаптивных макетов в Sketch. Правда, пример Anima AutoLayout показывает, что это очень нестабильные решения, которые оставляют много мусора за собой. Анонс.\n\r\nMatthew Talebi описывает более-менее здоровый процесс работы с шаблонами в Sketch и перечисляет разные способы его распространения.\n\nInVision\n\nInVision купили Wake, который показывает текущие макеты дизайнеров в команде. А ещё у них были крутейшие интервью с дизайн-командами, так что и Design Genome Project перепадёт.\n\nFramer\n\nПоявилась работа с 3D-объектами и их анимация. Это востребованный визуальный стиль, который делает продукты бодрее.\n\nFlawless\n\nПоявилась возможность сравнивать макеты с реализацией приложения на iOS (в эмуляторе).\n\nStudio\n\nИнструмент вышел из беты.\n\nSketchize — Free Wireframing Sheets\r\nОчередные шаблоны для скетчей мобильных интерфейсов.\n\nИнструменты паблишинга\n\nLonely Page, ещё один конструктор одностраничников.\nSheet2Site, генератор простых сайтов из таблиц в Google Sheets.\n\n\nПользовательские исследования и тестирование, аналитика\nHow to Assess Brand Affinity & Sentiment\r\nJeff Sauro показывает, как измерить отношение пользователей к бренду. Он приводит пример оценки для пары десятков известных компаний.\n\n\n\nUX research findings ― Distinguishing base hits from home runs\r\nОтличная статья Paul McInerney из IBM о том, как и в каких ситуациях пользовательские исследования корректируют планы продуктовых команд.\n\n\n\nQuantitative User-Research Methodologies: An Overview\r\nСравнительная таблица методов количественных пользовательских исследований от Kate Meyer из Nielsen/Norman Group.\n\n\n\n5 Techniques to Make your UX Research More Effective\r\nХорошая сводная памятка Jeff Sauro о том, как сделать пользовательские исследования более эффективными.\n\nWhy you don’t need a representative sample in your user research\r\nDavid Travis из UserFocus показывает, как итеративный подход к разработке продукта может сократить количество респондентов для каждого пользовательского исследования.\n\nFinding UX Research Participants\r\nVictor Yocco сравнивает разные способы поиска респондентов для пользовательских исследований и рассказывает о своём опыте по каждому из них.\n\nYou can’t research without context\r\nDylan Blanchard рассказывает о принципах работы команды пользовательских исследований в Shopify.\n\nВизуальное программирование и дизайн в браузере\nVisual Inspector — Free Chrome extension for live website feedback and fixing design bugs\r\nПлагин для Chrome позволяет ковырять стиль сайтов в более наглядном виде, чем стандартный инспектор кода. Изменения можно обсуждать с коллегами.\n\n\n\nSolis\r\nПриложение для Mac облегчает вёрстку адаптивных сайтов. Его можно подключить к любому редактору кода и получить гибкий и мгновенный предпросмотр даже для изменений в файлах препроцессоров.\n\n\n\nНовые скрипты\n\nСкрипт реализует необычные эффекты наведения на WebGL.\nИнтересный подход к отображению добротности пароля — декоративное изображение постепенно улучшает качество.\nФреймворк для интерфейсной анимации на React. Анонс.\nРеализация и анимация градиентных лучей.\nКрутейшие визуальные эффекты нажатия на кнопки.\nКоллекция шизоидных экспериментов с графикой на CSS.\n\nПисьма рассылки\n\nОбзор простых фреймворков для создания адаптивных писем рассылки от Paolo Mioni.\n\nРабота с цветом в вебе\n\nБыстрый способ создать двухцветную версию фото в духе Spotify.\n\nМетрики и ROI\nThe User Experience of News Websites\r\nСравнительное пользовательское исследование крупных новостных сайтов от Jeff Sauro со значениями NPS (упал с 21% в 2012 до -9%) и SUPR-Q.\n\nUX-стратегия и менеджмент\nHow we structure (some) UX teams at Shopify\r\nAlaine Mackenzie из Shopify рассказывает о текущей структуре дизайн-команд в компании и том, почему она изменилась за последние годы. Ещё немного об их команде:\n\nElyse Viotto о том, как становилась дизайн-менеджером и как нашла новую пользу от себя в команде.\n\n\n\n\nEmotional Intelligence Has 12 Elements. Which Do You Need to Work On?\r\nDaniel Goleman и Richard E. Boyatzis предлагают отличную модель для описания эмоционального интеллекта по 12 характеристикам: самоанализ, самоконтроль, социальный анализ и управление взаимоотношениями. На основе неё удобно оценивать базовые навыки специалиста в команде.\n\n\n\nHardening the «soft» skills\r\nLia Garvin из Google даёт советы по прокачке soft skills в команде. В продолжение темы:\n\nHardik Pandya сравнительно недавно попал в Google и описал свой опыт интеграции в неё. Получилась хорошая памятка по профессиональной гигиене и командному взаимодействию для любого специалиста.\n\nDesigned Space — The culture of design studios\r\nИнициатива исследует офисы и рабочие пространства дизайн-студий и продуктовых команд.\n\nКомандное взаимодействие\nAbstract\n\nВышло обновление 0.70.\n\nPlant\n\nПереработан плагин для Sketch.\n\nПродуктовый менеджмент и аналитика\nGo Practice! Симулятор — Курс управления продуктом на основе аналитики\r\nОнлайн-курс Олега Якубенкова по управлению продуктами в виде обучающей игры. Анонс.\n\nКейсы\nThe Inside Story of Reddit’s Redesign\r\nРассказ о редизайне Reddit, который не менялся с 2008 года. В такой ситуации опасно делать резкие шаги ― важно начать процесс обновления, а после этого сделать его непрерывным. Официальный анонс (выкатываться он будет постепенно). На очереди Craigslist.\n\n\n\nКак мы разрабатывали стиль корпоративной иллюстрации «Лаборатории Касперского»\r\nХороший рассказ студии Мыслеформа о создании гайдлайнов иллюстраций для Лаборатории Касперского. Разбор стилеобразующих элементов и вариаций по исполнению.\n\n\n\nHow we designed page previews for Wikipedia — and what could be done with them in the future\r\nNirzar Pangarkar из Wikimedia Foundation рассказывает об особенностях и нюансах внедрения всплывающих превью для ссылок. Кросс-ссылки отвечают за 28% трафика Википедии, каждую минуту на них наводят курсор 2 миллиона раз.\n\nДругие кейсы\n\nСтудия Under Glass рассказывает о работе над интерфейсом переводчика Gengo.\nCecilia Yang из Airbnb о том, как интерфейс помогает владельцам домов оправдывать ожидания жильцов.\nДизайнеры UX Studio рассказывают о проектировании стриминговой платформы для HBO.\nBrian Donohue рассказывает об обновлении мессенджера Intercom — продукт теперь решает задачи по поддержке пользователей в более широком ключе.\nРассказ Zack Hargett о дизайне мобильного приложения GYANT Health.\nGaby Izarra из Creative Market о редизайне карьерной страницы. Очень крутой пример того, как она фокусируется на культуре и движущих силах в компании, а не просто списке вакансий.\nVibha Bamba рассказывает о том, как команда Airbnb обнаружила потребность пользователей в инструкциях для жильцов и реализовала её в продукте.\n\n\nТренды\nСтатистика рынка (I квартал 2018)\n-21%\nпадение продаж смартфонов в Китае\n\n0/-1,4%\nстагнация рынка компьютеров\n\n10%\nрост продаж ноутбуков в России\n\nАлгоритмический дизайн\nAI UX: 7 Principles of Designing Good AI Products\r\nDávid Pásztor из UX Studio описывает важные аспекты проектирования интерфейсов продуктов, использующих алгоритмический дизайн.\n\nPerception Engines\r\nTom White научился генерировать человекоподобные абстрактные иллюстрации с помощью алгоритма — он скармливает ему обучающую выборку, а затем подбирает относительно узнаваемое исполнение. Проект сделан в рамках инициативы Google Artists and Machine Learning (её блог).\n\n\n\nNew AI Imaging Technique Reconstructs Photos with Realistic Results\r\nЭкспериментальное решение NVIDIA восстанавливает отсутствующие элементы на фотографиях.\n\n\n\nУмные часы и браслеты\n\nInstagram отказался от приложения для Apple Watch. Это очередное приложение из первой волны, которое оказалось бесполезным в таком контексте.\n\nHelvetica Is Now An Encryption Device\r\nЗанятный эксперимент по шифрованию информации с помощью слегка изменённых популярных шрифтов ― человеческому глазу они будут незаметны.\n\nДля общего и профессионального развития\nIn Defense of Design Thinking, Which Is Terrible\r\nОтличнейший здоровый взгляд Khoi Vinh на никак не умолкающую дискуссию о том, полезен ли для профессии лейбл «дизайн-мышление» или это пустой маркетинговый баззворд. Даже если кто-то использует его неправильно, это мощный инструмент для того, чтобы сделать дизайн более массовым явлением (пусть даже кто-то поначалу будет делать это неправильно).\n\n\n\r\nТо же самое сейчас происходит с программированием — огромное количество курсов для детей и просто начинающих наверняка породит массу дрянного кода, но это решаемая проблема. Он также полемизирует с Natasha Jen из Pentagram, чьё одиозное выступление в прошлом году — чистейший кликбейт и непонимание роли дизайнера в современных продуктах и мире в целом.\n\r\nRichard Banfield — ещё один дизайнер, которого утомил кликбейт Natasha Jen. Он разбирает её псевдо-критику.\n\nАкадемия AIC\r\nAIC запустили академию для начинающих дизайнеров с бесплатной стажировкой. В свежей статье Сергей Попков сравнивает плюсы и минусы найма сильного дизайнера и прокачки начинающего с нуля. Он рассказывает о системе развития стажёров в AIC и Skillbox.\n\n\n\nНовые книги\n\nЕщё одна выдержка из книги Peter Morville «Planning for Everything» ― A List Apart публикует кусок главы 7.\n\n\nЛюди и компании в отрасли\nОбъединение AIC и Лаборатории Артёма Геллера\r\nЗнаковое объединение двух сильных дизайн-агентств. Они сфокусируются на работе над государственными сайтами. Обе команды участвуют в инициативе Дизайн государственных систем и работают над Дизайн-системой России, так что можно ждать их усиления. Дополнительная фактура у РБК.\n\nEnvoy Design — Stories and ideas from designers that challenge the workplace status quo\r\nБлог дизайн-команды Envoy.\n\nМатериалы конференций\nDSCONF 2018\r\nКонференция по дизайн-системам DSCONF прошла 14-15 марта в Хельсинки. Опубликованы видео выступлений с неё.\n\n\n\n\n\nПодпишитесь на дайджест в Facebook, ВКонтакте, Телеграме или по почте ― там свежие ссылки появляются каждую неделю. Спасибо всем, кто делится ссылками в группе, особенно Геннадию Драгуну, Павлу Скрипкину, Дмитрию Подлужному, Антону Артемову, Денису Ефремову, Алексею Копылову, Тарасу Бризицкому, Евгению Соколову и Антону Олейнику.", {"day": "7", "month": "мая", "time": "16:09"}, {"rate": 24, "views": 5400}], ["По статистике, из более чем 7000 государственных сайтов около 80% — непопулярные ресурсы с низкой посещаемостью. Тем не менее, на поддержание работы всего этого многообразия правительственных ресурсов расходуется много сил, времени и средств. По этой причине в правительстве началось обсуждение возможности реорганизации системы официальных сайтов министерств и ведомств. Одно из предложенных решений — закрытие тех сайтов, которым не удалось снискать популярность среди пользователей, и перевод сервисов «под крыло» единого портала, пишет РБК. \n\r\nЕсть и другие сценарии. Например, предлагается сохранить существующие сайты государственных органов, но разработать унифицированную стратегию развития, а также единые принципы организации пользовательских интерфейсов и размещаемых данных. В этом случае также предусматривается создание единого государственного портала, который будет взаимодействовать с отдельными ресурсами федеральных органов власти для реализации принципа «одного окна». \n\r\nКонцепцию работы государственных сайтов в июне 2017 года поручил глава правительства Дмитрий Медведев. Стоит отметить, что при наличии тысяч государственных сайтов около 71% граждан РФ не могут ответить, каким ресурсом они воспользуются для решения определенного круга задач. \n\r\nПо мнению экспертов, при условии наличия единых стандартов можно будет снизить затраты на дизайн и разработку таких сайтов, повторный ввод данных, доступ к этим данным и их хранение. Снизить затраты позволит и закрытие непопулярных ресурсов, посещаемость которых ниже требуемого уровня. Затраты на поддержание существующих и создание новых информационных систем федерального уровня в 2016 году составили 39,36 млрд рублей. Сайты ведомств также учитываются в этой статистике, правда, данные о том, сколько власти тратят именно на эти ресурсы, не раскрываются. \n\r\nПо словам заместителя министра связи и массовых коммуникаций Алексея Козырева, в середине следующего месяца Минкомсвязи и «открытое правительство» вместе планируют запустить промстраницу своей новой версии портала gov.ru. В феврале следующего года увидит свет и бета-версия с тестовыми сервисами. Новая площадка может использоваться для решения широкого круга задач, включая экспертные обсуждения законопроектов, которые сейчас проходят в очной форме. \n\r\nКак уже указывалось выше, почти все выделенные чиновниками сценарии дальнейшего развития государственных ресурсов предусматривают наличие единого портала на домене gov.ru. Это доменное имя зарегистрировано на Федеральную службу охраны России (ФСО). По мнению Козырева, сейчас ведутся переговоры о делегировании этого домена, правда, в самом ФСО это заявление никак не прокомментировали. \n\r\n«По различным оценкам, из 7 тыс. сайтов госорганов, которые сейчас развивают в России, 80% малопосещаемы, но деньги на них все равно тратятся. Мы хотим закрыть подобные ресурсы, перенести их контент на единую платформу gov.ru и оставить только сайты, где аккумулируется основная часть трафика», — заявил Козырев. С начала следующего года для контроля популярности правительственных ресурсов будет создан специализированный рейтинг, который поможет сориентироваться во всем многообразии правительственных сайтов. \n\r\nКонцепция развития государственных ресурсов еще должна быть одобрена правительственной подкомиссией по цифровой экономике, рабочей группой под руководством вице-премьера Аркадия Дворковича, а также правительственная комиссия под руководством министра Михаила Абызова. Козырев говорит, что документ будет утвержден не позже середины января. \n\r\nЧто касается концепции дизайна государственных сайтов, то их готовила целая группа разработчиков, в которую входят компания AIC и студия Артема Геллера. Эта работа проводилась на общественных началах. \n\r\nРазработкой обновленной версии Gov.ru будет заниматься «Ростелеком». Среди прочих направлений доработки сайта — использование слабой формы ИИ для эффективного анализа обращений пользователей, частичной обработки звонков и письменных запросов. На эти цели планируется потратить от 671,1 млн до 772,3 млн рублей. \n\r\nGov.ru будет регулироваться теми же документами, что и Gosuslugi.ru. По сути, одна государственная цифровая платформа будет использовать два домена — gosuslugi.ru и gov.ru», — сообщили в Минкомсвязи. Козырев оценивает инвестиции в развитие Gov.ru в 200 млн руб. в год. По мнению чиновника, эти средства окупятся в первый же год, если прекратить тратить деньги на «мертворожденные» порталы.", {"day": "23", "month": "декабря", "time": "03:06"}, {"rate": 16, "views": 8900}], ["Привет, Хабр! Сегодня мы решили поделиться с сообществом текстовой версией одного из выпусков подкаста «Метрика», в котором мы рассказали о работе над проектом «Дизайн государственных систем».\n\n\n\n\r\n[ Прослушать этот выпуск ]\n\r\n[ Скачать аудиофайл ]\n\nАлина Тестова: Сегодня мы говорим про проект «Дизайн государственных систем». Как он появился? Как вам пришла в голову идея? Вам – это объединению «Лаборатории Артема Геллера» и других компаний, которые к этому проекту присоединились. Почему вы решили создавать этот проект?\n\nАртем Геллер: Добрый день. Во-первых, хочу уточнить: [проект создают] не компании, а люди из этих и многих других компаний. История не нова. Любая крупная система стремится к упорядочиванию. Государство ничем не отличается от таких компаний, как Google, Apple или любой другой крупной компании, которая представляет свой сервис и услуги в интернете.\n\r\nОна стремится к унификации, стандартизации интерфейсов, к удешевлению затрат и еще к множеству тем, которые мы с вами обсудим. В любом случае мы к этому придем сейчас или через 30 лет. И это будет абсолютно закономерно.\n\nАлина: Это была инициатива конкретных вовлеченных в процесс людей. Они объединились, чтобы создать некий проект, который решает определенные вопросы сервисов для государства. Почему возникла такая необходимость?\n\nАртем: Есть множество причин. Мы, профессионалы, знакомы между собой, крутимся и общаемся в одной среде, мы делаем государственные проекты. В какой-то момент мы поняли, что процесс разработки можно значительно удешевить.\n\r\nЕсли взять срез федеральных ресурсов, на него по подсчетам экспертов, которых мы привлекали, государством тратится около 10 миллиардов рублей в год. Все это можно упорядочить, уточнить, создать библиотеку компонентов, которыми будут пользоваться разработчики. Первая цель, которую решает проект, – это финансы, вторая – единый интерфейс, уникальная государственная экосистема, которой не надо будет переучиваться. \n\r\nСейчас люди заходят на сайты и каждый раз на новом ресурсе переучиваются: пользовательский опыт меняется, интерфейс меняется, цвета меняются, все прыгает и скачет, бывает сделано хорошо, бывает плохо. Мы делаем единую экосистему, к которой люди привыкнут. Она будет технологична, функциональна, удобна и всегда актуальна, потому что это разработка стандарта или методических рекомендаций. \n\r\nПроцесс не статичный – разработали и закончили, а динамичный – появляется новое, изменяется старое. Мы ведем его максимально открыто, чтобы люди могли работать над любыми компонентами, которых существует множество, от шрифтов до элементов интерфейса, аналитики. Если взять любой этап веб-разработки, мы общаемся по нему со специалистами, с ребятами из индустрии и с людьми, которые заинтересованы в улучшении государства.\n\n\n\nДополнительное чтение: О создании Kremlin.ru и работе с администрацией президента\n\nАлина: Получается двунаправленый процесс. С одной стороны, когда человек приходит в компанию, ему [так же] показывают, какие в компании используются шрифты, иконки, корпоративные цвета, и советуют ему использовать все это в презентациях, текстах, материалах, собирать как из конструктора.\n\nАртем: Эта практика распространена и в больших компаниях, потому что они давно поняли преимущество бренда. Государство – это бренд. Государство все больше и больше воспринимается через его сервисы и сайты, поэтому и нужна единая идентификация, чтобы человек, открыв приложение, запустив любой сайт, неважно, сайт Министерства образования или Министерства спорта, понимал, что он общается с государством.\n\r\nСайт должен быть понятен, удобен и должен идентифицироваться с государственным ресурсом. Хочется, чтобы в дальнейшем появился федеральный уровень, а региональный и муниципальный уровни покрылись одним большим ресурсом со своими подпроектами. Государство своим представлением в сети ничем не отличается от Яндекса.\n\nАлина: Вы занимаетесь созданием «брендбука для государства» с точки зрения того, как оно будет представляться [а сети]. И еще с точки зрения внутренних процессов для разработки.\n\nАртем: Очень важный момент состоит в том, что брендбук не столько визуальный, все-таки в интернете находимся. Он и технологический. Мы будем описывать и другие вещи: аналитику, работу с безопасностью на ресурсах, как правильно писать тексты, как правильно доносить информацию и услуги для граждан.\n\r\nТаких моментов много, мы на них пытаемся сделать методические рекомендации. Есть мировой опыт, и, руководствуясь им, мы можем сделать значительно лучше, по крайней мере, в моей картине мира.\n\nАлина: В разговоре прозвучало, что все это нужно не только для конечных пользователей, которые получат единый интерфейс, единое понимание того, как работать с разными государственными ресурсами, но и для разработчиков. Много ли компаний, которые занимаются разработкой для государства?\n\nАртем: Рынок довольно большой. Существующая на сегодня статистика насчитывает около ста компаний, которые хотят продвигаться в этом сегменте, заботятся о своей репутации, ведут публичную деятельность.\n\r\nЧисло компаний, периодически занимающихся государственными ресурсами, исчисляется несколькими сотнями. Если брать муниципальные компании, которые редко делают государственные проекты, то рынок вырастет до тысячи компаний.\n\nАлина: Слушателям надо понимать, что государственные сайты, ресурсы для государства – это не один гигантский единственный сайт, тендер на разработку которого выиграла единственная компания и вот теперь делает все. Это и муниципальные сайты, и городские, учитывая, сколько у нас подразделений, городов, республик, областей, [таких сайтов] – огромное количество.\n\nАртем: Характер сайтов разный бывает. С одной стороны, мы говорим о сервисных ресурсах вроде госуслуг, с другой стороны, мы говорим о сайтах, говорящих о деятельности ведомства. Это сайты министерств и ведомств, которые должны быть сервисными.\n\r\nМы еще говорим и о государственных промопроектах. Например, поиск инвестиций для региона – это сайты коммерческой направленности, ориентированные на большой бизнес, который может вливать финансовые средства в проекты в этом регионе. Регион себя представляет на этом рынке. Сайтов много, они «бьются» также, как и коммерческие проекты. Единственное, магазинов нет государственных.\n\nАлина: Предположим, есть какая-то компания, которая разрабатывает сайт для условного регионального подразделения. Может ли дизайнер этой компании как-то влиться в ваше комьюнити, и не столько от вас что-то почерпнуть, какой-то интересный инсайт или аналитику, а как-то посодействовать в разработке этих новых стандартов, в создании чего-то нового?\n\nАртем: Мы максимально открыты. У нас есть блог, Telegram-чат, Telegram-канал, мы ставим задачи ребятам в Trello. В нашей группе в Facebook более двух тысяч человек. Мы открыто общаемся по разным вопросам и проблемам. И есть реальные примеры, когда люди подключились к тем или иным задачам.\n\r\nЕсть люди, которые подключились к доработке орла для экранов. Орел – герб России, который мы делали для сайта президента. Есть люди, которые сейчас уточняют границы карты в SVG, чтобы ее оптимизировать и она быстро грузилась, была максимально актуальной и точной, а также занимала минимум пространства при загрузке – трафик не тратила.\n\r\nСейчас мы запускаем сайт гайда, на котором будем публиковать все компоненты. Все компоненты, от кнопки до шрифта, мы будем обсуждать в комьюнити, все, что мы делаем, мы выносим в паблик. Недавно мы начали работу над шрифтом, о нем уже есть несколько постов. Мы собрали и проанализировали комментарии. Появились люди, которых это тоже заинтересовало, они присутствуют на наших обсуждениях этого процесса. Так было со всеми компонентами, которые уже существуют.\n\n\n\nДополнительное чтение: Кто мы и как нам работать вместе\n\nАлина: Люди могут не просто посмотреть, а именно поучаствовать.\n\nАртем: Сложность в том, что мы не можем понять, какой пул задач мы можем дать такому объему людей. Знаем, что некий Иван – лучший в айдентике, кто-то лучший в типографике. Но нам трудно раздать задачи массе людей, поэтому обычно подключаются те, кто пришел с инициативой «снизу вверх», то есть нам что-то предлагают – мы соглашаемся.\n\r\nВсе, что мы делаем, распространяется бесплатно. Все лежит на GitHub. Мы сделали за государство то, что оно должно было сделать давно. Нами разрабатывался Кремль [сайт kremlin.ru], сайт Совета Федераций, сайт Правительства. Мы раздаем компоненты государственных ресурсов. Их актуальные версии лежат на GitHub, там все наши наработки, которые могут быть интересны разработчику.\n\nАлина: Есть мнение, что крутые специалисты в первую очередь идут в коммерческие компании, громкие проекты: Яндекс, Mail.ru, Google, Apple. Много ли таких мощных, крутых специалистов работает над государственными сервисами? Есть ли какие-нибудь звезды дизайна, типографики, usability, UX в этой теме?\n\nАртем: 5-6 лет назад был переломный момент, когда все мои знакомые директоры дизайн-студий, рекламных агентств, креативных агентств начали со мной периодически встречаться и выяснять, как залезть в эту нишу, и насколько рентабельно начать работать с госсектором. Сейчас все крупные студии, входящие в десятку по рейтингу, и крупные компании, занимающиеся веб-разработкой, имеют проекты, связанные с государством.\n\r\nКто-то делает проекты для Москвы, как Red Keds, кто-то делает немного другое, но тоже для Москвы, как Notamedia. Кто-то делает для госсуслуг, как AIC, кто-то – для федеральных ведомств, как мы. В первой десятке сайтов есть те или иные государственные проекты.\n\nАлина: Почему появился такой интерес? Люди стали понимать, что это сложные и амбициозные задачи, или престижность этого направления возросла? Или что-то еще?\n\nАртем: Здесь много факторов. Есть и престижность направления, люди увидели, что можно делать хорошо и получать с этого важную лояльность от профессионального сообщества. Есть финансовый момент, потому что государство – чаще всего стабильные деньги, а с коммерцией бывает по-разному.\n\r\nЯ ушел из коммерции потому, что устал делать сайты компаниям вроде Danone. Мне хотелось социальной значимости. Когда сотрудники понимают, что делают ресурс для себя, своих родителей, они погружаются в работу, осознают, что у них есть стимул.\n\nАлина: Получается, что дизайн-студии становятся более социально ответственными, когда они присоединяются к государственным проектам.\n\nАртем: Все зависит от людей. Но когда доходишь до определенного уровня, а мы говорим о крепких, сильных компаниях, ты переступаешь грань, за которой тебе становится важна социальная значимость. Сначала ты делаешь для кого-то, но все время повышаешь планку, пока не дойдешь до планки «хочу улучшить весь мир».\n\r\nТеперь – это планка «хочу улучшить свое государство». Так рождаются хорошие проекты. Крепких, хороших проектов все больше, и это перестало смущать людей. Если раньше они, тайком со мной встречаясь, говорили тихо, то сейчас это публичная тема, никто этого не стесняется. Я думаю, у этого сектора большое будущее.\n\nАлина: Это перестало быть немножко стыдно, а наоборот – стало интересно.\n\nАртем: Настоящие профессионалы стали отнимать какую-то часть работ (проектирование, дизайн) у тех, кто раньше не мог, не умел, но как-то делал те самые государственные проекты. Поэтому мы видим все больше и больше хороших проектов. Мне это очень нравится.\n\nАлина: [Профессионалы отнимают часть работ у тех, кто] делал то самое «малахитовое на золотом, золотое на малахитовом»?\n\nАртем: Может быть [у тех, кто] раньше делал не очень красивые и удобные, функциональные вещи.\n\nАлина: Насколько государство сложный заказчик с точки зрения требований, потребностей, вкуса?\n\nАртем: В моей картине мира государственный заказчик ничем не отличается от коммерческого. Раньше я тоже говорил, что с государством работать проще. За те 7 лет, которые я занимаюсь государственными проектами, мое мнение поменялось: не проще, а так же.\n\r\nЕсть разные люди, команды людей, разные департаменты, пресс-службы, но в каждом проекте, который мы делаем, со стороны клиента есть один или несколько человек, которые готовы отдать все, чтобы этот ресурс был хорошим. Это меня очень мотивирует: они борются внутри своей корпоративной государственной культуры, бюрократии. Они бьются за хорошие решения, а не за «начальник сказал – вы делайте».\n\nАлина: Казалось бы, у людей извне представление о государственных проектах, как об очень негибких, забюрократизированных. Оказывается, и тут есть люди со стороны заказчика, которые готовы способствовать, помогать, менять проекты к лучшему.\n\nАртем: Да, рискуют иногда своей карьерой, ругаясь с начальством, пытаются объяснить, что это правильно, удобно, доступно, и нам это важнее, чем вариант, предложенный сверху. Должны быть всегда веские аргументы. По моему опыту общения с людьми, если у тебя есть достаточно серьезные аргументы, то государственными чинами твое решение будет принято, если нет хороших аргументов, то ты сам в чем-то не прав.\n\nАлина: Еще один момент, может быть, миф по поводу работы с государством или на государство: когда речь идет о разработке, создании чего-то, есть подозрения, что для всего этого уже сделаны ГОСТы, и в рамках этих ГОСТов нельзя никуда отступить – креатива ждать от государственных проектов не приходится. Как ГОСТы определяют вашу работу? Много ли в них надо доработать, чтобы получить те стандарты, о которых говорили в самом начале?\n\nАртем: Стандарты с ГОСТами немного не связаны. Если говорить о веб-разработке, разработчиках сайтов или не слишком сложных сервисах, они ничем не обременены, есть федеральный закон о том, что надо публиковать на государственных ресурсах, на этом – все. На безопасность, защиту информации есть свои ГОСТы, лицензии. Компании, которые занимаются безопасностью, ими обладают. \n\r\nГосударство неожиданно дает нам возможность, расскажу на примере с орлом. Существует Указ Президента о том, как должен выглядеть орел. У всех есть ощущение, что его нельзя менять, но любой человек, дизайнер может нарисовать своего орла, он должен следовать только нескольким требованиям. \n\r\nУтрированно: на головах орлов должны быть короны, в правой руке – то, в левой – это. Дальше вопрос стилизации не регламентирован, поэтому любой иллюстратор, дизайнер может сделать его на свой взгляд. Нам удалось его сделать для экранов. Хотя когда возникла эта идея, думали, что он как-то зарегламентирован, и мы ничего с ним не можем делать. Можем.\n\nАлина: Вы хотите сделать этого орла именно стандартом для разных сайтов?\n\nАртем: Мы хотим его сделать открытым стандартом, чтобы любой человек на GitHub или любой другой свободной платформе, где можно добавлять свои нововведения или изменения, мог внести свою полезную лепту в качество результата на выходе.\n\r\nЕсли человеку удалось, утрирую, поправить координаты региона или поправить лапку орла, сделать лучше, чем сделали мы, мы это принимаем. Теперь у всех этот орел будет с правильной лапкой. Это распространяется на все компоненты: типографику, элементы интерфейса, расстояние, отступы, сетки, базовые вещи, технические принципы, стиль работы с людьми, на работу с текстом. Во всем можно поучаствовать.\n\n\n\nДополнительное чтение: Интерфейс государства и сценарии взаимодействия с пользователями\n\nАлина: Получается, что стандарты, над которыми работает дизайн государственных систем, – не просто строгие указания. Это активная площадка для постоянного улучшения, повышения качества того, что может предложить государственная система своим пользователям.\n\nАртем: Есть две вещи: методические рекомендации и принципы. Методические рекомендации – это то, что мы рекомендуем делать. Принципы – это философия, понимание процессов, то, как надо работать с гражданами государства.\n\r\nМы должны в чем-то зафиксироваться, чтобы от этого отталкиваться и двигаться. Мы должны определиться с платформой, а потом работать над экстерьером. Все начинается с базового – управления проектами: управление информацией, масштабирование, принципы, эффективность, запуск альфа- и бета-версий проектов, сбор фидбэка с пользователей, его обработки и реакции на него.\n\r\nСтандарт охватывает сам процесс разработки: принципы, безопасность, лицензирование, настройку и тестирование серверов, доступность, API, открытые государством, плановость выдачи релизов. Дизайн-стандарты ориентированы на граждан для решения задач единой айдентики, графического интерфейса, иконок, пиктограмм. \n\r\nОчень важный момент – доступность для людей с ограниченными возможностями, которым не озабочены многие государственные ресурсы. Или, по крайней мере, то, что у них сделано, является профанацией. Это правильная, удобная визуализация данных, паттерны проектирования, чтобы проектировщики других компаний могли им следовать, бесплатный государственный шрифт – сейчас государство может пользоваться только исключительно бесплатными системными шрифтами. Бывают моменты, когда дизайнерам нужны шрифты, и они начинают тратить государственные деньги на покупку шрифтов, технологий, аналитики. \n\r\nВ результате мы хотим получить единый интерфейс взаимодействия гражданина с государством. Набором стандартов мы повысим качество государственных ресурсов, улучшится доступность для людей с ограниченными возможностями, улучшится читаемость – мы больше не встретим мелких шрифтов «серым по серому». \n\r\nВ своей работе мы, в первую очередь, пытаемся решать задачи граждан, а не заниматься стилизацией. Это будет интерфейс для правильной и быстрой работы, а не игры в стилизацию. Мы хотим сделать единый центр аналитики и компетенции, чтобы можно было задать вопрос и посмотреть, как правильно, чтобы заказчик или разработчик мог понять, в правильном ли направлении он движется. \n\r\nРазработчики смогут брать всевозможные компоненты. Этот проект повысит уровень прозрачности деятельности органов власти в разработке – в этом сегменте в сети все будет открыто. Поскольку мы общаемся со всеми представителями индустрии, важным моментом является то, что результат будет принят профессиональным сообществом, большей его частью. \n\r\nСообщество объективно – видит плохие ресурсы, их ругает, а в этой работе могли поучаствовать все. Если говорить о будущем, это – единые инструменты анализа работы государственных ресурсов. Такую задачу мы ставим для двух тысяч профессионалов, которые уже принимают активное участие в проекте.\n\nАлина: Получается, что поскольку это проект, который охватывает все, начиная с идеи будущего сервиса, продукта, сайта, и заканчивая пользовательским взаимодействием, – это же огромный объем знаний, база знаний.\n\nАртем: Да, Яндекс, Google, Apple с этим справились, почему мы не справимся?\n\nАлина: Огромная задача, но не невыполнимая.\n\nАртем: Это решаемая задача. Профессионалы ее решают, ничего страшного здесь нет. Нам будет нестрашно откатиться назад в какой-то момент, если мы или сообщество посчитает, что это решение неправильное. Тогда мы сделаем новое и правильное.\n\r\nБолее того, это зависит не только от сообщества, но и от развивающихся и меняющихся технологий. Мы видели давно переход с flash на HTML5, может, еще какие-то технологии поменяются, неважно, в узких или широких местах. За этим надо следить и динамически менять в рекомендациях. Например, Google делает это в своем material design guide.\n\nАлина: Где можно увидеть результаты, стандарты, методологии, то, что вы уже успели охватить и сделать?\n\nАртем: Сейчас есть только блог. Есть комьюнити в Facebook «Дизайн государственных систем», где мы выкладываем результат нашей деятельности. В блоге или Facebook можно найти ссылки на наш Trello, где мы ставим задачи, где специалисты их решают, где можно проявить инициативу. И каналы в Telegram, где можно познакомиться, пообщаться и взять на себя обузу, чтобы внести в проект что-то светлое и социально значимое.\n\n\n\nПервая версия интерфейсного шрифта, которую мы разработали в рамках проекта\n\nАлина: Насколько я понимаю, светлое и социально значимое вносят не только дизайнеры, которые непосредственно заняты на государственных проектах, но и компании. Например, ПараТайп с вами делает новый шрифт. Вы занимаетесь разработкой государственного шрифта.\n\nАртем: Да, ПараТайп с нами работает на коммерческой основе, но чувствуя социальную значимость этого проекта, они действительно выставили минимальную цену за работу с нами в этом направлении. Есть три самых важных составляющих, повторюсь, это – общество в плане обсуждения, профессионалы в плане реализации, и на каком-то этапе появится взаимодействие с государственным регулятором.\n\r\nЭто может быть Администрация Президента, Минкомсвязи, Минэкономразвития, они нам все важны на каких-то этапах. Вот, третья часть самая важная из всех. Существует комиссия ИРИ – Института развития интернета, я возглавляю ее, поскольку инициатива пошла от меня, да и опыт у меня есть на базе разработки государственных ресурсов. Комиссия занимается проработкой решений и планом работ поэтапно по срокам. Сейчас идет обсуждение процессов, а также сроков их выхода в свет.\n\nАлина: Ты говорил про общество, как потребителя конечного продукта. Были ли такие случаи, когда человек, который не является дизайнером или причастным к разработке, узнал про вашу группу в Facebook, про то, что вы делаете, и сам пришел к вам и сказал: «Ребята, я открываю этот сайт со своего мобильного устройства, и мне не нравятся некоторые вещи. Поправьте их, обратите внимание».\n\nАртем: Таких случаев много. Если говорить про проект «Дизайн государственных систем», есть люди, не считающие себя профессионалами, но желающие что-нибудь сделать, а мы даже не знаем, что им дать, потому они не профессионалы.\n\r\nС другой стороны, мы работаем с фидбэком, и у нас стоят задачи по исправлению замечаний, которые присылают нам пользователи. Мы с этим работаем – ресурсы поддерживаем, обновляем, дополняем. Мои знакомые и люди, которые захотели сделать ресурс лучше, присылают мне ошибки, которые находят.\n\nАлина: Люди не просто, как потребляющая сторона, выступают с точки зрения взаимодействия, но и активно участвуют.\n\nАртем: Может быть, у них что-то не сработало в какой-то момент, а может, они хотят что-то улучшить. Но, разделять надо.\n\nАлина: Какие перспективы могут быть у этого проекта с точки зрения лицензирования, легализации этих стандартов?\n\nАртем: Это может быть команда, которая является частью какого-то ведомства. Этим путем пошла, например, Великобритания. У них нет министерства связи, но в симметричной структуре создана команда из 250 человек, которая занимается одним гигантским ресурсом, улучшая его во всех направлениях.\n\nАлина: Это Gov.uk?\n\nАртем: Да. Есть пример Америки, команда из 50 человек. Их стратегию очень трудно понять. Они бросаются в разные стороны, но тоже занимаются улучшением ресурсов. Тоже делают стандарты, но то, как они их не делают, выглядят очень странно: в разных форматах, очень мелко.\n\r\nВ нашем случае может быть любой вариант: рабочая группа при Администрации Президента, некоммерческая организация, которая финансируется государством на разработку методических рекомендаций гайдлайнов, их поддержки. Форм легализации много. Но для этого необходимы изменения в законодательстве, чтобы было понятно, кто является центром компетенции, центром ответственности, центром разработки.\n\nАлина: С точки зрения негосударственных проектов, про вселенскую пользу: предположим, есть дизайнер, разработчик или юзабилист, который хочет для себя почерпнуть полезное из того, как ведется разработка государственных систем. Может ли он зайти к вам в Telegram и почерпнуть для себя что-то ценное, важное? Стоит ли эту практику распространять и в негосударственный сектор?\n\nАртем: Безусловно, это возможно и полезно. Процесс разработки дизайн-системы – очень сложный процесс. Если погрузиться в этот процесс, послушать, посмотреть, прожить, поучаствовать, можно получить гигантский опыт, как при работе в большой компании, работая над несколькими проектами параллельно с сильной командой. Это уникальная возможность, если говорить об обучении или повышении квалификации, или способе внести лепту в проект.\n\nАлина: Разработчик, который заинтересован в том, чтобы понять, как это все происходит, может быть со стороны, не вовлеченным [в дизайн госсистем]?\n\nАртем: Такие люди есть. Они наблюдают какие-то моменты. Если появляется что-то важное, актуальное, интересное для них, объявляются и говорят, что могут сделать что-то лучше, чем что-то уже сделанное.\n\n\n\nGitHub-репозиторий проекта\n\nАлина: Даже если вы непосредственно не заняты в разработке государственной системы, можете спокойно посмотреть, как это делают профессионалы и почувствовать, как происходит работа.\n\nАртем: Для разработчиков, не занимающихся государственными ресурсами, те компоненты, которые мы создаем, тоже полезны. Например, карта Российской Федерации или карта мира по преставлениям Российской Федерации, разделенная на страны, – это очень частый виджет, который необходим на коммерческих ресурсах при выборе регионального отделения.\n\r\nВ интернете очень трудно найти правильную, актуальную карту России, которая соответствует пониманию России о том месте в мире, которое она занимает, и количестве стран, которые она признает. Карта есть бесплатная, на коммерческом ресурсе можно использовать.\n\nАлина: Это все можно использовать?\n\nАртем: Да. Исключение, возможно, будет составлять шрифт, потому что шрифт – очень «сильная» вещь, которая идентифицирует экосистему. Мы по шрифтам понимаем, где мы находимся. Есть несколько моментов. Есть знак, цвет, или цвета, и шрифт.\n\r\nЕсли взять брендбук любой компании, глобальное – это цвета, знак, шрифт. Остальное: календари, компоненты, разработанные профессионалами, можно взять.\n\nАлина: Не просто разработанные профессионалами, а с большим количеством требований к этим профессионалам.\n\nАртем: С требованиями по доступности, по визуальной составляющей. Доступность тоже разная – есть инвалиды, и есть старые браузеры, а есть низкая скорость соединения – это критерии доступности.\n\nАлина: К государственным ресурсам требований больше, чем к сайту любой другой коммерческой компании?\n\nАртем: Безусловно. Требования к коммерческой компании регламентирует сама коммерческая компания, а государство отличается тем, что в большинстве государственных ресурсов, как и в Facebook, аудитория – все. Если у какого-то тарифа страховой компании четко понятна аудитория – возраст, пол, достаток, – то государственные ресурсы должны быть доступны всем. \n\r\nРедкие моменты бывают, когда можно сузить сервис для какой-то отдельной аудитории, например, журналистов. Мы ориентируемся на них, хотя такой отдельный проект может быть, какой-нибудь дайджест информационный, если его выпускает государство, но в большинстве своем, [то, что мы делаем, должно быть] доступно для всех. Это как Facebook. \n\nАлина: Получается, что те компоненты, которые есть в открытом доступе, не просто сделаны профессионалами, а сделаны с таким количеством требований, что разработчик под коммерческую задачу не будет [изначально] столькими стандартами руководствоваться в силу того, что это не является приоритетом для него.\n\nАртем: Может быть время и трудозатраты у него не позволяют ему сделать решение лучше, а здесь бесплатно, открыто.\n\nАлина: Стоит воспользоваться опытом тысяч разработчиков…\n\nАртем: Пока опытом нескольких компаний, которые «собаку съели» на разработке государственных сайтов, и у них остались хорошие компоненты.\n\n\nP.S. ϟ олния! Открыта регистрация на самое долгожданное мероприятие «Дизайн-выходные» в Суздале 15-16 октября. Как всегда всё и для всех бесплатно.", {"day": "12", "month": "октября", "time": "14:09"}, {"rate": 19, "views": 9300}], ["Уже шесть лет я публикую регулярные обзоры свежих статей по теме интерфейсов, новых инструментов и коллекций паттернов, интересных кейсов и исторических рассказов. Из лент нескольких сотен тематических подписок отбирается примерно 5% стоящих публикаций, которыми интересно поделиться. Предыдущие материалы: апрель 2010-август 2016.\n\n\n\nПаттерны и Best Practices\nMotion Table\r\nКрутая наглядная периодическая таблица анимации. Не всё годится для использования в интерфейсах, но очень полезно для систематизации знаний.\n\n\n\nIntercom on Onboarding\r\nIntercom выпустили книгу об onboarding. Выдержка из неё, рассказывающая об основных принципах.\n\n\n\nNew E-Commerce Checkout Research — Why 68% of Users Abandon Their Cart\r\nBaymard выпустили новый отчёт, посвящённым причинам отказа от покупки в интернет-магазинах. Интересно, что около 60% из них просто изучали цены и товарные предложения и не собирались покупать, так что эти потери вернуть невозможно. Первая выдержка о валидации полей.\n\n\n\nThe Mighty Ellipsis\r\nJohn Saito из Dropbox разбирает типовые ситуации при проектировании интерфейсов, в которых стоит использовать многоточие.\n\nПочтовые рассылки\n\n\nZurb добавили инструмент создания рассылок Slinky к своему фреймворку Inky.\nBart King разбирает письма Pinterest — как и когда они рассылают их пользователям.\n\nПредставление интерфейса в виде карточек\n\n\nRob Gill пишет о том, когда интерфейс в виде карточек не работает. Перевод.\n\nГайдлайны платформ и компаний\nFree iPhone 7 Mockup\r\nА вот и первый шаблон iPhone 7 от LStore. Для Photoshop и Sketch.\n\n\n\r\nЕщё несколько:\n\n\nШаблон iPhone 7 для Sketch от Олега Андрианова.\nШаблон iPhone 7 для Photoshop от Pixeden.\nШаблон iPhone 7 для Photoshop от Артёма Кобякова.\nШаблоны iPhone 7 в разных цветах для Photoshop от Pixeden.\nМакет iPhone 7 Jet Black для Photoshop от Ramotion.\n\nДизайн-системы\n\n\nДизайн-система Хилари Клинтон.\nПеревод статьи о дизайн-системе Pinterest.\nNathan Curtis пишет о том, как систематизировать отступы в дизайн-системе. Это самая неоднозначная часть любой унификации, которую сложно контролировать и легко пустить на самотёк.\nПеревод статьи Karri Saarinen о дизайн-системе Airbnb.\n\n\nШаблоны Android-телефонов\n\nШаблоны Samsung Galaxy S7 Edge в PSD от Ramotion. Есть несколько бесплатных.\n\nШаблоны устройств Apple в SVG\n\n\nSVG iPhone 6 от Lex Кeller. Он также выложил шаблоны iPhone 5SE и MacBook Pro.\n\nПонимание пользователя\nA Usable Guide to Cognitive Dimensions\r\nFabio Muniz описывает фреймворк когнитивных аспектов, которые важно учитывать при проектировании интерфейсов. Он ссылается на классическую работу Thomas Green и Marian Petre 90х, где они появились впервые.\n\n\n\nInnovation and UX — Towards an Adaptive and Motive-Based Approach User Experience Magazine\r\nClemens Breuninger, Benjamin Dennig и Sebastian Klein пишут о том, как учитывать прагматические (особенности использования), гедонистические (личные предпочтения и особенности) и символические (социальные) качества продукта при работе над интерфейсом.\n\nThe Persuasive Pattern Card Deck\r\nЕщё один набор игральных карт для дизайнеров интерфейсов. Это особенности психологии пользователей, которые важно учитывать в работе. Anders Toxboe рассказывает, как работал над ним.\n\nJobs-to-be-Done\n\n\nJames Kalbach разбирает мифы о методике jobs to be done.\n\nAccessibility\n\n\nСоветы Monika Piotrowicz из Shopify о том, как повысить культуру внимания в компании к проблемам пользователей с ограниченными возможностями.\nJoe Allison провёл серию экспериментов по улучшению интерфейсов для пользователей с аутизмом.\n\nИнформационная архитектура, концептуальное проектирование, контент-стратегия\n\n\nMapping Experiences\n\r\nВ мае вышла книга James Kalbach «Mapping Experiences», посвящённая работе со всеми видами карт experience. UXmatters публикует главу 4 из неё — она о том, как начать работу над такой картой.\n\nПроектирование и дизайн экранов интерфейса\nFigma — The collaborative interface design tool\r\nПродукт вышел из беты. Это Google Docs для дизайнеров — несколько человек могут работать над интерфейсом одновременно.\n\n\n\nAdobe XD: Сентябрьское обновление\r\nВ сентябрьском обновлении бета-версии появилась возможность просмотра прототипов на Android и iPhone, а также много других полезных вещей — легче понять высоту экрана, проще работать с плотностями экрана, удобнее делиться прототипами, больше возможностей анимации. Судя по тому, что в этом анонсе нет тизера следующего, на ближайшей конференции Adobe MAX покажут что-то совсем большое вроде версии дял Windows и ключевой функциональности. Перевод. \n\n\n\r\nДругие новости инструмента:\n\n\nВ августовском обновлении бета-версии расширились возможности анимации и появились линейные градиенты. В сентябре появятся приложения для просмотра макетов на Android и iOS. Перевод.\n\nSketch 40\r\nВышел Sketch 40. Изменения в основном мелкие. Перевод.\n\n\n\r\nДругие новости инструмента:\n\n\nGeoffroy Delobel описывает свою модель командного взаимодействия в Sketch. Перевод.\nSketch Measure обновился и стал гораздо серьёзнее — появился экспорт спецификации в HTML и JavaScript.\n\nInVision\n\n\nInVision запартнёрился с сервисом удалённого юзабилити-тестирования UserTesting. Речь идёт пока о кросс-скидках.\nMuzli стал очередной покупкой InVision. И без того мощный контент-маркетинг компании выйдет на новые высоты.\nNijil David рассказывает, как сделать свой API для генерации тестовых данных, чтобы можно было использовать их в макетах Sketch через Craft.\n\nFlinto\n\n\nПодробнейшая пошаговая инструкция по прототипированию во Flinto. Часть 2.\n\nСовременные инструменты паблишинга\n\n\nВ Readymag теперь можно вставлять формы.\n\nMicrosoft Visio\n\n\nПоявилась возможность просмотра документов Visio на iPad и в вебе.\n\n\nОбзор инструментов для создания дизайн-спецификаций: Avocode, Sympli и Zeplin\r\nПеревод статьи Николая Бабича, где он в деталях сравнивает инструменты для передачи макетов и ресурсов разработчикам. Он описывает интерфейс и возможности Avocode, Sympli и Zeplin.\n\nDesigning for Television, part 2\r\nВторая часть памятки по дизайну интерфейсов для ТВ от Molly Lafferty из This Also.\n\nDesigning Interface Animation\r\nA List Apart опубликовали отрывок из книги Val Head «Designing Interface Animations» — главу 9, посвящённую созданию гайдлайнов для анимации.\n\nBrowserStack — Cross Browser Testing Tool\r\nСервис BrowserStack эмулирует просмотр страницы в разных браузерах, экранах, устройствах для тестирования верстки. Не дёшево, но здорово экономит время, да и закупить набор устройств точно будет не дешевле.\n\nПользовательские исследования и тестирование, аналитика\n Karen Holtzblatt & Hugh Beyer — Contextual Design (2nd Edition)\r\nВ декабре выходит второе издание одной и самых влиятельных книг в области UX — знаменитой «Contextual Design» Карен Хольцблатт и Хью Баера. Первое издание, кстати, до сих пор активно продается и, в каждой второй книге по UX есть ссылка на неё. Она впервые вышла ещё в 1997 году и, в отличие от большинства других книг, почти не устарела, так как она не про технологии, а про глубокое изучение людей.\n\r\nНовое издание полностью переписано, стало толще на 100 страниц, и в него добавлена поддержка CoolConcept, которым Карен занималась последние годы. А именно, она выясняла, какие факторы делают продукт крутым в глазах пользователей. Также книга включает в себя опыт использования Contextual Design в реальных проектах на пртяжении последних 18 лет. Кроме этого, дополнительно раскрыт вопрос удовлетворения пользовательских мотивов в современной гетерогенной среде. Самая дешёвая цена не текущий момент — на сайте издательства.\nCan You Change A Standardized Questionnaire?\r\nJeff Sauro советует придерживаться стандартных форматов опросников вроде SUS в пользовательских исследованиях. Но если по задаче всё-таки необходимо скорректировать его, он подсказывает, как не облажаться.\n\nОпросы пользователей\n\n\nJeff Sauro разбирает плюсы и минусы обязательных ответов в опросах. Они повышают точность собранных данных, но могут быть дополнительным барьером.\n\nA/B-тестирование\n\n\nКак открытие страницы в новой вкладке повышает количество контактов с сайтом.\n\nВизуальное программирование и дизайн в браузере\nIntroducing OpenType Variable Fonts\r\nAdobe, Apple, Google и Microsoft задружились и расширили формат OpenType — теперь поддерживаются параметрические шрифты! Это интерполяция начертаний из нескольких базовых, с которой экспериментировали последние годы. Открывается новая эпоха в веб-типографике.\n\n\n\r\nДругие материалы на тему:\n\n\nRichard Fink описывает историю популяризации кастомных шрифтов в вебе и их перспективы. Уже 60% из рейтинга Alexa используют нестандартным шрифты.\n\nDesigners Guide to Web Performance Optimization\r\nТолковая памятка по основам оптимизации производительности веб-сервисов для дизайнеров от Jon Yablonski. Общие принципы, работа с анимацией, шрифтами, изображениями и графикой.\n\nНовые скрипты\n\n\nСкрипт анимации текста.\nКак реализовать эффект глитча на CSS.\n\nFramer\n\n\nКак связать Framer и Cinema 4D для работы над прототипами интерфейсов виртуальной и дополненной реальности.\nFramer Club собирает примеры прототипов, собранных с помощью инструмента.\n\nXcode для дизайнеров\n\n\nПошаговая инструкция Reda Lemeden из ThoughtBot о том, как дизайнеру прототипировать приложения для iOS в Swift.\n\nРабота с цветом в вебе\n\n\nПалитра цветов, оптимизированная для пользователей с нарушениями зрения.\n\nFlexbox\n\n\nХорошие примеры реализации типовых сеток на flexbox.\n\nВвод данных на мобильных\n\n\nОсобенности ввода цифровых значений на мобильных. Оказывается, вызвать правильную цифровую клавиатуру не так-то просто.\n\nUX-стратегия и менеджмент\nUX-стратегия на практике. Часть 4 — От дизайн-команды к дизайн-культуре\r\nНа UXmatters вышла четвёртая часть из моей серии статей про UX-стратегию, посвящённая всем аспектам дизайн-менеджмента. Для того чтобы в современном мире получалось удачно вписываться в динамичный производственный процесс, а компания могла работать на рынке бодро, обновляя продукты и предлагая новые, нужно озаботиться тремя вещами — команда, лидеры и культура. Рабочий процесс создания дизайна также важен, но он стал гигиеническим требованием — это обязательное, но далеко не достаточное условие для сильной дизайн-команды. Он должен быть и должен быть продуманным. Но для успеха куда важнее общие ценности. Версия на английском (разбито на две публикации).\n\n\r\nЕщё на тему управления дизайн-командами:\n\n\nКак устроен дизайн в Spotify.\nОпыт управления удалёнными дизайн-командами от Todoist.\nОпыт управления удалёнными дизайн-командами от Heroku.\n\nManaging Design work with Discovery Kanban at Optimizely\r\nПродолжение рассказа о дизайнерском канбане в Optimizely. Очень интересная структура доски, завязанной на «двойной алмаз» — в ней отдельно показано изучение проблемы и производство решения.\n\n\n\n5 Questions New UX Leaders Should Ask In Their First Month\r\nDave Malouf рассказывает о своём опыте дизайн-менеджмента в компании Rackspace. Он даёт пять советов новому главе дизайна в компании — с чего начать изучение текущей ситуации и как планировать изменения.\n\nDesign Reviews — Going Beyond the Surface\r\nСоветы по организацию критики дизайна от команды Google. Они делят работу над продуктом на три этапа — концептуальная часть, производство и запуск с обратной связью. Для каждого из них свой фокус и свои вопросы к результатам работы дизайнера.\n\n\n\nThe Agile Manifesto for Designers\r\nМанифест agile для дизайнеров от Andrew Croce. Тема не раз озвученная, но полезно в копилку.\n\nEvery Company Needs An Innovation Tool Kit\r\nSoren Kaplan пишет о том, как внедрить инструментарий для инкрементальных и более крупных инноваций в компании. Она приводит пример Adobe, Intuit и других компаний, которые сделали эту работу системной.\n\n\n\nUX Leadership Roles — Multiple Paths\r\nMargaret Hanley разбирает пути развития дизайн-менеджеров. Она описывает суть и обязанности нескольких ролей в рамках управления дизайном.\n\nGreat Products Don’t Happen By Accident\r\nПеревод статьи Jon Lax на основе презентации, в которой он предлагает интересный подход к систематизации методов работы дизайнеров. Он приводит в пример тренеров американского футбола, у которых всегда есть набор игровых партий для любой ситуации. Это отлично ложится и на процесс работы над продуктом.\n\nПродуктовый менеджмент и аналитика\nЦелеполагание с помощью OKR\r\nВ последнее время метод OKR (objectives & key results) для постановки и отслеживания целей компании и продукта всё востребованнее, но хороших материалов не так много. Евгений Емельянов написал отличную статью с примерами на тему того, как использовать его. Он отлично подходит и для долгосрочного планирования работы и развития дизайн-команд.\n\n\n\nМетодологии, процедуры, стандарты\nОпрос: Доработка проф.стандарта «Специалист по дизайну графических и пользовательских интерфейсов»\r\nСтандарт сейчас активно дорабатывается и инициативная группа проводит опрос — понять, что входит в обязанности UX-профессионалов России и стран СНГ. Опрос анонимный, понадобится около 15 минут. Его результаты будут опубликованы.\n\nКейсы\nРедизайн мобильного приложения банка «Открытие»\r\nДизайн-команда Redmadrobot в деталях рассказывает о редизайне мобильного банка «Открытие». \n\n\n\r\nДругие кейсы редизайна:\n\n\nКак дизайнеры финансовой группы Société Générale переработали сложное многоуровневое меню.\nПеревод статьи Pendar Yousefi о редизайне Google AdWords.\nШикарный кейс редизайна и ребрендинга мобильного банка Monese. Отличный пример связки бренда с интерфейсом.\nSebastien Gabriel рассказывает о редизайне Chrome для компьютеров. Много интересных деталей о том, как оптимизировать работу с ресурсами для разработчиков.\nОчень добротный рассказ команды Optimizely о работе над одним из аналитических отчётов.\n\n\nCo-designing with Hosts\r\nКак дизайн-команда Airbnb проводила сессии ко-дизайна с пользователями для того, чтобы улучшить интерфейс для арендаторов.\n\nКак менялся дизайн крупных продуктов\n\n\nКак менялся сайт Fitbit с 2006 года.\n\n\nИстория\nHow Star Trek artists imagined the iPad… nearly 30 years ago\r\nЕщё один рассказ о том, как переход к графическим интерфейсам от физических кнопок помог съёмочной группе Star Trek сэкономить на производстве декораций и создать более футуристичный антураж.\n\n\n\nТренды\nInnovation by Design Awards 2016\r\nFast Company выбрала победителей своей премии Innovation by Design 2016. Интересно посмотреть на список 35 лучших приложений по их мнению и experience в целом (перевод). Местами это какой-то междусобойчик среди постоянных авторов издания, но есть и свежие вещи.\n\n\n\nАлгоритмический дизайн\n\n\nКак журналист Engadget научил алгоритм писать простые обзоры телефонов.\n\nАвтомобильные интерфейсы\n\n\nFantasy тоже создали команду для работы с автомобильными интерфейсами. Их первый концепт.\nVolvo запустили сайт The Future of Driving, на котором рассказывают о своих новых концептах. Пока он только один — приборная панель и интерьер Concept 26.\n\nБоты и мессенджеры\n\n\nDavid Boardman и Sera Koo из IDEO рассказывают о серии экспериментов с ботами, которые они проводили на базе СМС.\n\nВиртуальная реальность\n\n\nСоветы James Hsu из Disney по дизайну интерфейсов для виртуальной реальности.\nTessa Chung из AOL Alpha рассказывает о том, почему в виртуальной реальности важен скайбокс.\n\n\nExperiencing the next mutation — User characteristics, defining success, and a new way to research mutative patterns\r\nLiam Spradlin развивает концепт «мутационного дизайна». Он выступал в IDEO и нескольких других компаниях и лучше понял особенности идеи.\n\nДля общего и профессионального развития\nRussian Design Cup 2016\r\n10 октября Одноклассники и Mail.Ru Group запускают пятый Russian Design Cup. Это старейший и самый известный турнир для русскоговорящих дизайнеров, который проходит с 2012 года — в прошлом году мы собрали 210 участников и более 300 решений.\n\r\nКак всегда в конкурсе сильные призы — MacPro за первое место и пара тузов в рукаве для второго и третьего. А ещё — мощное жюри с пятёркой отличных отечественных дизайнеров: Антон Ярусов (Иннова), Дмитрий Карпов (Британка, Scream School, Bang! Bang! Education), Сергей Попков (AIC), Леонид Ивахов (Одноклассники) и Юрий Ветров (Mail.Ru Group). Обратная связь очень важна для развития навыков, а большинство решений Russian Design Cup помимо оценки по нескольким параметрам сопровождаются ещё и комментарием о сильных и слабых сторонах. Подключайтесь.\n\nWhat to Do If Someone Steals From You 7 Times a Day\r\nАндрей Бурмистров из Icons8 пишет об интересном опыте компании по борьбе с нелегальным использованием их иконок.\n\nЛюди и компании в отрасли\nUX-Среда AMA: Иннова\r\nНа вопросы седьмого AMA от UX-Среды и vc.ru о дизайне в компании Иннова отвечают Антон Ярусов, Родион Арсеньев, Слава Кутеев, Микаэл Гелецян и Евгений Муравьев. У компании одна из самых сильных дизайн-команд в Рунете, которая делает отличные продукты и хорошо устроила внутреннюю культуру. При этом сфера интересов достаточно необычна — Иннова занимается играми (портал 4Game), детским парком KidZania Москва и онлайн-кинотеатром Ayyo. Крайне интересно, как им удаётся совмещать всё это и делать хорошие продукты в каждой из областей.\n\n\n\nUX-Среда AMA: AIC\r\nНа вопросы девятого AMA от UX-Среды и vc.ru о дизайне в студии AIC отвечают Сергей Попков, Николай Иванов, Андрей Абрамов, Ильназ Хасаншин, Сергей Киреев и Дмитрий Игошин. Компания постоянно ярко заявляет о себе сильными проектами и регулярными наградами, делится собственными мнениями и делает качественные переводы статей, а недавно анонсировала свою школу дизайна. Многие компании делают полезные для сообщества вещи, но AIC — одни из самых заметных в последнее время.\n\n\n\nКурированные ленты на Medium\n\n\nБлог дизайн-команды Juniper Networks.\n\nДизайн в IBM\n\n\nЕщё одна статья на тему того, как IBM превращается в дизайнерскую компанию. Уже около 100 тыс. сотрудников прошли обучение основам дизайна, а специализированных дизайнеров более 1300.\nПодборка кейсов использования методики дизайн-мышления от IBM.\n\nШрифт для государства\r\nКоманда опубликовала первую версию интерфейсного шрифта, который компании AIC и Лаборатория Артема Геллера разрабатывают в рамках проекта дизайна государственных систем совместно с компанией ParaType. Саша Королькова, арт-директор ParaType, считает важной задачей развитие кириллицы и расширение кругозора пользователей шрифтов. К сожалению, сегодня довольно мало кириллических шрифтов, рассчитанных под актуальные практические задачи, и интерфейсный шрифт, спроектированный специально для русского языка, очень нужен.\n\n\n\r\nСаша предложила именно такой, на первый взгляд неочевидный дизайн шрифта. Задачей было создать серьёзную, но максимально дружелюбную визуальную среду, поэтому перед нами гуманистический гротеск, близкий к голландским шрифтам. Обычно такие шрифты используются для печати, а не экрана, поэтому рисунок нужно было адаптировать для интерфейсов. Во-первых, пропорции шрифта заужены, межбуквенные расстояния и рост строчных знаков увеличены, а выносные элементы максимально короткие, что типично для шрифтов такого назначения. Круглые знаки чуть оквадрачены, чтобы увеличить количество белого внутри и заставить буквы выглядеть крупнее. Шрифт сохранил компактность и подходит для набора больших массивов текста/документации, но при этом не «чернит» на экранах маленьких девайсов. Этой цели служат тонкие соединения штрихов и тонкие штрихи в центре сложных букв, например, «в» и «з». Команде интересно ваше мнение.\n\nМатериалы конференций\nUX STRAT 2015\r\nОтчёт о первом дне презентаций конференции UXSTRAT, которая проходила 8-10 сентября в Athens, Georgia (США). Она посвящена дизайн-стратегии и собирает мощный состав тематических спикеров.\n\nСвежие ссылки можно также отслеживать в одноименной Facebook-группе или получать раз в месяц по почте. Спасибо всем, кто также публикует ссылки в ней, особенно Геннадию Драгуну, Павлу Скрипкину, Дмитрию Подлужному, Антону Артемову, Денису Ефремову, Алексею Копылову, Тарасу Бризицкому, Евгению Соколову и Антону Олейнику. Все больше материалов в обзорах появляется благодаря им.\n\nПодписывайтесь на рассылку! Письмо приходит один раз в месяц.", {"day": "3", "month": "октября", "time": "11:56"}, {"rate": 39, "views": 7700}], ["Уже шесть лет я публикую регулярные обзоры свежих статей по теме интерфейсов, новых инструментов и коллекций паттернов, интересных кейсов и исторических рассказов. Из лент нескольких сотен тематических подписок отбирается примерно 5% стоящих публикаций, которыми интересно поделиться. Предыдущие материалы: апрель 2010-июль 2016.\n\n\n\nПаттерны и Best Practices\nMixed Parts\r\nСообщество Mixed Parts, собирающее статьи, презентации, инструменты и примеры интерфейсной анимации.\n\n\n\nHere’s What May Sound Like a Crazy Idea\r\nИнтересные мысли Kevin Goyena о том, как хардкорные решения старых интерфейсов командной строки могут помочь в современных продуктах. Он ссылается в том числе на древние сервисы бронирования билетов, где оператор должен был помнить короткий, но сложный формат запроса. Похожие идеи пригодятся для ускорения заполнения сложных форм при условии, что оператор делает это часто.\n\n\n\nDoes Improving Website Navigation Pay Off?\r\nJeff Sauro размышляет на тему того, можно ли оценить отдачу от вложений в навигацию сайта. Многие фокусируются на процессе оформления заказа, но до него пользователю ещё надо дойти.\n\n5 Design Principles for eHealth\r\nBrett Warren даёт пять советов по работе с интерфейсами в сфере здравоохранения. Пользователи не всегда имеют возможность обучиться работе с продуктом либо это происходит за несколько месяцев до начала использования, нужно уделять особенное внимание информационному дизайну и помощи в принятии решений.\n\nПисьма рассылки\n\nСвежие советы Lee Munroe по дизайну писем рассылки. Популярность почтовых клиентов, особенности отображения на умных часах и многое другое.\nИнтересный разбор большой выборки писем рассылки на предмет того, как они размещают основные кнопки действия.\n\n\nУ нас проблема с паролем, или что происходит сейчас в области идентификации\r\nПеревод статьи Drew Thomas, в которой он описывает современные способы авторизации на замену привычным логину и паролю. Он сравнивает их по надёжности и сложности реализации.\n\nГайдлайны платформ и компаний\nWhat Analyzing 50 Brand Guides Taught Us About Building a Lasting Company\r\nКоманда SketchDeck проанализировала дизайн-гайдлайны 50 компаний. Они описывают отличия в объёме, структуре и основных посылах в зависимости от размера, возраста и типа компании.\n\n\n\r\nНовости дизайн-систем:\n\nAndroid-разработчики Pinterest рассказывают о своей дизайн-системе для мобильных. У них интересный подход к сетке и отступам — модуль сетки меняется в зависимости от размера устройства, но количество колонок сохраняется. Видео выступления.\nРассказ о том, как на дизайн-систему переходит сервис бронирования билетов Trivago.\nNathan Curtis концептах реального применения дизайн-системы на продуктах, которые полезно делать в начале работы над ней.\nФреймворк Nucleus для создания живых гайдлайнов.\nОчень правильные мысли Christian Miller о силе параметрического дизайна. Такой подход позволяет упростить принятие простых решений, так что дизайнер может сфокусироваться на продукте.\nОбновился фреймворк Patternry для создания живых гайдлайнов.\n\n\n\n\nProduct vs Marketing Illustration\r\nШикарная статья Meg Robichaud из Shopify о разнице между иллюстрациями для продукта и маркетинга. Она разбирает пять основных категорий иллюстраций и то, чем они полезны в обоих типах.\n\n\n\nWhy design principles shape stronger products\r\nJessie Chen показывает пример описания принципов дизайна для CRM-системы. Они привязаны к пирамиде, похожей на модель Маслоу.\n\nAndroid Wear\n\nLuigi Notaro разбирает изменения в гайдлайнов в Android Wear 2.0. Google пересмотрел цветовые палитры — они стали более тёмными для того, чтобы сэкономить батарейку и не отвлекать пользователя лишний раз. Используется достаточно интересная формула для расчёта цветов относительно основного.\n\n\n\n\niOS 10\n\nШаблон iOS 10 для Sketch от Great Simple Studio.\n\n\nThe ultimate social & digital ad size guide!\r\nОбновилась подробная шпаргалка по размерам графических элементов в социальных сетях от Adsvise. Они также добавили шаблоны для Photoshop и Sketch.\n\nПонимание пользователя\n39 studies about human perception in 30 minutes\r\nБезумно крутая статья Kennedy Elliott об особенностях восприятия разных типов инфографики. По каждому пункту она ссылается на добротные исследования и даёт рекомендации, когда и где использовать их.\n\n\n\nThe Six Minds of UX Design\r\nОтличная обзорная статья Sheena Lyonnais о шести факторах UX, которые нужно учитывать при дизайне интерфейсов. Это работа в визуальной подачей и вниманием, ориентированием, памятью и семантикой, языком, эмоциями, а также принятием решений.\n\n\n\nDesigning News Products With Empathy — 50 Stress Cases To Consider\r\nLibby Bawcombe из NPR провела пользовательское исследование читателей новостей и составила 50 стрессовых ситуаций, в которых пользователи работают с новостными сайтами.\n\n\n\nDesigning Desirable Experiences\r\nArindam Roy рассказывает о плюсах продуктов, интерфейсы которых не просто утилитарны, но желанны пользователями. Зачастую ощущения от использования таких продуктов лучше в сравнении с полными функциональными аналогами, но менее притягательными.\n\nAccessibility\n\nНемного о том, как Facebook делает свои продукты доступными. Интересно, что они пытаются в том числе объяснить суть картинок тем, кто не может их увидеть.\nRuby Zheng описывает социальные аспекты accessibility, позволяющие уважительно относиться к пользователям с ограниченными возможностями.\n\n\nThe Mysterious Student, Dieter Rams, and Cracking Global Markets\r\nИнтересные психологические выкладки на тему того, почему важно грамотно локализовать продукты.\n\nUser Memory Design — How To Design For Experiences That Last\r\nCurt Arledge из Viget не первый, кто пишет про психологию пользовательского опыта, но у него получилось более полезно для практики. Он разделяет то, как переживалось событие и то, что остаётся в памяти. И даёт советы по улучшению продуктов с учётом этого.\n\nИнформационная архитектура, концептуальное проектирование, контент-стратегия\nPlace in Space (AKA «How to Design A Concept Model»)\r\nОтличнейшая презентация Stephen P. Anderson о том, как создавать концептуальные модели. Сложная тема разжёвана по шагам.\n\n\nCustomer Journey Map\n\nТолковая и ёмкая памятка по customer journey map от Nielsen/Norman Group.\nОбзорная статья от Realtime Board на основе материалов внутренней библиотеки и обкатки на пользователях. От процесса до сравнения с похожими инструментами.\n\n\nThe Four Dimensions of Tone of Voice\r\nХорошая памятка Nielsen/Norman Group по выбору тональности интерфейсных текстов. Они предлагают 4 градации: весёлый—серьёзный, формальный—непринуждённый, уважительный—фривольный, с энтузиазмом—сухой.\n\nMaking a case for letter case\r\nJohn Saito из Dropbox разбирает ситуации в англоязычных интерфейсах, когда необходимо писать заголовок словами с большой буквы. Правила языка говорят, что заголовки должны писаться с большой буквы, но гайдлайны iOS и Android говорят разное.\n\nПроектирование и дизайн экранов интерфейса\nC4 Studio\r\nНовый инструмент C4 Studio для работы над интерфейсной анимацией. Пока что это альфа-версия, но обещают импортируют макетов из Sketch, и код в Xcode на выходе. У продукта уматнейший промо-ролик про беды коммуникации дизайнера и разработчика.\n\n\n\nPixel-Perfect Specifications Without The Headaches\r\nНиколай Бабич в деталях сравнивает инструменты для передачи макетов и ресурсов разработчикам. Он описывает интерфейс и возможности Avocode, Sympli и Zeplin.\n\nCompare Adobe Illustrator to Affinity Designer and Sketch in 2016\r\nПодробное сравнение Adobe Illustrator, Affinity Design и Sketch с точки зрения дизайнера иконок. Iconfinder делали такое же сравнение пару лет назад, но с тех пор инструменты сильно обновились.\n\nDesigning for Television, part 1\r\nПамятка по дизайну интерфейсов для ТВ от Molly Lafferty из This Also.\n\n\n\nPattern\r\nПриложение Pattern для прототипирования на iPad. Интересные решения, хотя сам процесс выглядит вымученным относительно простой бумаги и ручки.\n\nPrinciple\n\nВышла вторая версия Principle. Появилась работа с компонентами.\nReony Tonneyck о том, как реализовать параллакс в Principle.\n\n\nSketch\n\nПриложение Crystal для просмотра макетов Sketch на Android-телефонах.\nКрутейшая серия статей Mike Mariano о том, как создавать плагины для Sketch. Пошаговые инструкции, начиная с самых базовых вещей.\nКак создавать инфографику в Sketch.\nШаблон иконок приложения для Android и iOS в Sketch.\n\n\nFigma\n\nПоявилась интеграция с Framer.\nКстати, у инструмента шикарная 404.\n\n\nMarvel\n\nВышла вторая версия плагина к Sketch, связка стала работать лучше.\n\n\nInVision\n\nInVision переименовали свою серию видео-презентаций от известных дизайнеров в DesignTalks и переработали подсайт.\n\n\nPNG optimisation\r\nКоманда Bjango рассказывает об оптимизации PNG и том, какой результат выдают по умолчанию наиболее популярные программы для дизайнеров.\n\ndummi\r\nГенератор контента для макетов и прототипов Dummi выдаёт списки пользователей, городов, книг и статей в JSON.\n\nСовременные инструменты паблишинга\n\nВ Tilda теперь можно создавать свои модули.\n\n\nОбзоры и сравнения инструментов прототипирования\n\nCooper доработали свою сравнительную таблицу инструментов — появился фильтр для выбора подходящего.\n\n\nПользовательские исследования и тестирование, аналитика\nПланирование юзабилити-тестирования\r\nМоя коллега Наталия Спрогис написала подробнейшую инструкцию по планированию юзабилити-тестирования. Постановка вопросов и выбор методов, определение метрик, составление заданий и особенности проведения. Вторая часть.\n\n\n\nGoing Beyond the Obvious\r\nОтличная статья Philip Hodgson из UserFocus о том, как правильно ставить вопросы для пользовательских исследований. Это поможет находить действительно ценные инсайты, а не просто поставить галочку о проведённом этапе проекта. Philip ссылается на книгу зоолога Niko Tinbergen, который выдвинул 4 принципа наблюдения за животными — они применимы и для изучения поведения людей.\n\n\n\n10 Practical Tips for Increasing the Impact of Your Research Insights\r\nMike Katz из Groupon даёт советы исследователям на тему того, как лучше донести результаты пользовательских исследований до продуктовой команды так, чтобы улучшения попали в продукт.\n\nСколько нужно респондентов\n\nЕщё одна памятка Jeff Sauro по поводу количества респондентов в зависимости от вопроса, стоящего перед исследованием.\n\n\n13 Things to Consider When Offering Survey Incentives\r\nJeff Sauro даёт советы на тему оплаты времени респондентов пользовательских исследований. Хотя специфика многих отличается от отечественной, они всё равно будут полезны.\n\nВизуальное программирование и дизайн в браузере\nWays To Reduce Content Shifting On Page Load\r\nMichael Scharnagl разбирает способы оптимизации кода страницы, которые уменьшают дёргание текста при подгрузке медиа-объектов и других данных.\n\nFramer\n\nК Framer теперь можно подключить MIDI-клавиатуру для управления анимацией.\n\n\nWebflow\n\nВышла вторая версия инструмента Interactions внутри Webflow. Расширены возможности анимации для сайтов на платформе.\n\n\nCSS-анимация\n\nNash Vail разбирает особенности кривых движения в CSS.\nJosé Rosário рассказывает, как добиться высокого FPS в CSS-анимации.\n\n\nВеб-типографика\n\nTim Brown из Typekit рассказывает о том, как сделать полностью адаптивный текст. Размер шрифта, межстрочное и межпараграфное расстояние зависят от ширины окна браузера.\nВ Chrome появилось свойство CSS font-display, которое облегчит подгрузку кастомных шрифтов. По мере его распространения можно будет отказаться от решений на базе JavaScript.\nОтличные мысли Marchin Wichary из Medium о сложностях следования принципам классической типографики в вебе.\n\n\nCSS shapes\n\nПамятка Abbey Fitzgerald о том, как работают более простые возможности масок в CSS.\n\n\nTrym — Beautiful small app for macOS to help you view, optimize and convert SVG icons\r\nПриложение для просмотра, оптимизации и конвертации SVG файлов. После установки становится просмотрщиком SVG по-умолчанию. В зависимости от цвета иконки, меняется тема интерфейса между светлой и тёмной (стандартные просмотрщики показывают изображение белого цвета на белом фоне). Иконки можно оптимизировать для уменьшения размера (например, Sketch оставляет много мусора при экспорте), а также поменять размер и в один клик конвертировать в PNG в разных размерах для веба, iOS и Android. Другие инструменты для работы с SVG:\n\nПриложение SVGsus для Mac упрощает работу с SVG. Организация набора иконок, их оптимизация и подготовка ресурсов.\n\n\nНовые скрипты\n\nКак использовать свойство CSS «writing-mode» для компоновки страницы.\nИндикатор прокрутки на чистом CSS.\nБиблиотека in-view.js сообщает, когда во viewport появляется определённый DOM-элемент. Хорошее решение для динамических промо-сайтов.\n\n\nМетрики и ROI\nMobile App Analytics — The 12 Most Important Metrics to Measure\r\nYael Tolub перечисляет основные метрики, которые оценивают успешность мобильных приложений.\n\nUX-стратегия и менеджмент\nPeter Merholz & Kristin Skinner — Org Design for Design Orgs\r\nНовая книжка от Peter Merholz и Kristin Skinner про управление командой продуктовых дизайнеров. В электронная версия уже доступна, для бумажной версии действует предзаказ (скидочный код на 50% для электронных книг O’Reilly легко найти в интернете). Блог книги с актуальными статьями.\n\n\n\r\nДругие материалы об управлении дизайн-командами:\n\nMargaret Gould Stewart, вице-президент по продуктовому дизайну в Facebook, пишет о необычном вопросе, который ей задал руководитель — где не работает дизайн-процесс? Если всё идёт слишком гладко — значит, есть слишком много микро-менеджмента.\nTom Harman рассказывает о новом дизайн-процессе Buzzfeed, который внедряется с конца весны. Они запустили типовой сценарий для дизайнерских задач.\nИнтервью с Rochelle King, вице-президентом по инсайтам и дизайну Spotify. Компания недавно объединила дизайнеров с аналитиками и исследователями — здравый, но не особо распространённый ход. Она рассказывает, как это помогает двигать продукт вперёд.\nVivienne Kay из Shopify пишет о том, как наладить эмпатию не только с пользователями, но и с коллегами по продуктовой команде.\n\n\nAn Inside Look at Facebook’s Method for Hiring Designers\r\nJulie Zhuo подробно рассказывает о процессе поиска, собеседования и интеграции новых дизайнеров. Много полезных советов по всем этапам процесса.\n\nThe future of UX design\r\nАктуальные вопросы развития UX как направления, да и каждого профессионала, который думает о развитии.\n\nМетодологии, процедуры, стандарты\nДоработка профессионального стандарта «Специалист по дизайну графических и пользовательских интерфейсов»\r\nПрофессиональный стандарт «Специалист по дизайну графических и пользовательских интерфейсов» сейчас активно дорабатывается и инициативная группа проводит опрос — понять, что входит в обязанности UX-профессионалов России и стран СНГ. Опрос анонимный, понадобится около 15 минут. Его результаты будут опубликованы.\n\nКейсы\nAre Successful App Redesigns Even Possible?\r\nDaniel Sands провёл интересное исследование отзывов к последним редизайнам мобильных приложений. Неважно, хорошо ли поработала команда или нет, пользователи всегда недовольны. Но оказалось, что спустя несколько недель шумиха спадает и оценки возвращаются, а позже.\n\n\n\r\nДругие кейсы редизайна:\n\nКак сервис Nextdoor уменьшил проявления расизма в сервисе для общения соседей. Интересные эксперименты с интерфейсом и текстами.\n\n\nТренды\nАлгоритмический дизайн\n\nOliver Roeder размышляет о роли дизайнера в эпоху алгоритмов. Он считает, что суть не меняется — это просто ещё один инструмент в арсенале.\n\n\nAn invisible interface — 6 things we learned from designing for voice\r\nДизайн-команда Vox Media рассказывает о своём опыте создания голосового помощника для Amazon Echo. Полезные советы для тех, кто пробует создавать голосовые интерфейсы.\n\nМессенджеры\n\nNielsen/Norman Group провели юзабилити-тестирование WeChat. Интерфейс достаточно посредственный, боты не особо умные, да и в целом это чаще не диалог на естественном языке, а хождение по меню. Он популярен благодаря интеграции всего и вся, а также лёгкости платежей.\n\n\nИнтерфейсы в кино\n\nРассказ студии Perception о работе над интерфейсами к фильму Batman vs Superman.\n\n\nВиртуальная реальность\n\nGreg Madison из Unity развенчивает три больших мифа виртуальной реальности. Он скептически относится к фильмам360, использовании для продолжительной работы и использовании классических методов ввода вроде мыши и клавиатуры, да и в целом считает, что со временем всё превратится в дополненную реальность.\n\n\nSymbol For Context\r\nJoe Blau предлагает универсальную иконку для обозначения контекста, в котором компьютер берёт на себя часть действий пользователя. С распространением персональных помощников, беспилотных автомобилей и других продуктов, которые выполняют более активную роль, важно показывать, что компьютер взял часть управления на себя.\n\nДля общего и профессионального развития\nGraphic Means\r\nК выходу готовится документальный фильм Graphic Means о том, как работали дизайнеры в до-цифровую эпоху и как изменилась работа после появления компьютеров. Авторы взяли интервью у пары десятков известных специалистов вроде Tobias Frere-Jones, Ellen Lupton и Dan Rhatigan. Обещают к концу года.\n\n\n\nIntellectual Property & UX Design — Preceding Year and the Next Decade\r\nИнтереснейшая презентация Rob Tannen на тему истории и практики применения патентов на дизайн. Подробно разбирает в том числе известную судебную тяжбу Apple и Samsung.\n\n\n\nUX Chat — Daily UX conversations with your friendly UX Bear\r\nКоманда блога uxdesign.cc и Adrian Zumbrunnen запустили бота, который рассказывает новости продуктового дизайна. Он основан на недавнем концепте личного сайта Adrian.\n\n\n\nTransitioning from support to UX — A year in perspective\r\nKylea Parker рассказывает о том, как перешла из поддержки пользователей Shopify в UX-дизайнера. Советы для тех, кто также переквалифицируется.\n\nШрифт для государства\r\nAIC вместе с Лаборатория Артема Геллера и командой ParaType (на этапе разработки дизайна — в лице Александры Корольковой) приступает к работе над шрифтом для государства. Нам нужен свой шрифт, который сможет стать основой единой экосистемы всех официальных интернет-ресурсов. Современный, бесплатный, общедоступный. Целое семейство шрифтов с разными параметрами, находящееся в открытом доступе. \n\r\nАртём Геллер просит сообщество ответить на несколько вопросов:\n\nКакой характер должен быть у шрифта для государственных систем?\nДолжен ли он быть таким же официальным, как само государство?\n\n\r\nПроект по улучшению цифрового взаимодействия с государством инициирован людьми для людей, и команде хочется отразить эти стремления. Результат первых обсуждений и беглого анализа государственных шрифтов разных стран: за основу берётся современный голландский гротеск — гуманистический и дружелюбный. Как Пётр I — брать пример с голландских мастеров.\n\nPractical UX Design\r\nВ апреле вышла книга Scott Faranello «Practical UX Design». UXMatters публикует вторую главу из неё, посвящённую открытому и закрытому состоянию работы дизайнера.\n\nПродуктовый дизайнер\n\nАнтон Ловчиков рассказывает, как делал приложение Ремемба. Сначала просто как дизайнер, а потом занялся и разработкой.\n\n\nШуточки про дизайнеров за 400\n\nКомиксы The Design Team пародируют работу дизайн-команд.\n\n\nGoogle Analytics In Real Life — Online Checkout\r\nЕсли бы Google Analytics работал в офлайне.\n\n\n\nЛюди и компании в отрасли\nThe Best Medium Publications from Design Teams to Follow\r\nFabricio Teixeira собрал список блогов дизайн-компаний и команд на Medium.\n\n\n\r\nДругие новости известных дизайн-команд:\n\nБлог дизайн-команды медиа-проектов NPR.\n\n\nDesign.blog\r\nДизайн-команда Automatic (создатели WordPress) запустила блог с бесхитростным названием Design blog. Инициатива появилась во многом благодаря John Maeda, который недавно перешёл в компанию из KPCB. Его должность — «global head of computational design and inclusion» (чем именно будет заниматься).\n\nДизайн в Adobe\n\nДизайн-команда Adobe теперь называется просто Adobe Design вместо Adobe Experience Design (чтобы не путаться с одноимённым инструментом). Они сделали новую айдентику для себя.\nAMA с командой Adobe Design.\n\n\nДизайн в Airbnb\n\nКак создавался внутренний инструмент Airshots для автоматического тестирования интерфейса на разных устройствах и языках.\n\n\nМатериалы конференций\nUX STRAT 2015\r\nОтчёт о мастер-классах в рамках конференции, которая прошла 8-10 сентября в Athens, Georgia (США). Она посвящена дизайн-стратегии и собирает мощный состав тематических спикеров.\n\nШкола дизайна AIC\r\nAIC открывает набор в онлайн-школу. Дизайн и инструменты в цифровой среде развиваются стремительно — стоит только описать тенденции и правила, как они устаревают. Единственный способ научиться — окунуться в среду лидирующей студии и понять принципы на практике. На сайте уже можно записаться в школу.\n\n\n\nСвежие ссылки можно также отслеживать в одноименной Facebook-группе или получать раз в месяц по почте. Спасибо всем, кто также публикует ссылки в ней, особенно Геннадию Драгуну, Павлу Скрипкину, Дмитрию Подлужному, Антону Артемову, Денису Ефремову, Алексею Копылову, Тарасу Бризицкому, Евгению Соколову и Антону Олейнику. Все больше материалов в обзорах появляется благодаря им.\n\nПодписывайтесь на рассылку! Письмо приходит один раз в месяц.", {"day": "7", "month": "сентября", "time": "12:57"}, {"rate": 29, "views": 8400}], ["Генеральный директор студии lab.AG Артём Геллер, работавший над новой версией президентского сайта Kremlin.ru, дал интервью изданию Smashing Magazine — в нём он рассказал о разработке ресурса, технических аспектах работы с администрацией президента, создании адаптивного интерфейса сайта, а также раскрыл некоторые детали проекта.\n\n\n\nОсобенности работы с государственными структурами\r\nГосударственный заказчик такой же, как коммерческий, иногда даже лучше. Администрация президента доверяла нам как проектировщикам и дизайнерам, её представители хотели сделать сайт Кремля лучше. Пожалуй, работать с ними было все равно, что с лучшим из коммерческих заказчиков.\n\r\nНо история началась давно. Примерно в 2008 году пресс-служба администрации президента разослала компаниям, занимавшимся информационным дизайном в вебе, предложение сделать сайт президента. У меня в тот момент было много времени, и я сделал свой вариант — продуманный и объемный.\n\r\nВремя от времени мне звонили и сообщали, что мы попали в двадцатку, потом в десятку. Но в какой-то момент мне позвонили и сказали: «Приходите в Кремль». Там из трех лучших компаний выбрали мою.\n\r\nЯ отвечал за событийную и справочную часть портала Kremlin.ru, который запустили в 2009 году. Это был первый «крутой» государственный сайт, получивший хорошие отзывы от профессионального сообщества, включая посетителей «Хабрахабра». Потом меня позвали делать сайт правительства (government.ru), и он был вторым знаковым для российского e-gov.\n\r\nКогда я сделал первый сайт в 2009 году, то 80 процентов последующих госсайтов подстраивались под его стиль. То же самое я увидел после создания government.ru, и уже тогда начал закладывать возможность стандартизации. Занимаясь разработкой одного, думаешь обо всех ресурсах, которые будут себе это копировать.\n\r\nСоздавая новый сайт, мы держали в уме весь российский e-government. Не люблю термин «правительственные сайты». Мы хотели создать эталон.\n\r\nМы постоянно были в прямом контакте с пресс-службой президента. Да и сам президент в создании сайта принимал участие на ключевых этапах разработки.\n\r\nМне всегда нравились компетентные люди, которые умеют принимать решения. Именно с такой командой на стороне заказчика нам пришлось работать. Редкий клиент. Мы увидели чиновников, которые в пятницу после десяти вечера сидели и обсуждали с нами, «как сделать наш сайт лучше», хотя своих подчиненных уже отпустили домой. Они работали с нами вместе с самого начала и до последнего дня перед запуском. Они доверяли нашему мнению. Мы перепробовали и перепроверили каждое решение.\n\r\nПрошлая версия сайта славно прослужила 6-7 лет. На протяжении этого времени мы структурировали и решали все новые и новые задачи, исходящие из запросов пользователей и нужд пресс-службы. У нас было достаточно времени, чтобы понять приоритеты меняющейся аудитории. Постепенно возникло множество идей, способных радикально улучшить UX для всех групп пользователей, появились задачи, которые требовали обновить нашу CMS, изменилась платформа — «железная» составляющая ресурса.\n\r\nТехнологии, пристрастия аудитории меняются достаточно быстро. Так что вполне естественно, что сайт президента должен соответствовать всем потребностям времени. Все это повлияло на создание абсолютно нового ресурса, и я бы не называл это редизайном.\n\r\nСейчас работа над сайтом продолжается.\n\nИнформационная структура сайта\r\nМы собирали всю возможную статистику по пользователям и группам с помощью популярных инструментов. Кроме того, у нас накопилась статистика, собранная по результатам тестирования наших архитектурных и интерфейсных идей. Экспериментировали на «живом» ресурсе, делая те или иные выводы.\n\r\nПроводились интервью и анализ целевых аудиторий. В нашем случае это в первую очередь (40%) журналисты — из-за информационной, а не сервисной специфики. Именно этот ресурс часто оказывается цитируемым первоисточником важной информации, связанной с деятельностью президента.\n\r\nДля них мы сделали очень много. Как один из сотни маленьких примеров — ссылка на материал без стилей, откуда просто копировать текст.\n\r\nЭто очень удобно, так как при стандартном Ctrl(Cmd)+A, Ctrl(Cmd)+С, Ctrl(Cmd)+V мы позволяем вставлять материал из буфера без каких-либо стилей. Для этого мы поместили его в text area. Это позволяет не менять форматирование в своем редакторе после вставки.\n\r\nВторой сегмент — это граждане России и зарубежная аудитория (50%). Самая большая и важная часть, о которой мы бесконечно думали от старта создания концепции до мельчайшей детали. Скажу по секрету, внутри нашей команды есть негласный лозунг, который мы позаимствовали у ребят, создающих gov.uk: «User needs, not government needs».\n\r\nГосударство осознаёт проблемы, которые само генерирует; прошёл переломный момент, теперь проще — сформировался запрос на качественный по всем критериям продукт. Да, с нами сложно. Да, есть проблемы бюрократии и понимания процессов.\n\r\nВ конечном итоге то, что есть сейчас, создавалось именно дизайнерами и разработчиками, которые не смогли, не захотели, не доказали правильность решений и не направили клиента в сторону человекоориентированности.\n\r\nЧиновники (всё более молодые сегодня) совсем иначе формулируют задачи: заботясь об интересах аудитории, заменяют вкусовщину на функционализм. Раньше об этом поднимал речь дизайнер, теперь на этом ставят акцент прежде всего сами заказчики.\n\r\nПрезидентом же введён сложнейший KPI — удовлетворённость пользователей интернет-сервисов услугами на 90% к декабрю 2015 года, а к декабрю 2020 года — на 95%. Трудно понять, как достичь таких результатов, но важно совсем другое: KPI есть, формулировка существует, над выполнением будут работать.\n\r\nТретья группа профессиональной аудитории — чиновники со своими задачами и спецификой, 10%. В большинстве случаев здесь мы решаем вопросы доступности к оперативно наполняемой базе нормативных документов, поручений, ключевых задач, которые ставит президент и его администрация.\n\n\r\nМы не ставили перед собой задачу разобраться в информационной структуре прошлого ресурса (мы её уже создали и просто поддерживали), но хотели переосмыслить наши подходы к представлению разных типов данных с учетом потенциального контекста.\n\r\nМы постарались в максимально простой форме объединить несколько крупных президентских ресурсов в один. Например, раньше существовал отдельный сайт «Государство», на котором хранились материалы об институте президентства и информация о деятельности государственных структур, консультативных и совещательных органов при президенте. Теперь все эти материалы можно найти на Kremlin.ru в разделе «Структура». Да и от архивов мы избавились. Теперь все материалы, начиная с января 2000 года, доступны на текущем ресурсе.\n\n\r\nДля нас было важно отделить информацию о событиях (новостной и другой контент) от «статичной» информации — например, навигационных элементов. В то же время было необходимо минимизировать количество информационного шума. Одна из основных идей — это линейность контента, информация везде выводится в одну колонку. В результате у нас получилась понятная не перегруженная структура. О наличии справочной официальной информации мы подсказываем лишь в необходимом контексте.\n\r\nKremlin.ru не является СМИ в традиционном или современном его понимании, существует своя значительная специфика — в частности, не нужно откручивать рекламу. То же самое с показателями «глубина просмотра» или «временем нахождения на ресурсе»: для нас положительность этих показателей часто является негативным фактором, обозначающим, что человек не смог получить максимально быстро ту информацию, которую искал.\n\r\nУ нас был файл со структурой, который переписывался вплоть до запуска проекта. В частности, нам необходимо было подобрать самые точные, лаконичные формулировки. Мы не можем позволить себе двойственное трактование текстов на государственном ресурсе столь большой информационно-политической значимости.\n\r\nСайт наполнен вещами в духе «Little big details». Думаю, вам будет интересно их изучить. Все они несут конкретную задачу. Мы можем объяснить необходимость использования на сайте каждого блока, связи, текста, пикселя и микроанимации — на Kremlin.ru нет ничего лишнего. За всем стоит логика, ведь «Бог в деталях».\n\r\nЕсли бы мы сделали этот проект «средним» — это был бы настоящий провал. Если бы мы этот проект сделали «плохо» — это была бы катастрофа. В случае, если проект сделан «очень хорошо», то единственный вопрос, который потенциально может возникнуть у профессионального сообщества и медиа — это «сколько на него потрачено денег?» Мы не боимся таких вопросов, потому что можем рассказать, на что ушёл каждый рубль.\n\n\nБюджет проекта\r\nСтоимость обновленного сайта президента составила 20 млн рублей (около $330 тысяч). В стоимость вошли как разработка новой версии сайта, так и поддержка старой. В случае президентского сайта, — это еще и обеспечение безопасности. Кроме того, часть этих денег ушла на создание английской версии сайта и версии для детей.\n\nОсобенности, связанные с работой над медиафайлами\r\nЗначительная и наиболее важная доля пользователей нашего ресурса — это сотрудники информационных агентств, различных российских и международных СМИ. По отзывам, они любят наш ресурс за то, что мы никогда не забывали и всегда старались создавать полезные и удобные решения для профессиональной аудитории.\n\r\nМы доработали введенное шесть лет назад понятие «Работать с текстом», которое служит удобным инструментом навигации по длинным стенограммам. Полуавтоматически размечаем видео, темы, лица, представленные в материале, в разы ускоряя поиск информации. Делаем большой массив текста понятным и интерактивным.\n\n\r\nНа днях на сайте появится возможность смотреть видео с субтитрами. Благодаря этому контент станет доступен не только англоязычным пользователям, но и людям с ограниченными возможностями.\n\r\nС технической стороны мы не стали изобретать велосипед, выбрали только один формат для видео — MP4, и одни формат для аудио — MP3. Нам было необходимо сделать так, чтобы наш сайт эффективно работал на максимальном количестве браузеров и устройств. Мы сразу решили, что будем работать с HTML5 video/audio, так как большинство современных браузеров поддерживают выбранные нами форматы, а для давних интернет-обозревателей оставили Flash-плеер.\n\r\nПисать свой плеер означало натыкаться на те же грабли, что и большинство, поэтому мы остановились на библиотеке MediaElement.js. При этом дописали поддержку некоторых плагинов, которые могут быть установлены у пользователя, таких как QuickTime, Windows Media Player, VLC. Учли несколько вопросов отображения медиа без использования JavaScript и поэкспериментировали с стилизацией встроенного плеера Google Chrome.\n\r\nМы отображаем изображение для видео, если браузер не поддерживает HTML video, а также не отображаем нашу большую кнопку Play, если и JS отключен или не работает, так как она перекрывает взаимодействие с элементом video.\n\r\nДля Chrome мы получили неплохой результат применения стилей к Shadow DOM, схожий с JS-плеером:\n\n\r\nМы стараемся следить за нововведениями для браузерных плееров и соответственно изменять нашу реализацию.\n\r\nДля осуществления навигации при отображении материала с видео мы написали редактор разметки для текста и автоматизировали плеер для перехода по размеченным областям.\n\nДесктоп или mobile\r\nГосударственный ресурс должен быть максимально доступен гражданам. Это один из основных ультимативных принципов. На большом ресурсе не имеет смысла гоняться за трендами, так как мы проектируем будущее, актуальный ресурс на 5-6 лет вперед. За это время индустрия успеет отфильтровать всю шелуху, оставив только значимое.\n\r\nМы не исходили из mobile-first идеологии. У нас было достаточно времени для того, чтобы отдельно подойти ко всем типам версий отображения проекта, уделили достаточно ресурсов и времени каждой, чтобы Kremlin.ru был удобен на всех типах устройств с разными способами взаимодействия. На всех форматах устройств мы постарались максимально оставить нативные решения. Весь контент и функциональность «большой десктопной» версии доступны на «мобильной», «планшетной», «ноутбучной».\n\r\nБезусловно, мы избавились на мобильной версии от некоторых интерфейсных решений, которыми просто невозможно пользоваться с телефона (работа со стенограммой), но если мы имеем дело с большим форматом — как планшет, — то этот специфический, профессиональный инструмент уже доступен. Весь контент однозначно доступен на всех устройствах. Функциональность проконтролировать сложнее, но мы концептуально старались, чтобы всегда поддерживались все версии.\n\n\r\nЯ могу более подробно рассказать про принципы адаптивности Kremlin.ru, так как это отдельный и интересный вопрос.\n\nФронтенд и бэкенд\r\nBEM («блок, элемент, модификатор», методология создания веб-приложений — прим. ред.) — правильный путь развития веб-разработки, недаром набирают обороты такие проекты, как ReactJS и WebComponents.\n\r\nВ процессе разработки у нас сформировался свой «вариант» BEM, некая вариация концепции. Мы разделяли JS и CSS-код компонентов в отдельные файлы, при проектировании HTML-шаблонов исходили из удобства повторного использования без привязки к конкретным функциональным элементам.\n\r\nСпециально под наши нужды мы написали обработчик запросов и менеджер отображения, а также систему якорей для более плавной анимации.\n\r\nВсе эти инструменты обслуживают responsible-сетку с двумя независимыми колонками и выделенным многоуровневым меню в хедере, футером и боковым меню. Здесь очень много корнер-кейсов для каждого размера, и их приходится программировать индивидуально (обработка и анимация переходов между страницами, изменения размеров окон, отображение и скрытие мобильного меню и так далее).\n\r\nБыли и специфичные проблемы для текущего времени. Например, отказ от Flash — мы максимально стараемся поддерживать HTML5 video, но сохранили поддержку отображения видео через Flash и Silverlight для старых браузеров.\n\r\nТак же мы использовали современные способы пре- и пост-процессинга CSS и JavaScript, и это очень сильно нам помогало:\n\n\nCSS: SASS + Compass, с автоматической генерацией PNG. Очень сильно упрощает работу с media queries и CSS-анимацией и увеличивает повторной используемости кода по сравнению с обычным CSS.\nJS: мы не использовали препроцессоров наподобие CoffieScript или TypeScript. Мы только автоматизировали сбор скриптов, сжатие и упаковку в один файл.\nАвтоматизация сборки через задачи Grunt.\nСборка повешена на хуки репозитория, и на момент деплоя в репозитории всегда лежит актуальная версия всех генерируемых файлов. Никакого человеческого фактора в этом процессе.\n\r\nЕсть одно важное правило. Приглашайте хороших инженеров и давайте им время — это на самом деле не сложно.\n\nОсобенности работы с навигацией и анимациями\n\r\nНавигация по сайту работает быстрее благодаря тому, что загрузка JavaScript и CSS происходит один раз, кроме того, мы используем History API. Перед запуском мы выявили наиболее медленные места как в клиентском, так и в серверном коде, оптимизировали их, включили кеширование везде, где только возможно.\n\r\nГладкость анимации достигается в основном за счет использования CSS, но не только. Мы провели оптимизацию на уровне контекстов отрисовки. Проводили тестирование времени отклика в анимации, это очень важно для плавности отображения элементов интерфейсов, было очень много проблем с поддержкой устаревших, но ещё используемых браузеров.\n\r\nРекомендуем другим проектам уделять внимание таким деталям, именно эти мелочи делают сайт действительно удобным и приятным в эксплуатации.\n\nОсобенности разработки адаптивного интерфейса\r\nНа данном витке эволюции проектирования и разработки в значительной степени сформировалось базовое понимание адаптивности. Мы еще не дождались AiUi — программно генерируемых интерфейсов, как результат обработки автоматически собранных данных. Где изначально интерфейса не существует и есть только информация на входе, с помощью которой строятся объекты, сущности, акценты, размеры, цвета и так далее. Приходится мириться с реальностью и самим проводить эту работу не персонализировано, но для групп.\n\r\nЧтобы понять результат, необходимо понимать несколько важных вводных: пропорции меняются. Старые 4:3 давно вытесняются стремлением к 16:9, понимая эту сложившуюся данность у нас открылась возможность думать и в этом направлении. Устройств значительно больше. «Мобильный» и «десктоп» — это форматы подачи, которые выделяют большинство разработчиков адаптивных ресурсов. В нашем случае мы выделили не два, а четыре базовых вида отображения:\n\n\nмобильный телефон;\nпланшет (вертикальный и горизонтальный);\nсреднеформатный ноутбук или экран — 15–17 дюймов;\nбольшой десктоп — 17–27 дюймов.\n\r\nИменно эти четыре формата с их популярными размерами окна браузера и легли в основу адаптивного ресурса.\n\n\r\nПо нашей статистике, 22% пользователей заходят на ресурс с мобильных устройств и видят адаптированный под них сайт, у 54% низкое разрешение — они видят сайт посередине или с маленьким отступом справа. Еще у 24% большие разрешения по горизонтали.\n\nПользовательская статистика\r\nБраузеры:\nGoogle Chrome — 30,4%;\r\nFirefox — 15,9%;\r\nInternet Explorer — 12,5%;\n\nMSIE 11 — 5,74%;\nMSIE 8 — 2,83%;\nMSIE 9 — 2,18%;\nMSIE 10 — 1,41%;\nMSIE 7 — 0,21%;\nMSIE 6 — 0,033%;\n\r\nOpera — 11,2%;\r\nMobile Safari — 8,34%;\r\nYandex.Browser — 7,59%;\r\nChromeMobile — 5,06%;\r\nAndroid Browser — 2,95%;\r\nSafari — 1,67%;\r\nOpera Mini — 1%.\r\nГеография русскоязычной версии ресурса:\n\nРоссия — 77,9%;\r\nУкраина — 7,12%;\r\nГермания — 1,29%;\r\nСША — 1,29%;\r\nБеларусь — 1,12%;\r\nКазахстан — 1,04%;\r\nКитай — 0,58%;\r\nВеликобритания — 0,57%;\r\nМолдавия — 0,42%;\r\nУзбекистан — 0,39%.\r\nГеография англоязычной версии ресурса:\n\nСША — 20,1%;\r\nРоссия — 8,22%;\r\nГермания — 7,72%;\r\nВеликобритания — 6,13%;\r\nКанада — 4,18%;\r\nФранция — 3,88%;\r\nНидерланды — 3,09%;\r\nАвстралия — 2,59%;\r\nАвстрия — 2,4%;\r\nНорвегия — 2,21%.\r\nМы думали обо всех группах пользователей с множеством устройств. Для всех создали свой, правильный, отдельный опыт. В итоге для того, чтобы идеально отобразить сайт на всех типах устройств с промежуточными значениями, нам понадобилось 9 брейкпоинтов. Все версии разрабатывались параллельно.\n\r\nИмеет смысл рассказать, какую идею мы вложили в самый интересный способ навигации и отображения, который начинается от 1580 px.\n\r\nУ большинства современных ресурсов подавляющее число пользователей приходит на конкретный материал из внешних ссылок. В нашем случае они сразу видят две независимые колонки. Левая колонка уже не является исключительно контентной, а превращается в основной элемент навигации. Правая колонка остается исключительно контентной без лишних навигационных инструментов и не нужной интерфейсной обвязки.\n\r\nПо нашим подсчетам, скорость навигации в этом режиме выросла в 1,5 раза, что очень понравилось редакции и нашим постоянным пользователям. Также появилась уникальная возможность не закрывая материал почерпнуть дополнительную информацию в левой части сайта. Нам удалось удивить администрацию президента динамикой и удобством решения. Через несколько недель у них отпали все вопросы в этой части.\n\r\nОбычно применяют стандартные древовидные решения. Приведу один пример из сотни. Человек читает новость, и в ней упоминается какое-то лицо. Он кликает на него, в колонке слева, не закрывая материал, возникает информация о его текущей должности, биографии и еще каких-то важных данных. Именно этой функциональностью мы ускоряем навигацию и не разрываем ритм чтения. Таким же образом, не отвлекаясь от события или документа, можно открыть другой раздел, прочитать дополнительную информацию, написать письмо, узнать контакты пресс-службы и так далее.\n\r\nПо нашей статистике, процентная составляющая пользователей с разрешением браузера 1580px+ от общего числа аудитории плавает в пределах 24% от общего числа пользователей. Исходя из сетки, у нас все еще существует возможность уменьшить значение в пикселях для двухколоночного отображения, но опираясь на статистику мы не сможем получить большой процентный прирост аудитории. На данный момент в этой борьбе компромиссов мы остановились на числе 1580.\n\n\r\nДве независимые колонки порождают множество новых способов взаимодействия. Вы ждали табы в Finder? Вы помните Norton Commander? Вы привыкли к своим почтовым приложениям и новостным агрегаторам? Все эти интерфейсные возможности мы будем раскрывать на новом Kremlin.ru. Как пример: в одном из следующих релизов мы запустим стеки материалов, когда в правой колонке собираются прочитанные и дополнительные материалы, к которым можно вернуться или узнать что-то важное. Таких идей очень много и важно чувствовать баланс, понимая задачи.\n\nДругие интересные особенности\r\nЯ уже в начале говорил, что сайт просто кишит маленькими радостями проектировщика, дизайнера и веб-разработчика. Попробую перечислить малую часть вкусностей:\n\nSVG-карта России и мира. При клике на определенный участок, окруженный большим количеством границ, можно выбрать все ближайшие страны или регионы из списка. Карта автоматически приближается к этому участку.\n\n\nИконки с данными. В лентах и материалах мы не только показываем длину видео, аудио и количество фотографий, но и размер материала — заранее высчитывая количество знаков. Это решает две профессиональные задачи: пользователю нет необходимости заходить в материал, если он видит, что работа над ним ведется и полный текст появится позже. Также пользователь может заранее решить, готов он читать большой текст или нет.\n\n\nНотификации. Если вкладку с сайтом не закрывать, в лентах обновляются новости и помечается количество непрочитанных. Для оперативности работы редакции сразу после того, как произошло событие, на сайте появляется короткий текст, потом — стенограмма и фотографии, в конце выкладывается видео. Мы видим все эти обновления, вернувшись во вкладку с «Новым Кремлем».\n\n\nРабота close icon в материале. При прокрутке вниз мы скрываем иконку, но при прокрутке вверх она снова появляется. Так же мы начинаем её показывать при наведении в большую область справа сверху, так как мы понимаем, что человек потенциально хочет закрыть материал. Также материал можно закрыть, просто кликнув в свободную область справа.\n\nАнимация взаимодействия при клике или tap. На тач-устройствах анимация подсказывает пользователю, прошло ли взаимодействие. Это важно в связи с нашей спецификой динамически подгружаемого контента.\n\n\nПодгрузка шрифтов. Важно дать возможность пользователю с низкой скоростью соединения мгновенно начать читать заголовки и текст материалов, не дожидаясь раздражающей подгрузки кастомных шрифтов. Решение этой задачи помогло нам избавить пользователя от мучительного ожидания, но мы получили небольшие «скачки», которые попробуем компенсировать за счет подбора настроек системных шрифтов.\n\nПодгрузка лент. Для отображения списков используется механизм инкрементальной загрузки при прокрутке страницы. При этом нам было необходимо дать возможность просматривать и использовать футер. Мы использовали так называемые зоны подгрузки и отображения, при попадании на которые происходит одно из действий: либо отображение следующей страницы, либо предзагрузка страницы. Также появляются кнопки навигации к следующей или предыдущей странице списка.\n\nКалендарь, подстраивающийся под контекст. Попробуйте открыть календарь в ленте событий и, не закрывая его, продолжить скроллить новости.\n\n\nУмный zoom. Попробуйте! В мобильной версии при двойном тапе на тексте в материале мы увеличиваем размер шрифта с сохранением позиции.\n\nАдаптивные заголовки. Размер шрифта изменяется в зависимости от размера заголовка, чтобы оставаться в нашей сетке.\n\n\nПодгрузка изображений. Одной из наших задач было максимально полно поддерживать различные устройства с различной плотностью пикселов (Retina, Ultra HD). Мы используем довольно свежую технику с использованием атрибута srcset, которая поддерживается многими современными браузерами, а для старичков мы взяли JavaScript-реализацию. Заодно и для видеопостера подобное написали. Для медленных соединений мы использовали в качестве прелоадера фоновый градиент, который вычисляется на основе преобладающих оттенков изображения.\n\n\n\nАдаптивные иконки. Иногда мы открываем материал «поверх» сайта, а иногда справа. Для каждой из эти ситуаций мы проводим подсчеты и показываем соответствующую ситуации иконку. Попробуйте изменить окно браузера при большом разрешении.\n\n\nFont rendering. Много сил было потрачено на качественный рендеринг шрифтов во всех возможных операционных системах и браузерах. В разных ситуациях мы применяли разные решения, а иногда даже меняли цвет текста для конкретного браузера. Для Franklin Gothic мы пробовали использовать несколько различных вариантов рендеринга, но в последствии остановились на: text-rendering: optimizeLegibility; -webkit-font-smoothing: subpixel-antialiased, который лучше всего работал в максимальном числе браузеров и ОС.\n\r\nКак пример, в Chrome цвет текста в футере выглядел серым, а в Safari синим. Мы выбрали немного другой оттенок, который отвечал нашим задачам и выглядел везде одинаково.\n\r\nТакже мы прошли несколько итераций смены цветовых решений, для того, чтобы добиться оптимального результата на большинстве устройств, включая устройства с использованием Retina.\n\r\nСтенограммы, разметка видео. Для разметки текста мы написали свой собственный модуль. Можно установить тему, персону для любого параграфа. Полученный список маркеров мы показываем на странице со стенограммой, где при клике можно переходить к отмеченным словам. Также каждый параграф помечается временным маркером. И при воспроизведении видео материал автоматически докручивается до позиции в ролике.\n\r\nПри этом навигация по стенограмме и навигация видео может работать одновременно. В этой части одним из главных вызовов было создание удобного интерфейса для редакторов. Мы написали расширение для админки. Интерфейс, позволяющий редактору каждому параграфу сопоставить персону, тему, промежуток времени. На выходе получаются классы и data-* атрибуты (см. например исходники view-source:http://kremlin.ru/events/president/transcripts/pre... — Ctrl+F data-time-start), которые подхватываются и используются в JS.\n\nЭстетика в деталях. Мы показываем наши бекграунды в случае, если пользователь продолжает скроллить, уперевшись в конец или начало сайта.\n\n\nОтдельная версия герба. Сделали отдельную версию герба, который соответствует законодательству и выглядит просто отлично. Это было необходимо, поскольку до этого момента не существовало специальной версии, разработанной для экрана. Важно было вписать герб в правильную простую форму, чего не было сделано ранее, а позже для узнаваемости добавить детали, близкие к привычной визуализации. Мы изначально решили, что подарим герб всем, кто будет создавать госсайты, — выложили исходные файлы и иллюстрации под свободной лицензией Creative Commons.\n\n\nMark and Share. Эта библиотека позволяет пользователям выделать фрагменты контента на сайте и делиться с другими пользователями сети уникальными ссылками на помеченные элементы.\n\n\r\nМне кажется, этот список может быть бесконечным.\n\nОсобенности локализации на два языка (русский и английский)\r\nВсе проектирование проходило с тестированием английских формулировок базовых элементов. Существует множество моментов, отличающих эти версии, в частности на главной странице английской версии мы показываем карту мира, а не карту России, или отображаем международный формат +7..., вместо российского 8 (495)… Проверяем на бек-энде. Если язык русский, то выводим 8, если английский, то +7.\n\r\nТак же мы используем gettext с автоматической сборкой PO-файлов (файл в формате «исходная фраза — перевод») из исходного кода: серверсайд, шаблонов, JavaScript. При сборке проекта готовые переводы упаковываются обратно в JavaScript, шаблоны и код подставляют переводы при генерации страницы. Довольно типовое решение.\n\nКак работала команда\r\nМы все работаем в одной просторной комнате, в которой каждый уважает мнение другого. Мы в достаточной степени профессиональны, чтобы слушать, слышать и принимать решения, не скатываясь к бюрократии раздутых команд.\n\r\nC нашей стороны над проектом работало два UX-дизайнера, — пять фронтенд-инженеров и значительное число людей, занимающихся бэкендом в разном его понимании.\n\n\r\nНачали разработку с простых прототипов, отображающих основные принципы, которыми мы собирались руководствоваться на старте. Чуть позже они переросли в детальные прототипы с тестированием стилистических элементов: цветов, шрифтов, интерфейсных решений. Была выстроена система используемых цветов и шрифтов, которая частично менялась в процессе. Также на этом этапе мы сделали прототип наших решений в браузере, чтобы понять, какие подводные камни разных масштабов нас могут ожидать.\n\r\nКак пример: именно в прототипе для браузера клиент по-настоящему понял, как удобна наша идея с двухколоночной независимой структурой.\n\n\r\nПроектирование, дизайн и разработка — это параллельные процессы, которые запустились практически одновременно и продолжались вплоть до запуска нового Kremlin.ru. Мы и сейчас продолжаем работу над улучшением проекта в разных направлениях.\n\nИнструменты, которые используются в работе команды\r\nНачали проектирование на бумаге и в привычном Photoshop, но практически сразу перерисовали все в Sketch. Мучались во время становления продукта от его нестабильности и загадочной специфики экспорта в SVG, но по мере развития Sketch возвращаться в Adobe Photoshop нет большого желания.\n\r\nЕсли брать все этапы, включая первичные теоретические, то разработка длилась больше года.\n\r\nЗначительную часть задач по фронтенду мы решили перенести в Trello, где за год было закрыто больше 2500 карточек с задачами и списками задач.О разработке государственных сервисов и применявшихся библиотеках Не учитывая те, которые были отправлены в архив или удалены. Мы постоянно пополняем список, исходя из наших идей и разумных отзывов пользователей. На текущий момент есть 72 карточки, которые только предстоит закрыть.\n\n\r\nЗа время проекта были созданы 40-80 версий практически каждого макета с итерациями разной степени сложности.\n\n\r\nВ волшебном мире собираются 15 умных людей и сразу решают, каким должен быть сайт. Но в реальной жизни сразу всё не учтешь. Эскизы сайта за это время практически не поменялись. Но мы две тысячи раз прошли по его структуре, собрали все грабли, чтобы в результате получить нужные решения.\n\r\nПо результатам мы сделали краткую презентацию принципов, на которых должен строиться новый сайт. На листах формата А3 — все основные страницы будущего сайта, описания «как, что и почему». Так, чтобы человек «со стороны» для нашей области за пять минут смог вникнуть в суть — что предлагается и почему. Описали принципы, подготовили картинки, сделали выносы с пояснениями «вот в этом месте этот принцип работает вот так».\n\r\nОчень важно, чтобы коммуникация с клиентом была оперативна и на двух сторонах были люди, принимающие решения. Администрация президента видела всё — от первых набросков ручкой на бумаге с объяснением принципиальных идей до постоянного доступа к нескольким серверам с разными версиями.\n\r\nМы многому учимся у наших клиентов.\n\nО разработке государственных сервисов и применявшихся библиотеках\r\nВ ближайшее время качество самого государства будет восприниматься в том числе через дизайн. Лояльность и к государственным организациям будет строиться по тому же принципу: удобно и быстро работать с сервисом сайта — хорошее ведомство, непонятный и некрасивый сайт — «плохое» ведомство. И именно этот факт будет важнейшим критерием развития государственных интернет-проектов.\n\r\nУже сегодня российские чиновники совсем иначе формулируют задачи, заботясь об интересах аудитории, заменяют вкусовщину на функционализм. Раньше об этом поднимал речь дизайнер, теперь на этом ставят акцент прежде всего сами заказчики.\n\r\nУ нас есть свой набор библиотек, которыми мы либо уже активно делимся, либо поделимся после того, как приведем в порядок.\n\r\nМы уже выкладывали ранее наш бэкенд-фреймворк — iktomi, — набор инструментов для фронтенда, из них самый популярные это — SVG-карты и mashaJS (Mark and Share). Мы стремимся выделять наработки и отдавать их сообществу, это помогает и нам самим упрощать их использование.\n\r\nБывает так, что некоторые разработчики даже не используют инструменты контроля версий. Мы понимаем, что множество региональных сайтов стараются быть похожими на федеральные гос-сайты. Часто это влечет неумелый перенос элементов дизайна или структуры сайтов.\n\r\nУ нас появилось стремление помогать создавать хорошие и удобные ресурсы.\n\r\nКак пример, особое внимание мы уделяем приемке кода и автоматизации поиска ошибок, использование интеграционного и модульного тестирования. Не все подрядчики следуют этому и не все заказчики выставляют такие требования. Рекомендации по приемке помогли бы заказчикам получать более качественные сайты.\n\r\nНапример: мы видели государственный проект, у которого защита от сбоев строилась за счет дублирования содержимого на пяти серверах, в случае ошибки одного из серверов запрос пересылался на второй сервер и так далее. Это снижало вероятность того, что пользователь увидит ошибку, но при этом такое количество серверов избыточно и не рационально.\n\r\nМы берем на себя задачу публиковать рекомендации, наборы примеров и принципов, которые помогут сделать государственные сайты более доступными и полезными. Сейчас мы создаем коллекцию компонентов и рекомендаций, для того, чтобы поделиться ей с сообществом.\n\r\nЭто будет сайт, на котором мы соберем рецепты по разработке и управлению, компоненты и библиотеки, которые можно повторно использовать, рекомендации и принципы проектирования дизайна сайтов различного назначения. В последствии он станет местом, где рождаются стандарты, с перфекционизмом вырабатываются паттерны, где лучшие люди дизайн-индустрии совместным трудом создают пиктографику, шрифты и так далее, где озвучиваются и решаются проблемы, а готовые решения бесплатно трансполируются на любые ресурсы, в частности, государственные.\n\r\nМы надеемся, что этот сайт объединит все доступные практики и информацию, сформирует стиль и необходимый уровень качества для других государственных интернет-ресурсов.\n\r\nБудем рады получить обновления и пожелания от других команд и их проектов.\n\r\nПожалуй, нужно было с этого начать. Большое спасибо всем ребятам, которые принимали участие в создании Kremlin.ru. Попробую перечислить тех, кого могу: Sergey Shapiro, Katrin Shapiro (coat of arms), Arthur Chafonov, Olga Romanova, Eugene and guys from the backend.", {"day": "31", "month": "августа", "time": "14:27"}, {"rate": 54, "views": 31000}], ["16 апреля приглашаем участников на Весеннюю UX-конференцию Русской Школы Сервисного Дизайна, которая снова пройдёт в офисе компании Mail.Ru Group. На UX-конференциях Школы участники обмениваются авторским опытом из сферы проектирования сервисов и услуг на базе ценностей клиентоориентированности, делятся своими UX-практиками, идеями и секретами, отвечают на вопросы.\n\r\nСреди обсуждаемых тем — клиентоориентированность как технология и базис для проектирования продуктов и сервисов, диджитал как ключевая среда взаимодействия клиентов и сервисов, клиентоориентированная организация процессов компании, современные тенденции сервисного дизайна и многое другое.\n\nПодтвержденные участники конференции:\n\n— Дмитрий Сатин, заместитель гендиректора «Национального центра информатизации», основатель компании UsabilityLab, президент российского отделения UPA.\n\n«Социально-ориентированное проектирование»\n\n— Артём Геллер, главный разработчик сайта президента РФ (Kremlin.ru), сайтов Совета Федерации, Министерства Связи, Министерства Образования; генеральный директор студии lab.AG.\n\n«Особенности проектирования государственных WEB-порталов»\n\r\nПоговорим о сервис-дизайне государственных систем c точки зрения проектирования-разработки и Едином центре экспертизы в области цифровых технологий в сотрудничестве с профессиональным сообществом и государственными ведомствами.\n\n— Мария Сташенко, партнер Лаборатории Wonderfull, куратор Британской Высшей Школы Дизайна.\n\n«Проектирование пользовательского опыта горожан»\n\n\n— Екатерина Акатова, исследователь UX-лаборатории в Mail.Ru Group.\n\n«Дистанционное тестирование»\n\r\nВы узнаете о разных способах удаленных исследований. Эта информация может быть полезна и тем, кто хочет проводить тестирования, не имея собственной лаборатории. Поговорим об удаленных модерируемых и немодерируемых тестированиях с конкретными кейсами. Обсудим инструменты, которые были задействованы для проведения исследований сайтов и мобильных приложений. Рассмотрим плюсы и минусы подобных методов, а также сложности, с которыми приходится сталкиваться в процессе дистанционных исследований.\n\n— Роман Черных, руководитель Русской Школы сервисного дизайна.\n\n«Обучение в Русской Школе сервисного дизайна»\n\r\nОбсудим, с чем сталкивается современный UX-специалист в своей профессиональной деятельности и чему он должен учиться, чтобы преодолевать возникающие препятствия. Коснёмся проблемы поиска UX-персонала, отсутствия стандартизации и проблемы различения отдельных UX-специальностей между собой. Рассмотрим возможности образования в рамках учебных проектов Школы. \n\n— Алексей Бородкин, руководитель отдела аналитики и проектирования в Notamedia.\n\n«Промышленный конь и трепетная лань: как подружить разработку и UX»\n\r\nВ этот раз поговорим о том, как широкое внедрение гибких методологий разработки на предприятиях поставило вопрос о совмещении этих подходов с обеспечением UX-ценностей выпускаемых продуктов и сервисов.\n\n— Павел Лебедев, руководитель отдела веб-дизайна в «Лаборатории Касперского».\n\n«Дизайн инфографики: секреты создания и особенности продажи»\n\r\nРечь пойдет об инфографике как средстве современного проектирования и визуализации сложных данных. \n\n— Михаил Сокольников, директор по стратегии, Сбербанк\n\n«Дизайн-мышление в финтехе: вызовы и лучшие практики»\n\r\nДоклад о том, что такое дизайн-мышление в применении к платежно-финансовым сервисам, какие вызовы стоят перед этой индустрией, и с какими сложностями сталкивается внедрение этой технологии мышления и проектирования в реальности.\n\r\nУчастие бесплатное, но необходимо зарегистрироваться.\n\r\nДля тех, кто не сможет присутствовать лично, будет организована онлайн-трансляция.", {"day": "4", "month": "апреля", "time": "16:28"}, {"rate": 12, "views": 3200}], ["Уже пять лет я публикую регулярные обзоры свежих статей по теме интерфейсов, новых инструментов и коллекций паттернов, интересных кейсов и исторических рассказов. Из лент нескольких сотен тематических подписок отбирается примерно 5% стоящих публикаций, которыми интересно поделиться. Предыдущие материалы: апрель 2010-ноябрь 2015.\n\n\n\nПаттерны и Best Practices\nI Analyzed 250 SaaS Pricing Pages — Here’s What I Found\r\nBenjamin Brandall прошелся по страницам тарифов 250 облачных сервисов и выписал основные подходы к их созданию. Особенность продаж крупному бизнесу — это личные переговоры по условиям, поэтому многие вообще не указывают цену на сайте.\n\n\n\nGoodUI Evidence\r\nАвторы проекта GoodUI добавили отличный дашборд с примерами от читателей, показывающий насколько помогли конкретные техники повышения конверсии. Это простые примеры и описания, работающие еще и как набор эвристик, а теперь еще и с подтверждением эффективности.\n\n\n\n«Touch Keyboard» Implementations Have Improved Just 9% Since 2013 (60% Still Get it Wrong)\r\nBaymard Institute актуализировали своё большое исследования мобильных интернет-магазинов, посвященное методам ввода. Она описывает идеальное поведение клавиатуры телефона в зависимости от вводимых данных. Прогресс за два года крайне незначительный — суммарное улучшение юзабилити на 9%.\n\n\n\r\nЕще немного свежего от Baymard:\n\nВ дополнение к этому они запустили шпаргалку по полям ввода на мобильных, включающую примеры кода.\nИсследование интерфейсов оформления заказа на мобильных.\n\n\nПисьма рассылки\n\nZurb скоро запустит вторую версию своего фреймворка Foundation for Email. Ранее он назывался Ink.\nLauren Smith разбирает десять важных изменений на рынке почтовых клиентов и их влияние на дизайнеров почтовых рассылок.\n\n\n\n\nОформление ссылок\n\nЕще один материал на тему того, почему плохо использовать ссылки типа «далее».\n\n\n\n\nИконка бургера\n\nПивное меню.\n\n\n\n\nГайдлайны платформ и компаний\nBBC GEL\n\nДизайн-команда BBC работает над новым поколением GEL.\n\n\n\n\nApple iOS 9\n\nLuke Wroblewski наглядно показал, насколько сложнее стал процесс первоначальной настройки iPhone.\nTyler Howarth из команды Medium собрал шпаргалку по размерам областей для отображения интерфейсов на iPhone и iPad — полноэкранные и в рамках панелей многозадачности.\nШаблоны iPhone 6 для Photoshop.\n\n\n\n\nMaterial Design\n\nРазмышления Paco Soria по мотивам появления нижней панели в Google+ на тему того, насколько допустимо нарушать гайдлайны платформ.\n\n\nШаблоны Android-телефонов\n\nШаблон Huawei P8 в PSD от Claudio Guglieri.\n\n\n\n\nApple Watch\n\nШаблоны WatchOS 2 для Sketch.\n\n\nПринципы дизайна\n\nПринципы хорошего дизайна от Julie Zhuo из Facebook.\n\n\nЕдиный язык анимации\n\nСтатья Donovan Hutchinson на тему описания языка анимации и гайдлайнов для нее. Объясняет необходимость и предлагает свою категоризацию.\n\n\n\n\nДизайн государственных систем\r\nAIC, Лаборатория Артема Геллера и SmartTeleMax положили начало открытой и планомерной работе над радикальным улучшением представления государства и государственных сервисов в сети. В блоге уже несколько публикаций с полезными шаблонами.\n\n\n\nПонимание пользователя\nLarge-Scale Image Memorability\r\nИнтересное исследование MIT о том, что значит хорошая, запоминающаяся иллюстрация. Они дают инструмент и API для проверки картинок на запоминаемость. Небольшой обзор.\n\n\n\nU mad bro? Researchers measure emotion with your mouse clicks\r\nИнтересное исследование — Brigham Young University изучили перемещение курсора мыши и клики, для того чтобы определять эмоции пользователя. Выяснили, что люди в разозленном состоянии делают все менее точно.\n\n\n\nСкорость работы интерфейсов\n\nТретья часть статьи Дениса Мишунова о скорости работы интерфейсов. Он приводит 10 принципов из психологии, влияющих на восприятие времени, и дает советы по обработке каждого из них в интерфейсе.\n\n\n\n\nMicro-moments — Are you designing for them?\r\nMuriel Garreta Domingo о том, как использовать идею микро-моментов от Google на практике. В статье есть интереснейшая отсылка на исследование одного из ресторанов, который сравнил записи камер наблюдения 2004 и 2014 года — телефоны затягивают процесс в два раза.\n\n\n\nHow to Train Your Human — Designing for Healthier Habits\r\nЕще один толковый материал на тему модели вовлеченности пользователя Nir Eyal.\n\n\n\nJobs-to-be-Done\n\nLuke Wroblewski был на выступление Bob Moesta, автора концепции jobs to be done. Он законспектировал основные тезисы рассказа.\n\n\nДизайн для детей\n\nАмериканская академия педиатрии провела серию исследований и говорит о том, что планшеты младенцам использовать можно, хотя и с осторожностью. Это просто часть современного окружения дома, продолжение аналогового мира.\n\n\nИнформационная архитектура, концептуальное проектирование, контент-стратегия\nAvi Parush — Conceptual Design for Interactive Systems, 1st Edition\r\nВышла книга Avi Parush «Conceptual Design for Interactive Systems», посвященная концептуальным моделям в проектировании интерфейсов и вообще высокоуровневому проектированию. UXMatters публикует главу № 9 из нее.\n\nПроектирование и дизайн экранов интерфейса\n\nAdobe CC 2015\n\nНоябрьское обновление Photoshop CC 2015. Улучшенные артборды, экспорт в SVG, развитие тач-интерфейса и библиотек Creative Cloud.\n\n\n\n\nFigma — The collaborative interface design tool\r\nОдин из самых интересных инструментов прототипирования, появившихся за последнее время. Это Google Docs для дизайнеров — несколько человек могут работать над интерфейсом одновременно. Небольшой анонс от авторов. Еще немного о нем:\n\nFast Co Design поговорил с Dylan Field и Evan Wallace, создателями инструмента.\nО подходе инструмента к работе с сетками.\n\n\n\n\nAdobe Comet\n\nСвежие новости про инструмент. Открылась запись на бета-версию — нужно пройти небольшой опрос. Правда, изначально будет доступно только для Мака.\nЧто войдет в бета-версию и первые обновления после нее.\n\n\n\n\nKoncept — Usability testing on real users & High-fidelity application prototypes\r\nНовый инструмент Koncept пробует совместить возможности прототипирования и юзабилити-тестирования из коробки. Про то, что происходит с прототипом после создания, много говорилось на панельной дискуссии конференции Google SPAN — это одно из главных направлений развития.\n\n\n\nTumult Hype Pro\n\nВышла версия Hype 3.5. И тут же вышла обучающая книга.\n\n\n\n\nPixate\n\nВышла Pixate Studio 2.0. Ускорение работы, возможность использования видео и аудио, много доработок по интерфейсу. А ведь еще на днях ходил слух, что инструмент свернули, но в итоге вышло гораздо лучше чем с Form, который не обновляли год.\n\n\n\n\nMarvel\n\nАвторы анонсировали Canvas, новое поколение инструмента с возможностью дизайна и анимации прямо внутри сервиса.\nПодробнейшее пошаговое руководство по созданию прототипа в Marvel от Marc Andrew (перевод). В первой части статьи такой же разбор создания исходных макетов в Sketch. \n\n\n\n\nSketch\n\nSketch уходит из AppStore и будет распространяться и обновляться с сайта Bohemian Coding.\nПлагин для синхронизации стилей между несколькими дизайнерами.\nПлагин быстро вставляет в макет фото из стока Unsplash.\nПеревод полного руководства по дизайну iOS 9 в Sketch от Meng To.\n\n\nUXPin\n\nUXPin вот-вот выпустит обновленную версию.\n\n\n\n\nГенераторы аватаров и имен\n\nАватары из ’80х и ’90х.\n\n\nОбзоры и сравнения инструментов прототипирования\n\nCarol Liao сделала очень грамотное сравнение семи популярных инструментов прототипирования и анимации по разным типам задач. InVision, Pixate, Principle, Form, Origami, Framer, Xcode.\n\n\n\n\nAtomic\n\nШаблон для Material Design.\n\n\nHolding Off on High Fidelity\r\nПамятка команды Salesforce по постепенному повышению степени проработки дизайна от скетчей к интерактивным прототипам.\n\n\n\nИнструменты паблишинга\n\nTilda переработала инструменты работы с формами и в целом инструментами сбора и выгрузки данных.\n\n\n\n\nFlawless App\n\nСоздатели Flawless сняли демо продукта накануне запуска.\n\n\n\nПользовательские исследования и тестирование, аналитика\nUncovering user goals with the Episodic Interview\r\nПамятка David Travis из UserFocus по проведению пользовательских интервью вне реального контекста респондентов.\n\nЭкспертная оценка\n\nJeff Sauro приводит слова Rolf Molich, соавтора методики эвристической оценки, о том что нужно различать ее и просто экспертную оценку.\n\n\nApps Force\r\nЕще один сервис удаленного юзабилити-тестирования. Веб, мобильный веб, приложения.\n\n\n\nA Guide To Simple And Painless Mobile User Testing\r\nНебольшая инструкция от Colman Walsh по мобильному тестированию при помощи Reflector.\n\nВизуальное программирование и дизайн в браузере\n\nCan You Code This UI Concept?\r\nВ последнее время все чаще концепты с Dribbble и Behance превращаются в реальные скрипты на CodePen и других ресурсах с примерами кода. Блог MaterialUp собрал пять таких штук. Аналогичные примеры:\n\nУчастник Russian Design Cup 2015 Павел Лаптев собрал анимацию своего решения. И еще одна анимация от него — появление меню с помощью СSS3 и библиотеки GSAP.\n\n\r\nSee the Pen Pull Down to Refresh (Paper Plane) by Nikolay Talanov (@suez) on CodePen.\n\n\nAnimation in Responsive Design\r\nVal Head поднимает еще один важный вопрос про анимацию в вебе — ее работу в адаптивном дизайне. Она описывает два основных подхода — пересмотр логики работы анимации для разных контекстов и перестановка блоков с новыми триггерами.\n\n\n\nЖивые гайдлайны и компонентные системы\n\nЕще немного о том, как создавался CSS-фреймворк Solid от BuzzFeed.\n\n\nНовые скрипты\n\nБиблиотека Jump.js для мягкой прокрутки.\nОтличный сайт, показывающий возможности современных браузеров и доступность конкретных в текущем.\nКак CSS-функция calc() может заменять часть работы препроцессоров.\nСпособы стилизации слайдеров в формах.\nАнимированная навигация по карте для лонг-ридов.\nОбновился JSFiddle.\nКак сделать правильные вкладки в интерфейсе и не облажаться.\n\n\nForm\n\nВышел Form 1.4.\n\n\n\n\nFramer\n\nУпрощенный импорт из Sketch.\n\n\nWebflow\n\nРасширенные возможности по созданию 3D-трансормаций при анимации сайтов.\n\n\n\n\nВеб-типографика\n\nTim Brown из Typekit разбирает малоизвестные свойства шрифтов OpenType и свойства CSS для управления ими.\n\n\nРабота с цветом\n\nБиблиотека Colorify позволяет извлекать основной цвет изображения для создания заглушек при загрузке.\n\n\nРабота с SVG\n\nИстория развития формата SVG и интереса отрасли к нему.\nАнимация с использованием масок.\nАльтернативы спецификации SMIL для анимации SVG, которая уходит в небытие.\nКарты России и мира в SVG от команды Дизайна государственных систем.\n\n\nСетки\n\nСупер-компактная по размеру система сеток Gridly.\nRachel Andrew сравнивает CSS Grid и Flexbox.\nСравнение Flexbox и Susy от Zell Liew.\n\n\nFlexbox\n\nОнлайн-игра Flexbox Froggy для обучения работе с flexbox.\nHeydon Pickering о том, как избавиться от одного элемента в последней строке.\n\n\nThe Unluckiest Paragraphs\r\nNick Santos из команды Medium о том, как блокировщики рекламы могут по ошибке вырезать куски интерфейса. Он делится опытом по поводу того, как избегать проблем.\n\nИконочные шрифты\n\nBen Frain полемизирует с Tyler Sticka и говорит, что во многих ситуациях иконочные шрифты удобнее SVG, а проблемы accessibility решаемы.\n\n\nAn Introduction To PostCSS\r\nРассказ Drew Minns о PostCSS, альтернативе пре-процессорам для расширения возможностей базового CSS с помощью JavaScript.\n\nUX-стратегия и менеджмент\nJamie Levy — UX Strategy\r\nO’Reilly выпустили книгу Jamie Levy «UX Strategy — How to Devise Innovative Digital Products that People Want». UXMatters публикует кусок второй главы. В декабре также вышла «Design Leadership» от Richard Banfield.\n\nHow mature is your omni-channel content strategy?\r\nPeter Bogaards предлагает модель зрелости для контент-стратегии. Отличный системный подход, позволяющий оценить текущую ситуацию и спланировать развитие.\n\n\n\nПостроение дизайн-культуры\n\nMarcin Wichary о том, как работается в Medium. Процесс, культура, задачи.\n\n\nGetting Back Into The (Right) Deliverables Business\r\nRian van der Merwe пишет о том, что маятник всеобщего отказа от документации и проектных артефактов должен качнуться в обратную сторону — вместо сокращения действительно избыточных спецификаций многие и вовсе прекратили предпроектную работу. Он предлагает два документа, которые позволяют соблюдать баланс — расширенные customer journey maps и структура контента.\n\n\n\nПродуктовый менеджмент и аналитика\nThe Next Feature Fallacy (or, the case for simple, working systems)\r\nJoshua Porter рассказывает о проблеме ложного ожидания новой «функции, которая спасет продукт». Вместо того чтобы обратить внимание на проблемы в ключевых механиках работы сервиса, менеджеры продукта и дизайнеры верят в спасительную силу «вот этой вот недостающей возможности». Он советует концентрироваться на простых работающих системах (чуть подробнее о том, что он под этим понимает).\n\n\n\nДорожные карты\n\nJared Spool предлагает понятие «тем» для дорожных карт. Они фокусируют команду не на функциональности, а на проблемах пользователей, которые можно решить.\n\n\nIntercom on Customer Support book\r\nТретья книга команды Intercom, посвященная поддержке пользователей.\n\n\n\nМетодологии, процедуры, стандарты\nСпециалист по дизайну графических и пользовательских интерфейсов\r\nУтвержден профессиональный стандарт «Специалист по дизайну графических и пользовательских интерфейсов». Наша профессия стала намного взрослее.\n\n\n\nАнонс говорит:\n\nВ функции данных специалистов входит проектирование, графический дизайн и юзабилити-исследование интерактивных пользовательских интерфейсов, обеспечивающих высокие эксплуатационные (эргономические) характеристики программных продуктов и систем.\n\r\nТребования к образованию по данной профессии: среднее профессиональное образование — программы подготовки квалифицированных рабочих (служащих), либо высшее образование — бакалавриат, специалитет, магистратура. Дополнительное профессиональное образование — программы повышения квалификации, программы профессиональной переподготовки, программы повышения квалификации.\n\r\nПредъявляются также требования к опыту практической работы в соответствующей сфере деятельности.\n\nКейсы\nКейсы редизайна\n\nРассказ о том, как делался редизайн дашборда Xbox One.\nО работе над интерфейсом приложения Uber для водителей.\n\n\n\n\nPrototyping Secret Hitler\r\nРассказ Max Temkin о работе над карточной игрой Secret Hitler. Она не совсем по теме блога, но в ней собрана интереснейшая подборка прототипов многих известных карточных игр — очень полезно.\n\n\n\nИстория\noldweb.today\r\nЭмулятор винтажного интернета, позволяющий увидеть архивные сайты в ретро-браузерах. Правда, серверные мощности у них слабые, работает с задержками.\n\n\n\r\nРассказы о старых сайтах:\n\n20 декабря исполнилось 25 лет первому сайту от Тима-Бернеса Ли.\nНовогодние сайты, приложения и иллюстрации 80х и 90х.\nПодборка старых сайтов от The Telegraph.\n\n\nProceed to Checkout: The Unexpected Story of How Ecommerce Started\r\nShopify сняли видео, рассказывающее об истории появления электронной коммерции. Основных варианта два и оба из 1994 года — Pizza Hut и сайт NetMarket, продавший компакт-диск Стинга. Статья Fast Company с материалом в текстовом виде.\n\nИ еще одна интересная статья Fast Company об истоках интернета. В ’80х-’90х годах в США были дичайше популярны телефонные услуги на базе номеров 1-900, позволявшие получать короткие новости от звезд (пре-Твиттер), слушать свежую музыку (пре-Spotify) и иметь легкий доступ к куче другой полезной информации, труднодоступной в доинтернетовские времена. Погубило все, как обычно, порно.\n\n\n\nИстория Ralph Baer\n\nО том, как Ralph Baer начал свою карьеру.\n\n\nТренды\nТренды 2016 года\r\nКураторы сайта uxdesign.cc проанализировали все ссылки, опубликованные за год, и составили прогноз на 2016. Очень грамотный и взвешенный материал, и что самое приятное — от людей, которые действительно разбираются в интерфейсах, а не только визуале. Другие прогнозы:\n\nПрогноз на 2016 год от J. Walter Thompson Intelligence.\nИтоги года от создателей инструмента Atomic, которые пытаются угнаться за контент-маркетингом InVision.\nПрогнозы специалистов отрасли, собранные Econsultancy.\n10 прогнозов от Fjord. Они же в виде презентации и статьи.\nПрогноз от frog design.\n\n\n\n\nWhy The Great App Unbundling Trend Is Already In Trouble\r\nFast Company пишет о том, что тренд отпочковывания не особо взлетел. Недавно закрылись Carousel и Mailbox от Dropbox, а также экспериментальные приложения Фейсбука. При этом дико популярным оказался новый мобильный Outlook, представляющий из себя тот самый классический лютый универсальный комбайн. Хотя речь идет скорее о бездумном клепании сателлитов — тому же Foursquare это пошло на пользу, хорошо идет и Facebook Messenger.\n\n\n\r\nВдогонку — толковые мысли Sebastien Gabriel о закрытии Mailbox, Carousel, Rooms и других приложений, которые считались хорошим примером качественного дизайна. Это отрезвляет тех, кто считает, что качественного UX достаточно для успеха продукта (та же история была с Path) — это важная, но не ключевая часть.\n\nMicrosoft Future Visions\r\nMicrosoft запустил мини-сайт Future Visions, посвященный видению будущего. Это серия рассказов от фантастов, размышляющих о будущем технологий. Они взяли за основу наработки исследовательской лаборатории Microsoft и пофантазировали на их тему. При этом забавно, что многие из этих технологий сами вдохновлялись научной фантастикой. Обзор основных тем.\n\n\n\nThe New Story Of Computing: Invisible And Smarter Than You\r\nЕще один термин в дополнение к «NoUI», «anticipatory computing» и «Zero UI» — Cognitive Computing. Суть примерно похожая — меньше ручного управления, больше перекладывания всего на плечи компьютеров.\n\n\n\nТренды в СМИ\n\nРассказ о редизайне Quartz, который подтверждает постепенное умирание главных страниц СМИ.\nGoogle News Lab теперь занимается ежегодным отчетом компании о поисковых трендах. Они описали ключевые выводы для СМИ из особенностей поведения пользователей и потреблениями ими контента.\n\n\n\n\nАвтомобильные интерфейсы\n\nНебольшой обзор конференции Connected Car Expo, проходившей недавно в Лос-Анджелесе с точки зрения внимания к интерфейсам.\nКонцепт от Volvo, который представляет совсем далекое будущее автономных машин, где они потеряли свое статусное значение. Просто зеркальный куб.\n\n\n\n\nУмные часы и браслеты\n\nLuke Wroblewski собрал в Google+ свои мысли и твиты на тему умных часов. Там есть и другие его подборки. \nОчень интересное исследование группы шведских ученых на тему использования умных часов в реальной жизни. Они выбрали 12 респондентов, которые долгое время ходили с Apple Watch и камерой, которая записывала все взаимодействия с часами. Насчет репрезентативности сказать сложно, но есть много интересных фактов.\n\n\n\n\nВиртуальная реальность\n\nКоллекция экспериментов с анимацией в виртуальной реальности для Google Cardboard.\nФреймворк A-Frame для создания простых интерфейсов виртуальной реальности в вебе. Поддержан инициативой MozVR от Mozilla, анонсированной недавно.\nLaura Keller о UX журналистики в виртуальной реальности на примере материала NY Times о беженцах.\n\n\n\n\nИнтерфейсы в кино\n\nВсе 169 гаджетов из фильмов о Джеймсе Бонде. \nРассказ о компании Perception, которая делала интерфейсы к Iron Man 2, Avengers 2 и другим фильмам, а после этого подключилась к работе над концептами для Microsoft, Samsung и Ford.\n\n\n\nMicrosoft HoloLens\n\nAutodesk и Microsoft работают над инструментами для связки инженеров и пром.дизайнеров на базе Hololens.\nVolvo рассказывает о том как использует HoloLens в работе.\n\n\n\nДля общего и профессионального развития\nБюллетень «Эргономист» № 43 (декабрь 2015)\r\nВ номере: статьи о доступности метро для маломобильных пассажиров, об эргономических мероприятиях 2015 года, о Владимире Михайловиче Мунипове и его вкладе в эргономику, новости, аннотации публикаций на эргономическую тематику, удачный опыт и эргономические диверсии и многое другое.\n\nTilda Education\n\nМатериал Ярослава Шуваева о психофизиологии интерфейсов.\n\n\n\n\nПродуктовые дизайнеры\n\nКак Meagan Fisher перешла из маркетинговых дизайнеров в продуктовые и что пришлось изменить в своей работе.\n\n\nЛюди и компании в отрасли\n\nDesigning Women\r\nСерия интервью Fast Co Design с женщинами в дизайне. Вышло уже 4 материала про дизайн-лидеров.\n\n\n\nДизайнеры в венчурных фондах\n\nAccel Partners наняли Jason Mayden из Nike. Он рассказывает о том, что будет искать молодых специалистов в нетипичных местах.\n\n\nИван Пупырев\n\nНовое интервью для Афиши.Воздух про проект Jacquard.\n\n\n\n\nСвежие ссылки можно также отслеживать в одноименной Facebook-группе или получать раз в месяц по почте. Спасибо всем, кто также публикует ссылки в ней, особенно Геннадию Драгуну, Павлу Скрипкину, Дмитрию Подлужному, Антону Артемову, Денису Ефремову, Алексею Копылову, Тарасу Бризицкому и Евгению Соколову. Все больше материалов в обзорах появляется благодаря им.\n\nПодписывайтесь на рассылку! Письмо приходит один раз в месяц.", {"day": "28", "month": "декабря", "time": "10:38"}, {"rate": 9, "views": 10000}], ["Уже пять лет я публикую регулярные обзоры свежих статей по теме интерфейсов, новых инструментов и коллекций паттернов, интересных кейсов и исторических рассказов. Из лент нескольких сотен тематических подписок отбирается примерно 5% стоящих публикаций, которыми интересно поделиться. Предыдущие материалы: апрель 2010-июль 2015.\n\n\n\nПаттерны и Best Practices\nHow to Use Photography in Branding\r\nОчень толковая статья Loren Baxter об использовании фотографий в интерфейсе для усиления бренда. Он приводит яркие примеры и дает инструкцию по поиску своей стилистики.\n\n\n\nАдаптация для больших экранов\n\nРекомендации Baymard Institute по адаптации дизайна интернет-магазинов к большим мониторам. Их процент все больше и уже пора обратить внимание на этих пользователей.\n\n\n\n\nБольшие сенсорные экраны\n\nKara Pernice из NN/g продолжает тему работы с большими сенсорными экранами. Она взяла интервью у Dorothy Shamonsky из ViewPoint, которая специализируется на таких интерфейсах. Часть советов капитанские, но подборка полезная.\n\n\nПочтовая рассылка\n\nKevin Mandeville из Litmus с еще одной крышесносной историей о возможностях писем рассылки. Они разыгрывали 5 билетов на свою конференцию и вот что из этого получилось.\nКоманда Медузы рассказывает о том, как они работают с почтовыми рассылками.\n\n\nВоспринимаемая скорость интерфейса\n\nЭксперименты с различными загрузчиками от стажера Viget. Ian Tate сравнивает несколько вариантов анимации и смотрит, насколько пользователи готовы ждать загрузки интерфейса.\nХорошо структурированный набор советов на тему от Adrian Zumbrunnen.\n\n\nКоллекции интерфейсной анимации\n\nUI Movement, еще одна коллекция.\n\n\nРабота с уведомлениями\n\nСоздатели приложения Hopper сделали несколько подходов к запросу на отправку уведомлений пользователям и вот что из этого получилось.\n\n\nГайдлайны платформ и шаблоны дизайна для них\nMailChimp Content Style Guide\r\nMailChimp собрал хорошее всеобъемлющее стилистическое руководство для работников компании. Раньше это были разрозненные гайдлайны, но теперь они сведены в один.\n\n\n\nHP Grommet\r\nGrommet, UX-фреймворк для корпоративных приложений от HP.\n\n\n\nПонимание пользователя\nDesigning Web Interfaces For Kids\r\nОчень толковый обзор особенностей дизайна для детей разных возрастов от Trine Falbe. В каждом из периодов развития свои когнитивные и физические способности, что сильно влияет на оптимальный интерфейс.\n\nMicro-Moments\r\nGoogle выпустил новый сайт про микромоменты — мелкие спонтанные сценарии, которые инициируют пользователи на мобильных устройствах.\n\n\n\nИнформационная архитектура, концептуальное проектирование, контент-стратегия\nContent Wireframing for Responsive Design\r\nНовая книга UXPin про прототипирование для адаптивного дизайна на уровне контента.\n\nПроектирование и дизайн экранов интерфейса\nRussian Prototyping Club\r\nАнтон Карташов создал группу про Origami, Framer.js, Pixate и другие современные дизайн-инструменты. Практические вопросы по конкретным задачам, решение проблем, руководства для начинающих.\n\n\n\nКуда двигаются инструменты прототипирования\n\nJulius Huijnk опросил создателей и руководителей ключевых инструментов прототипирования (Axure, InVision, Marvel, Proto.io, UXPin) на тему их будущего и возможности создания универсального продукта. Он представлял себе некий универсальный сервис для абсолютно всех задач в процессе работы над дизайном продуктов, но по факту затея не очень здравая — дизайн-процессы сильно различаются от компании к компании, от проекта к проекту. Полезный материал для тех, кто мечтает создать такого монстра.\nKhoi Vinh размышляет о том, куда идет рынок инструментов прототипирования.\n\n\nPrinciple\r\nИнструмент вышел: стоимость несколько выше ожиданий, но доступна пробная версия. По видео-ролику выглядит довольно приятно — есть много мелочей, который отсутствуют в Pixate и плохо реализованы в Proto.io. Подробнее:\n\nПервая реакция практикующего русского комьюнити на Principle. Покоряет с первых минут, инструмент и правда очень крутой. Особенно с учетом того, что это самая первая версия.\nСоздатели говорят, что можно воссоздать ключевые взаимодействия Facebook Paper за 60 секунд. Видео, правда, показывает результат, а не процесс, но коллеги начали активно экспериментировать с инструментом и скорость работы в нем действительно большая.\nОбзор возможностей Principle от Benjamin Berger. Он получил раннюю версию еще месяц назад и успел много поработать с ней. В его блоге я и увидел косвенное упоминание продукта в конце июля.\n\n\n\n\nFlinto\n\nFlinto переродился и выпустил инструмент для работы с прототипами и анимацией для Mac, похожий на недавний Principle. Гонка инструментов не утихает!\n\n\n\n\nFive app prototyping tools compared — Proto.io, Pixate, Origami, Framer & Form\r\nОчень крутой подход к сравнению современных инструментов прототипирования. Tes Mat пытается собрать в них один и тот же интерфейс и описывает плюсы и минусы Proto.io, Pixate, Origami, Framer и Form.\n\nInVision\n\nВслед за Marvel, в сторону юзабилити-тестирования прототипов пошел и InVision. Они сделали связку с Lookback.\nNow, еще один UI Kit от InVision. Есть версии для Sketch и Photoshop.\nПоявилась возможность создавать «доски» для мудбордов, гайдлайнов и презентаций.\n\n\nSketch\n\nПлагин для переключения состояний от evilmartians.\n\n\nПрототипирование в Keynote\n\nНеплохой обзорный материал о том, как анимировать интерфейсы в Keynote.\nИ еще один — о том, как анимировать макеты из Sketch.\n\n\nПользовательские исследования и тестирование, аналитика\n32 Ways To Measure The Customer Experience\r\nОтличная классификация методов пользовательских исследований от Jeff Sauro в привязке к конкретным задачам.\n\n\n\nComparing Between- and Within-Subjects Studies\r\nJeff Sauro о пользовательских исследованиях, где разные задания даются одним и тем же, либо совсем разным респондентам. В конце он сравнивает плюсы и минусы этих вариантов. Первый дешевле, второй дает меньше помех.\n\nВизуальное программирование и дизайн в браузере\nWebKit Visual Styles Sidebar\r\nWebKit внедряет наглядный визуальный редактор стилей страницы. Помимо стандартной панели с кодом, добавилась вкладка в духе графических редакторов, где можно явно задать основные параметры оформления — почти как в Sketch или Photoshop. Очень круто, ждем такую же штуку в Chrome.\n\nCSS is complicated. Web Inspector’s new Visual Styles sidebar can help you perfect a design — now in the nightly. pic.twitter.com/ucS5BUkO6Q— WebKit (@webkit) 20 августа 2015\n\n\nSalesForce Lightning Design System\r\nДизайн-система Lightning компании Salesforce. Немного о том, как она делалась.\n\n\n\nРабота с Bootstrap и Foundation\n\nВышла первая альфа-версия Bootstrap 4. В блоге проекта внушительный список изменений. Помимо этого, запущен официальный каталог тем оформления. \n\n\n\n\nEasee\r\nИ еще один новый инструмент для дизайнеров Easee. Он позволяет делать анимацию в браузере. Небольшой рассказ его создателя Steven Fabre о том, как и зачем он его сделал.\n\n\n\nFramer\n\nTes Mat пишет книгу о Framer.\nСессия вопросов и ответов с Koen Bok, создателем Framer.\n\n\nWebflow CMS\r\nWebflow запускает свою CMS: пока не все ясно, но выглядит интригующе. Практически визуальное создание динамичного адаптивного сайта с кучей технически сложных элементов.\n\n\n\nРабота с Flexbox\n\n20-минутный видео-курс по flexbox.\nОчень простое и понятное объяснение основных принципов flexbox от Ben Gremillion из ZURB. Кстати, следующая версия фреймворка Foundation будет использовать его.\n\n\nВеб-типографика\n\nBram Stein из Typekit рассказывает о своем видении будущего веб-шрифтов. Очень здорово о технологическом развитии веб-типографики из первых рук.\nЕще один поисковик-подборщик по базе Google Web Fonts.\nБиблиотека-типограф на JavaScript.\n\n\nНовые скрипты\n\nКоллекция разного рода визуализаций и интерактивных концептов.\nПолигональный кот в догонку к полигональному динозавру.\nWebGL Studio для работы с 3D-сценами в вебе.\nЗарождается интересный продукт, реализующий двухстороннее взаимодействие между кодом и результатом (пока упор на графику).\nИнструмент для рисования циклоид, несколько вариантов, настраиваемые параметры, эскпорт результата.\n\n\nРежимы наложения слоев в браузере\n\nЕще один обзор возможностей CSS-фильтров, от Vincent De Oliveira.\n\n\nУправление интерфейсными проектами, процессами и командами\nApplied UX Strategy, Part 3: Platform Thinking\r\nМоя статья о платформенном мышлении на основе недавней презентации. Как перестать плодить документацию и начать жить. Все это сжигает уйму времени на бумагомарательство — силы уходят на полировку побочных документов, а не продукта. Нужно воспринимать работу над продуктом как создание и развитие платформы, а не конкретный релиз. Русскоязычная версия.\n\n\n\r\nЯ рассказывал об этом на Smashing Magazine (мобильный веб и контент-проекты). Но там был упор на конкретные кейсы, а в этой публикации — пошаговая инструкция по созданию такой платформы.\n\r\nВ конце идет длинный список всех тех, благодаря кому эта картина выстроилась в единое целое и начала внедряться на практике. Изначальная идея была простой, первый прототип платформы появился в середине 2012 года. Но по мере перевода все большего количества сервисов на нее видение корректировалось и расширялось. У нас огромное количество продуктов и вопросов по каждому из них, так что мы еще в пути. Поэтому серия будет продолжаться :)\n\nUX-стратегия\n\nPaul Bryan хорошо описывает свое видение UX-стратегии. У нее 7 ключевых составляющих: связка с бизнес-стратегией, модель клиента, карта experience, сравнительные исследования и отчеты, общий план внедрения стратегии и roadmap.\n\n\nДизайн-культура\n\nJon Kolko пишет в Harvard Business Review о том, как большим корпорациям привить дизайн-культуру.\nОчень крутая идея Nick Daze по подбору дизайнеров в команду с учетом необходимых навыков. Используется лепестковая диаграмма, которая показывает сильные и слабые стороны как отдельного сотрудника, так и всей команды.\n\n\n\n\nНайм дизайнеров\n\nTom Petty о том, как компания GoCardless строит процесс найма дизайнеров.\n\n\nDesign Sprints\n\nКак команда The Guardian использует формат дизайн-спринтов.\n\n\nGetting Started With UX Design Process & Documentation\r\nЕще одна книга UXPin, о построении дизайн-процесса и работе с документацией.\n\nThe Designer’s Guide to Collaborating With Developers\r\nИ еще одна — о взаимодействии дизайнеров и разработчиков.\n\nPresumptive Design — Design Research Through the Looking Glass\r\nLeo Frishberg и Charles Lambdin предлагают свою вариацию на тему lean UX. Не особо осмысленное отпочковывание с основным мотивом создания «нас не понимают», но в копилку терминологии полезно.\n\nПродуктовый менеджмент и аналитика\nТехника пикапа — Как создать продукт и покорить пользователей\r\nНа летней программе института Стрелка и Rambler & Co выступил Rahul Sen из Spotify, занимающийся вопросами роста пользовательской базы и прибыли. У него достаточно интересная концепция выстраивания работы с пользователем как личных взаимоотношений. В этой статье, правда, совсем общий обзор, чуть больше деталей было в англоязычной версии. Хотя самое интересное осталось в самой презентации и, видимо, тренинге. В том числе об их модели метрик AACR (Acquisition, Activation, Conversion, Retention) и ее провязке в интерфейсе.\n\n\n\nDesign x Data\r\nIDEO запустили блог на Medium, посвященный использованию данных и аналитики в дизайне. Пока, правда, всего пара публикаций.\n\nКейсы\nFrom Russia With Love — Behind The Responsive Redesign Of Kremlin.ru\r\nАртем Геллер отвечает на вопросы Smashing Magazine о работе над новым сайтом Kremlin.ru. Насыщенная статья, в которой много интересных технических деталей. Это первый российский государственный проект «на страницах» подобного издания.\nВерсия на русском.\n\n\n\nAlcatel Watch UX\r\nШикарнейший кейс Дениса Невожая про работу над интерфейсом умных часов One Touch Watch от Alcatel. Во всех деталях показаны итерации дизайна, рассказано о первоначальных задумках и конечной реализации. Это собственная платформа Alcatel, так что поиск решений особенно интересен.\n\n\n\nХосейн Рахман: Как в Jawbone проектируют hardware-продукты\r\nОчень мощный кейс от команды Jawbone, охватывающий все нюансы продуктовой работы. Вторая часть.\n\n\n\nBlurring Is the Auto-Tune of UI Design, and Other Things We Thought About While Designing Wildcard 2.0\r\nKhoi Vinh рассказывает о работе над новостным приложением Wildcard, для которого он делал достаточно глубокое исследование о карточных интерфейсах. Правда, изначально они планировали запускать мобильный браузер, но он не взлетел и наработки отдали для более простой недели. Приложение вышло недавно и это одна из самых эффектных штук на iOS в этом году.\n\n\n\nКейсы редизайна\n\nОтличная и эффектно поданная история редизайна тематического новостного сайта The Hechinger Report. Интересно, что дизайнеры осознавали объективную реальность и отдельно думали о том, как красиво подавать контент для издания, где фотографий зачастую нет.\nНебольшой рассказ о том, как Vox Media работает над своими лонг-ридами.\nАлександр Комаров рассказывает о том, как его команда работала над приложением для координации часовых поясов.\n\n\nДизайн в Samsung\n\nКомпанию часто пинают в дизайнерском сообществе, а между тем они сделали много действительно крутых вещей. Очень толковая статья о том, как компания изменила отношение к дизайну и роли вице-президента по дизайну An Yong-Il в этом.\n\n\nИстория\n50 years ago today the word «hypertext» was introduced\r\nИнтервью с Ted Nelson, автором идеи гипертекста. Он в деталях рассказывает о том, как пришел к этой идее, как 50 лет назад проходила ее легендарная презентация и что из всего этого получилось.\n\n\n\nВеб ’90х\n\nМощный материал The Rolling Stone о том, как создавался легендарный сайт фильма Space Jam и как вообще киноиндустрия пришла в интернет.\n\n\n\n\nТренды\nThe Post-Mac Interface\r\nОчень длинный, но очень интересный текст об истории развитии GUI от Adam Baker. Он вспоминает концепцию интерфейса Anti-Mac от Jakob Nielsen и D. Gentner 1996 года, в которой они пытались переосмыслить классический интерфейс Mac с учетом появления интернета. Что-то из их предсказаний сбылось, что-то нет и Адам предлагает свое видение Post-Mac.\n\n\n\nTrends in Newsrooms — Gaming the news\r\nВ последнее время СМИ все чаще готовят спец.проекты и альтернативные варианты подачи материалов, представленные в игровой манере. Сайт ассоциации WAN IFRA разбирает наиболее яркие примеры.\n\nWeb Design Book of Trends 2015-2016\r\nКнига UXPin про тренды в вебе 2015-2016.\n\nНосимые устройства\n\nПринципы дизайна носимых устройств от Fjord.\n\n\nАвтомобильные интерфейсы\n\nJake Zukowski, ex-Frog о комбинации юзабилити и безопасности в дизайне автомобильных интерфейсов.\n\nПрезентация по адресу http://www.slideshare.net/JakeZukowski/ux-in-automobiles-balancing-effective-ui-design-driver-safety-41477573 недоступна.\n\nДля общего и профессионального развития\nHow to design award-winning websites\r\nLasse Kristensen является членом жюри FWA. Он рассказывает о том, по каким критериям судит работы.\n\n\n\nПродуктовый дизайнер\n\nMike Atherton достаточно интересно рассуждает на эту тему, включая нечеткую границу между дизайнером и продукт-менеджером.\nKyle Fiedler о том, как это устроено в дизайн-студии ThoughtBot.\n\n\nПодборки книг\n\nDavid Travis советует книги под конкретные задачи. Список не то что бы большой, но подход интересный.\n\n\nI Have No Idea What The Hell I Am Doing\r\nПеревод статьи на основе свежего выступления Brad Frost об особенностях и философии дизайна в современном вебе. Много ключевых идей собраны вместе.\n\nЛюди и компании в отрасли\nDesigner Bios\r\nЗабавная коллекция мини-биографий дизайнеров из их личных сайтов и сайтов студий. Кто и как себя подает.\n\nИнтересные назначения дизайнеров\n\nKhoi Vinh не зря сотрудничал с Adobe при работе над инструментом прототипирования Comp CC. Компания наняла его заниматься инструментами для дизайнеров. Одно из самых интересных назначений последнего времени.\nSusan Kare стала главой продуктового дизайна в Pinterest. Интервью о том, чем именно она занимается.\n\n\nПокупки дизайн-студий крупными компаниями\n\nAccenture купили студию Chaotic Moon из Austin (Техас).\n\n\nЗакрытие LayerVault\n\nAMA с Andrew Wilkinson, выкупившим DesignerNews.\n\n\nМатериалы конференций\nUideo — 374 около-дизайн-видео\r\nАндрей Якушев запустил агрегатор видео с отечественных дизайнерских конференций. В базе уже под четыре сотни выступлений.\n\n\n\nUX Strategies Summit 2015 Review, Part 1 — Overview and Workshops\r\nОтчет Pabini Gabriel-Petit о конференции UX Strategies Summit 2015, проходившей 10-11 июня в Сан-Франциско, США. Очень подробный конспект ключевых выступлений. День 2.\n\nСвежие ссылки можно также отслеживать в одноименной Facebook-группе. Спасибо всем, кто также публикует ссылки в ней, особенно Геннадию Драгуну, Павлу Скрипкину, Дмитрию Подлужному, Антону Артемову, Денису Ефремову, Алексею Копылову, Тарасу Бризицкому и Евгению Соколову. Все больше материалов в обзорах появляется благодаря им.\n\nПодписаться на рассылку\r\nПисьмо приходит один раз в месяц.", {"day": "3", "month": "сентября", "time": "12:27"}, {"rate": 15, "views": 13000}], ["Предлагаем вашему вниманию подборку с ссылками на полезные ресурсы, интересные материалы и IT-новости\n\n\n\n\n\n\nВеб-разработка\n\n\nCSS\n\n\nJavascript\n\n\nБраузеры\n\n\nДизайн\n\n\nНовости\n\n\nЗанимательное\n\n\n\n\n Веб-разработка\n\n 7 советов, как улучшить работу вашего сайта в Microsoft Edge и других современных браузерах\n Пишем плагин под webpack\nWordPress 4.3 «Billie» увидел свет\nКак создать мобильный сайт, обеспечивающий конверсию\nЯзык модульного дизайна\nОбновлённая статистика популярности языков программирования на GitHub\n Релиз Bootstrap 4 alpha (Bootstrap 4 alpha)\n Виртуальные машины для работы с Windows 10 стали доступны на Microsoft Edge Dev\n Интервью с Артёмом Геллером, создателем Kremlin.ru (From Russia With Love: Behind The Responsive Redesign of Kremlin.ru)\n Использование Jade и Grunt для ускорения HTML-разработки (Using Jade and Grunt to Speed Up HTML Production)\n Что такое веб-анимация? Rachel Nabors объясняет (What is web animation? Rachel Nabors explains it all.)\n Настоящее прогрессивное улучшение (The Real Progressive Enhancement)\n Универсальный React с Babel, Browserify\n Великие иконочные дебаты: Шрифты vs SVG (The Great Icon Debate: Fonts Vs SVG)\n Изучение регулярных выражений (Learning Regular Expressions: The Practical Way)\n Веб-разработчики рулят миром (Web Developers Will Rule The World)\n Текущее состояние поддержки HTML5/CSS3 браузерами (The Current State of HTML5/CSS3 Browser Support)\n Простые практики в дизайне и фронтенде для улучшения доступности (Easy Design & Front-End Practices for Improving Accessibility)\n Семь трендов веб-разработки для 2015-го года (7 Web Development Trends for 2015)\n Состояние отзывчивых изображений в 2015 (The state of responsive images in 2015)\n 19 лучших рассылок для Front-End разработчиков\n  Подборка и обзор видео с «You Gotta Love Frontend Conference 2015»\n  Последние выступления с конференций, которые стоит посмотреть (Recent Conference Talks Worth Watching)\n\n\n CSS\n\n How-to: Техники создания интерактивных email-писем с помощью CSS\nWebKit (Safari 9) включил поддержку CSS-селекторов 4 уровня\nCSS Grid Layout — на финишной прямой\nCSS-функция element(). Перевод статьи CSS element() function сообществом css-live.ru\nДесять заповедей логичных файлов стилей (Перевод статьи The ten commandments of sane style sheets)\n Выстраиваем гибкое будущее веб-дизайна с помощью Flexbox (Laying Out A Flexible Future For Web Design With Flexbox)\n Работаем с цветом в CSS (Working with Colour in CSS)\n Hasp — Half-assed CSS preprocessor. \n CssNano — модульный минификатор, состоящий из PostCSS плагинов\n Дилемма с  @font-face (The  @font-face dilemma)\n Создание диаграмм с помощью CSS (Making Charts with CSS)\n Объемная призма, отображающая текущее состояние загрузки либо процесса, на чистом CSS (Pure CSS Progress)\n CSS модули — добро пожаловать в будущее (CSS Modules — Welcome to the Future)\n Руководство по стилю от MailChimp (MailChimp Content Style Guide)\n Прорисовывающееся изображение с SVG и режимами наложения (“Scribble” Image Reveal with SVG and Blend Modes)\n Создание переключателя стилей на чистом CSS используя :checked (Building a Style Switcher with Pure CSS Using :checked)\n Хочешь изучить Sass? Начни с этих ресурсов (Want To Learn Sass? Start With These Resources)\n Генератор изображений устройств Apple на чистом CSS\n\n\n JavaScript\n\n Задачи, микрозадачи, очереди и планы ( Tasks, microtasks, queues and schedules)\n Удаленная отладка и тестирование JS c помощью новых плагинов Vorlon.js (Remotely Debug and Test JavaScript with New Vorlon.js Plug-ins)\n Эволюция асинхронного JavaScript (The Evolution of Asynchronous JavaScript)\n Загрузка файлов с помощью Ajax и HTML5 в MVC (Upload File Using Ajax And HTML5 in MVC)\n 12 ресурсов для разработчиков, которые хотят изучить Backbone.js\n Штуки, которые вы можете делать с нативным DOM-ом (Things you can do with native DOM)\n О природе таймеров (On the nature of timers)\n Видео: знакомство с блочными операторами в JavaScript (Video: Getting to Know Block Statements in JavaScript)\n Руководство по ванильному Ajax-у без jQuery (A Guide to Vanilla Ajax Without jQuery)\n Пять малоизвестных фактов о литералов объектов в ES5 (Five little-known facts about ES5 object literals)\n Пять простых настроек, улучшающих производительность Node.js Express (5 Easy Performance Tweaks for Node.js Express)\n ES6 в деталях: Будущее (ES6 In Depth: The Future)\n Универсальный роутинг в React c помощью ES6 (Universal Routing in React with ES6)\n Конвертируя ES6 Maps в JSON и обратно (Converting ES6 Maps to and from JSON)\n React: реальная шумиха (React: The Hype is Real)\n Видео: Захват времени в React (Watch: Capturing Time in React)\n React Color — коллекция цветовых пипеток из Sketch, Photoshop и Chrome (React Color — a Collection of Color Pickers from Sketch, Photoshop, Chrome & more)\n Начало работы с Angular 2 используя TypeScript (Getting Started with Angular 2 using TypeScript)\n Как создать приложение на Angular 2 роутером и сервисами (How to build an Angular 2 application with routing and services)\n Правильное тестирование приложений на Angular JS с ES6 модулями (Proper testing of Angular JS applications with ES6 modules)\n Визуализация потоков информации из Twitter в вирутальной реальности с помощью Three.js и Node (Visualizing a Twitter Stream in VR with Three.js and Node)\n Getting Functional with Javascript (Part 2)\n Представление Four: это как WebGL, но попроще (Introducing Four: It’s WebGL, but Easier)\n Falcor — JavaScript библиотека для эффективной выборки данных (Falcor — a JavaScript library for efficient data fetching)\n Type­set.js — типографический препроцессор для HTML (Type­set.js — A ty­po­graphic pre-proces­sor for your html)\n\n\nБраузеры\n\nБраузеру Opera исполнилось 20 лет\nВыход Firefox 41-beta и Firefox Developer Edition 42\nБраузер Edge не пользуется популярностью у обладателей ПК на Windows 10\nFirefox переходит на новый API разработки дополнений, совместимый с API для Chrome\n Safari — это еще не новый IE, но… (Safari is Not the New IE, But…)\n Браузер Microsoft Edge: обзор (Microsoft Edge: the Review)\n Превью первых обновлений веб-платформы Microsoft Edge\n\nСайты с интересным дизайном и функциональностью\n\nВзгляд в прошлое: как менялся веб-сайт Apple с 1997 года\n Startup Timelines — сайт, посвященный стартапам, которые в свое время изменили мир — таким, как Instagram, Facebook, Twitter, Airbnb и другие\n logikstudio.de — сайт-портфолио с интересными эффектами\n loisjeans campaign — симпатичная промо-страница с удачным параллакс-эффектом\n Интерактивный сайт, посвященный фильму «take me to tomorrow land\n void.hi-res.net — сайт с полными погружением в 3D\n thehappyforecast.com — сайт на canvas с очень качественной графикой и анимацией\n .josephaavoue.com — скролл-сайт с анимацией\n chelseacollective.com — сайт с нестандартной раскладкой и анимациями\n 2014Year in review\n webomedia.net — современный сайт, насыщенный анимацией\n\n\n Дизайн\n\nCтрах и ненависть в редизайне\n Руководство для дизайнеров по надеваемым устройствам (A Designer's Guide to Wearables)\n Упрощение вашего дизайна для умных пользователей (Simplifying Your Designs for the Smartest User)\n Как Google делает дизайн для слепых (How Google designs for the blind)\n 7 вещей о доступности, которые должен знать любой дизайнер\n 5 профессиональных советов по дизайну для инвалидов (5 pro tips for designing for disabilities)\n Еще семь вопросов, которые задают новички (7 more questions asked by noob designers)\n Какие самые полезные советы, которые вам когда-либо давали? (What’s the smartest piece of advice you ever got?)\n Проблема уведомлений (The Notification Problem)\n Механика выбора даты в UI (UI Mechanics of a Date Picker)\n Концепт фичи для Snapchat (A concept feature for snapchat)\n Концепт YouTube live для Android (YouTube Live for Android)\n Размывание — это авто-настройка UI дизайна, и другие вещи, которые мы держали в фокусе, создавая дизайн для Wildcard 2.0 (Blurring Is the Auto-Tune of UI Design, and Other Things We Thought About While Designing Wildcard 2.0)\n Дизайн страниц для пожертвований в президентских гонках (Presidential Donation Design Race)\n Эксперименты с загрузкой — как долго вы сможете ждать? (Experiments in Loading — How Long Will You Wait?)\n Десять способов сделать ваш сайт запоминающимся и приносящим прибыль (10 Design Tricks to Make Your Site Memorable(and Profitable))\n Создание креативных команд не ориентируясь только на чутье (Building Creative Teams without Your Gut)\n Как исправить плохой пользовательский интерфейс (How to fix a bad user interface)\n Principle: инструмент для прототипирования который стоит попробовать использовать (Principle :the prototyping tool you’ve got to try)\n30 горячих клавиш, которые сделают работу в Adobe Photoshop быстрее\n Быстрый совет: маскирующий слой против инструмента удаления в Adobe Photoshop (Quick Tip: Layer Mask vs. the Eraser Tool in Adobe Photoshop)\n Как создать эффект сигаретного дыма для кисти в Photoshop-е (How to Create a Smoke Effect for a Photoshop Brush)\n Создание постера с овощами с плоским дизайном в Affinity Designer (Create a Flat-Style Vegetable Poster in Affinity Designer)\n UI Movement — галерея вдохновляющих примеров UI\n Цвета иконок приложений (The Colors Of An App Icon)\n Повысь свои навыки играя в эти типографические игры (Boost Your Skills With These Fun Typography Games)\n\n\n Подборка бесплатных дизайнерских печенек\n\nБесплатные фотографии для осенних работ\nБесплатный вектор на школьную тематику\n Наборы UI в стиле Metro (22+ Best Free Metro style UI Kits)\n Две дюжины шаблонов PSD веб-сайтов за август 2015 (24 PSD Free Website Templates – August 2015 Edition)\n Мокапы визиток — август 2015 (21 PSD Free Business Card Mock-up Templates – August 2015 Edition)\n Упаковка с буквами сделанными из горящих лампочек (Free Pack of Realistic Vintage Light Bulb Sign Letters)\n Набор UI под Sketch (Freebie — UI Kit)\n Иконки Windows 10 (Free Windows 10 Icons)\n Fblu — набор контурных иконок (Fblu free icons)\n Break — декоративное шрифтовое семейство без засечек (Break | Free Font)\n Rissa — декоративное шрифтовое семейство (Rissa Typeface)\n Troupe — декоративный ретро-шрифт с засечками\n\n\n Новости\n\nFacebook обогнала Google по объёму трафика для СМИ\nДатацентр Google безвозвратно потерял доступ к части информации после четырех подряд ударов молнии\n11 важных отличий Windows 10 от Windows 8\n5 неочевидных преимуществ Windows 10\nРазработчики шутят: релиз Project Ara отложен потому, что смартфон разваливается на части\nСолнечные крыши: новый проект Google\nGoogle окончательно заменил красные навигационные ссылки на синие\nСервис Новости Google подключает еще 7 языков\nGoogle Hangouts теперь отдельный сайт\nВ Германии за фото еды из ресторана в Facebook или Instagram могут засудить\nРоссийская аудитория социальных сетей уходит в мобайл\nКоличество зарегистрированных пользователей Foursquare превысило 60 миллионов\n\n\n Занимательное\n\nКаким был первый подкаст\nФото и видео: роботы Boston Dynamics занимаются странными вещами\n«Ларри и Сергей планируют будущее Google на 100 лет вперёд»: Экс-сотрудник компании о том, как мыслят сооснователи\nАналитики рассказали о возрасте аудиторий соцсетей за 4 года\nОдин день в минском офисе Viber\nЗа кулисами Amazon: как складами управляют алгоритмы\nКак завести полезные знакомства в онлайне\nЧто нам известно об автомобиле Apple\nКраткая история взлётов и падений Uber\nПоявился первый в мире аэропорт с электропитанием исключительно от солнечных батарей\nТранспортная система будущего Hyperloop становится ближе к реальности\nВ MIT показали печать расплавленным стеклом и изделия из него\nКак устроен 3D-принтер для стекла?\nGoogle обязали удалить информацию об удалении информации\n Концепт приложения который пишет вашу автобиографию\n\r\n Просим прощения за возможные опечатки или неработающие/дублирующиеся ссылки. Если вы заметили проблему — напишите пожалуйста в личку, мы стараемся оперативно их исправлять. \n\nДайджест за прошлую неделю.\r\nМатериал подготовили  dersmoll и  alekskorovin.", {"day": "23", "month": "августа", "time": "23:36"}, {"rate": 25, "views": 30000}], ["23 мая в Москве прошел Dribbble Meetup 2015. На этой неформальной конференции для дизайнеров выступили полтора десятка сильных и интересных специалистов, представленных в одной из главных тематических социальных сетей Dribbble. Команда Zeplin, Игорь Мустаев (Лавка букв), Анатолий Громов (Fjord), Данил Криворучко (Charlex), Олег Турбаба (SFÇD), Павел Шумаков (Вконтакте), Елена Лазутина, Алексей Рыбин (Great Simple Studio), Андрей Кармацкий (Яндекс), Антон Карташов (Иннова), Павел Скрипкин (Mail.Ru Group) и Евгений Беляев (Авито), Дмитрий Новиков (MacPaw), Дмитрий Чута (Chapps), Олег Андрианов (Одноклассники). Было много практически полезных рассказов и историй из жизни дизайнеров и компаний с живым и веселым диалогом со слушателями.\n\n\n\r\nВместе с Олегом Андриановым мы проводим митап уже в четвертый раз при поддержке Mail.Ru Group и с согласия самого Dribbble. С прошлого года это совсем официальное мероприятие #dribbblemeetup, причем одно из самых крупных в мире. Первый раз получился очень интересным и бодрым. В 2013 году получилось развить идею и сделать мероприятие масштабнее — пришло около 400 слушателей и полтора десятка спикеров. В 2014 мы снова пошли вперед и побили свои рекорды — около 550 слушателей и 17 спикеров. Ну а на этот раз планка опять поднялась — 600 слушателей. Местом проведения выбран новый офис Mail.Ru Group на Ленинградском проспекте, который и вместил всех.\n\nDribbble был создан Дэном Седерхольмом (Dan Cederholm), основателем американской дизайн-студии SimpleBits. Приглашение для публикации своих работ получить непросто и, как следствие, на сайте присутствуют только качественные работы и лучшие дизайнеры со всего мира. А с появлением командных аккаунтов крупные интернет-сервисы вроде Facebook, Dropbox, Evernote, Google оперативно публикуют свежие куски своих свежих работ. Наша команда в Mail.Ru Group также публикует свои наработки в ходе редизайна продуктов компании и создания новых сервисов.\n\n\n\n\r\nПрограмму открыл Вадим Ростоцкий из Одноклассников, который анонсировал конкурс для дизайнеров Russian Design Cup 2015. Он будет проходить уже в четвертый раз. Недавно появились детали и состав жюри, среди новых лиц — Артем Геллер и Павел Шумаков.\n\nwww.slideshare.net/VadymRostotskyy/russian-design-cup-2015-dribbble-meetup-russia\n\n\n\n\r\nПервой презентацией Игорь Мустаев из Лавки букв здорово вдохновил присутствующих своей любовью к мелу. Игорь давно занимается леттерингом, а в дополнение к этому — преподает на курсе Ильи Рудермана в Британке. Одна из его недавних работ — новогодние заставки Первого канала, здорово нашумевшие в дизайнерском сообществе. Об этой и других работах, а также своей технике он и рассказал.\n\nwww.slideshare.net/igormustaev/dribbble-meetup-2015\n\n\n\n\nАнатолий Громов из шведского офиса Fjord рассказал, чем занимается в компании и как устроен типовой процесс работы над проектом, а также разнице между продуктовым и сервисным дизайном. У него была, наверное, самая длинная сессия вопросов и ответов — аудитории было интересно узнать как можно больше о работе компании.\n\nwww.slideshare.net/AnatoliyGromov/anatoliy-gromov-at-dribbble-meetup-moscow-2015\n\n\n\n\nЕвгений Беляев (Авито) и Павел Скрипкин (Mail.Ru Group) недавно запустили Resonator — инструмент для облегчения нарезки мобильного дизайна и другой графики для передачи разработчикам. Они рассказали о проблематике этого нелегкого процесса и показали, как их продукт облегчает жизнь.\n\nwww.slideshare.net/evgenybelyaev16/dribbble-meetup-russia-2015\n\n\n\n\r\nЛучшим спикером первой части митапа по мнению слушателей оказался Олег Турбаба из питерского офиса SFÇD. Он рассказывал об анимации в интерфейсах и начал с более-менее простых и понятных вещей. Но по ходу презентации и разбора своих работ, очень сильных и необычных, становилось все интереснее и интереснее. За последние пару лет все более-менее научились основным вещам и даже успели перешагнуть ступень разумного с перебором «пружинок», а рассказ Олега ответил на вопрос «что дальше».\n\nwww.slideshare.net/turbaba1/turbaba-functional-animation\n\n\n\n\nАнтон Карташов из Инновы закончил первую часть глубоким рассказом о работе с Origami для Quartz Composer. Антон накопил приличный опыт работы с инструментом и недавно запустил сайт-справочник по работе с ним. Это было хорошо видно в презентации, которая будет дико полезна всем, кто хотел бы создавать особо динамичные прототипы.\n\nwww.slideshare.net/kartashov/facebook-origami-dribbble-meetup-russia-2015\n\n\n\n\nПавел Шумаков, руководитель дизайн-команды Вконтакте, рассказал о том, как меняется социальная сеть и показал направления развития интерфейса продукта. Долгое время не было известно почти ничего о том, что происходит внутри и есть ли там вообще дизайнеры, так что интерес повышенный. Помимо всего этого Паша презентовал новое мобильное приложение для работы с фото.\n\nwww.slideshare.net/PavelShumakov/ss-50463621\n\n\n\n\r\nПолным составом на митап приехала команда Zeplin — Pelin Kenez, Berk Cebi, Ismail Ceylan и Merih Akar. Инструмент облегчает взаимодействие между дизайнерами и разработчиками, передавая ресурсы и спецификации быстрее и проще. Россия была третьей страной по количеству пользователей на момент выступления, так что интерес к продукту и рассказу о нем оказался высоким. Вскоре после конференции команда переехала из Турции в Сан-Франциско — готовиться к полноценному релизу и развивать его дальше.\n\n\n\n\r\nОбладательница интересного и необычного стиля Елена Лазутина порадовала слушателей очень личным рассказом о том, как создаются эти иллюстрации. По ее словам, это простой, но очень эффектный в результате подход с выбором несложной палитры, которая варьируется в конкретной работе и дает добрый и душевный результат.\n\n\n\n\r\nАрт-директор новосибирской Great Simple Studio Алексей Рыбин — большой специалист по UI-китам, которые он часто публикует на Dribbble. А с запуском DesignModo Market они стали еще заметнее. Алексей рассказал о том, как устроен бизнес на готовых интерфейсах и как студия работает над ними.\n\n\n\n\nДанил Криворучко, арт-директор нью-йоркской студии Charlex, описал историю создания приложения Urban Walks, выпущенного недавно вместе с Антоном Реппоненом и студией Гиперболоид. Он также прошелся по особенностям работы в американском агентстве, так что презентация получилась еще и личной. Слушатели выбрали Данила лучшим спикером второй части митапа.\n\nwww.slideshare.net/dribbbleru/urban-walks\n\n\n\n\nОлег Андрианов сделал хороший обзор наработок дизайн-команды Одноклассников над одним из мобильных приложений. Они смогли выстроить хорошую связку инструментов для того чтобы общение между дизайнерами и разработчиками было максимально быстрым и продуктивным.\n\nwww.slideshare.net/oanoff/dribbble-meetup-2015-51337515\n\n\n\n\nДмитрий Чута из Chapps подготовил вторую версию своего прошлогоднего рассказа об анимации. Помимо категоризации подходов и решений, он обозначил проблему инструментов — большинство имеющихся сейчас решений дают на выходе видео или GIF, что равносильно передаче макета в JPG. Если мы хотим выйти за границы совсем базовой анимации, нужно серьезно переосмыслить связку дизайнер-разработчик.\n\nwww.slideshare.net/DmitriyChuta/20-51350245\n\n\n\n\r\nГлава дизайна картографических сервисов Яндекса Андрей Кармацкий немного подустал рассказывать о продуктах и решил поговорить о своих экспериментах в визуализации данных, в первую очередь картографических. Вскоре после конференции стало понятно почему — Андрей покинул компанию. У него одна из лучших в России экспертиз по этой теме, поэтому было крайне интересно послушать его.\n\nwww.slideshare.net/karmatsky/dribbble-meetup-2015-mailru-hq\n\n\n\n\nДмитрий Новиков из MacPaw закончил митап профессиональной философией. В этом году ему запретили рассказывать про Скетч :) Получился идеальный рассказ для завершения конференции — жизненный, задорный, личный и мотивирующий.\n\n\n\r\nКроме того, получилось собрать много интересных слушателей, в том числе из сильных отечественных компаний и команд. Благодаря этому активное общение шло не только на сцене, но и вне презентаций — а это не менее интересная часть любого хорошего мероприятия. За все это также отдельное спасибо нашим спонсорам, предоставившим призы для участников:\n\n\nHuawei, разыгравшей шесть умных часов среди слушателей и спикеров. Умные часы Huawei TalkBand B2 уже в продаже — это отличный подарок для дизайнера.\nWacom, проводившей конкурс на лучший логотип Dribbble Meetup 2016 с подарком лучшему в виде планшета.\nМанн Иванов Фербер, предоставившим несколько десятков книг, а также электронное издание для всех участников.\n\n\n\n\n\n\n\n\n\n\r\nМы старались поддерживать баланс между практической полезностью рассказов и возможностью познакомить сообщество друг с другом, а также показать наиболее востребованных его участников. Многие из них выступали впервые и это было заметно. Но митап — это не совсем конференция и важно совмещать познавательную часть с тусовочной. Нам кажется, что именно эта неформальность и делает Dribbble таким интересным. Мы скорректируем формат к следующему разу с тем чтобы сделать его еще более бодрым. Так что следите за анонсами в Фейсбук-группе, Твиттере и на сайте.\n\nФотографии с московского Dribbble Meetup 2015.", {"day": "13", "month": "августа", "time": "13:39"}, {"rate": 14, "views": 7700}], ["Всем привет! С вами «Метрика» – шоу для тех, кто создает и анализирует продукты и сервисы на различных платформах.\n\nСегодня в программе\r\nСпециальный 13й выпуск Метрики с подборкой из первых 12-ти записей с Платоном Днепровским (hryusha), Алексеем Копыловым (copylove), Артемом Геллером (heller), Александром Буртом, Антоном Артемовым (a_dae), Павлом Грозяном (grozyan), Дмитрием Новиковым, Денисом Кортуновым (kortunov), Александром Кушпелем, Алексеем Полехиным, Дмитрием Фитискиным (dfitiskin) и Натальей Кирилловой. Спасибо за участие друзья! :) \n\nЗаметки\nТвиттер Платона\nТвиттер Алексея Копылова\nТвиттер Артема Геллера\nТвиттер Антона Артемова\nТвиттер Дмитрия Новикова\nТвиттер Павла Грозяна\nТвиттер Дениса Кортунова\nТвиттер Дмитрия Фитискина\nТвиттер Александра Кушпеля\nТвиттер Алексея Полехина\nБлог Александра Бурта\nФейсбук Натальи Кирилловой\n\r\nПредыдущие выпуски (#1, #2, #3, #4, #5, #6, #7, #8, #9, #10, #11, #12).\n\nТекстовый дайджест подкаста «Метрика» на Facebook.\nФотографии с подкастов (UPDATE).\n\nСкачать подкаст\n\nПрезентация по адресу http://www.slideshare.net/dmitry-kabanov/metrica-23697488 недоступна.", {"day": "2", "month": "июля", "time": "11:41"}, {"rate": 6, "views": 2700}], ["Всем привет! С вами «Метрика» – шоу для тех, кто создает и анализирует продукты и сервисы на различных платформах. Первого апреля мы ударно потрудились и записали аж два выпуска, предлагаем вашему вниманию продолжение нашей беседы:\n\nСегодня в выпуске\r\nПлатон Днепровский (hryusha), Артем Геллер (heller), Александр Бурт и Дмитрий Кабанов (dmitrykabanov) обсуждают новости из сферы электронного правительства, в частности, последние инициативы и предложения по улучшению юзабилити гос. сайтов.\n\nЗаметки\nДизайн государственных систем (группа в Facebook)\nGovernment Service Design Manual (gov.uk)\nИнтернет-сайты российских госорганов могут стать стандартными\nТвиттер Дмитрия Сатина\nМинкомсвязь РФ в Facebook\nЦентральный гос. сайт Бельгии (belgium.be)\nНациональная идентификационная карта (Бельгия)\nУкраинский сайт госпортала административных услуг в стиле Windows 8 (одноименный пост на Хабрахабре)\nТвиттер Артема Геллера\nТвиттер Александра\nТвиттер Платона\nТвиттер Дмитрия\n\nСкачать подкаст (альтернативный вариант)", {"day": "9", "month": "апреля", "time": "16:18"}, {"rate": 11, "views": 5600}], ["Всем привет! На прошлой неделе мы запустили свой подкаст под названием «Метрика». Это шоу для тех, кто создает и анализирует продукты и сервисы на различных платформах. И вчера мы записали второй выпуск.\n\nВо втором выпуске\r\nПлатон Днепровский (hryusha), Артем Геллер (heller), Александр Бурт и Дмитрий Кабанов (dmitrykabanov) рассуждают о конференциях как платформе для получения новых знаний, приводя примеры из собственного опыта.\n\nЗаметки:\nМетрика #1: Образование и мотивация\nCodefest в Новосибирске\nМорковка: спереди или сзади? (презентация Платона на Codefest)\nМорковка (фото)\nVoronezh Design Weekend в Воронеже\nЛучшие твиты и фотографии с Voronezh Design Weekend\nРепортаж Вести.net о Voronezh Design Weekend\nФестиваль Деятелей Интернета 404fest в Самаре\nКонференция по компьютерной графике SIGGRAPH\nБлог Александра Бурта\nТвиттер Артема Геллера\nТвиттер Александра\nТвиттер Платона\nТвиттер Дмитрия\n\nСкачать подкаст", {"day": "2", "month": "апреля", "time": "17:37"}, {"rate": 13, "views": 7100}], ["СтартапДжобс – это совместная программа поиска кадров для стартапов GreenfieldProject и PRUFFI. \r\nЧтобы принять в ней участие, необходимо подать заявку сюда. \n\nСтартапДжобс на Хабре — это еженедельная публикация вакансий стартапов, описаний проектов с комментариями экспертов в IT. \n\nЭксперты: Дареджан Митяева, продюсер Newstube; Артем Геллер, разработчик Kremlin.ru, zakonoproekt2011.ru. \n\nВакансии и проекты: Flash-разработчик в социальный проект «Русский жестовый язык», программист на Flash в сервис для прямых трансляций через веб камеру. \n\n1.) Vidstep \r\nЭтот ресурс предназначен для прямых трансляций через веб камеру различных событий в жизни человека. Это могут быть музыкальные выступления, обучающие материалы, публичные выступления, трансляции в барах, ночных клубах, различных заведений и т.д. выбор безграничен, можно создать свою уникальную тему! Просто можно общаться в видеочате с друзьями или незнакомыми людьми.\r\nНа странице пользователя можно вести свой блог, описывать предстоящие события и комментировать предыдущие, подписываться на страницы пользователей и добавлять друзей, просматривать ТОП-ые трансляции в общем списке или выбрать по категориям.\n\nvidstep.com\n\nКто нужен?\n\r\nПрограммист на Flash\n\nОписание задач:\n\r\nНаписание плеера для трансляций и видеочата с нуля.\n\nГрафик работы:\n\r\n• В свободное время\n\nТип оплаты:\n\r\n• Доля в проекте\n\r\nАвтор: Ilya Belov \r\nE-mail: belovil@mail.ru \r\nТелефон: +7902 209 98 28\n\nКомментарий эксперта\n\n\n\n\nДареджан Митяева, продюсер Newstube:\n\r\n — Идея трансляций через интернет очень интересная и перспективная. Но пока не очень понятно позиционирование проекта и его бизнес-модель.\n\r\nРесурс будет жизнеспособен, если создатели смогут обеспечить интересное видео-наполнение ресурса, и здесь очень интересно, на чем они планируют акцентировать внимание. Если речь идет о соц.сети с видеочатом и UGS-трансляции, то в Рунете было несколько попыток, и все не удачные. В основном потому, что для подержания чистоты ресурса требуется очень жесткая модерация потока видео. Как только проект достигнет некоего минимального количества пользователей, сделать это будет очень сложно, практически невозможно. А мечты о том, что все будет «саморегулироваться» — это утопия.\n\r\nЕсли речь идет о более-менее профессиональных веб-трансляциях, то это уже освоенное поле, и есть опыт, которым можно воспользоваться. В этом направлении возникают другие проблемы как технические, так и финансовые – каналы связи, качество сигнала, пиковые нагрузки и т.п.\n\r\nВ целом идея перспективная, но потенциальных проблем много. Если создатели их видят и смогут придумать эффективные способы обойти все «грабли» – будет интересно посмотреть, что получится.\n\n 2.) Социальный проект «Русский жестовый язык»\r\nОбучающие программы, содержащие хорошее мультимедийное изложение материала, часто делают объяснение более понятным, чем в печатном учебнике, и потому становятся все более популярными.\r\nДанный курс представляет собой мультимедийный комплекс для самостоятельного изучения русского жестового языка. Объем учебного материала в курсе достаточен для непрерывных занятий в течение года, а при интенсивном обучении, возможно освоить язык за три-четыре месяца.\r\nСловарь жестов расширяет кругозор, знакомя с множеством новых понятий.\r\nСловарь жестов необходим при изучении жестового языка. \n\ndigitgestus.com\n\nКто нужен?\n\r\nFlash-разработчик (Умение работать флеш с множествами flv-файлами.)\n\nОписание задач:\n\r\nРасширенный проект\n\nГрафик работы:\n\r\nВ свободное время\r\nНа каникулах\n\nТип оплаты:\r\nБесплатное участие\n\r\nE-mail: firehack.com@gmail.com \n\nКомментарий эксперта\n\n\n\n\nАртем Геллер, разработчик Kremlin.ru, zakonoproekt2011.ru:\n\n — Любая инициатива в области адаптации людей с ограниченными возможностями, если она не требует неоправданного финансирования — прекрасна. В связи с этим, думаю, можно опустить лирику и приятельские похлопывания по плечу.\n\r\nНа данном этапе, этого сайта (сервиса) просто не существует. Он не продуман, не удобен, не профессионален, и не служит никакой цели — бесполезен, но инициатива — прекрасна.\r\nСделать полезным этот проект могут заинтересованные опытные профессионалы, которые найдут идею, поймут аудиторию и максимально удобно решат её задачи. \n\n\nЕсли вы хотите, чтобы ваши вакансии стартапов попали в дайджест, заполните заявку. Вакансии размещаем бесплатно.\n\r\nОстальные выпуски СтартапДжобс можно читать в приложении ДП Вконтакте", {"day": "13", "month": "мая", "time": "15:27"}, {"rate": 4, "views": 386}], ["Уже в течение многих месяцев наши слушатели активно просят нас делать расшифровки бесед «Рунетологии». Мол, читать интервью удобнее, чем слушать. Действительно, зачастую тяжело найти время и возможность для вдумчивого прослушивания подкаста длительностью целый час. Иногда проще и комфортнее ознакомиться с текстовой версией беседы.\n\r\nСначала мы хотели сделать отдельные посты с расшифровками, но такие объемы текста (от 60 тыс. символов) Хабр публиковать не позволяет. Поэтому расшифровки будут храниться на PodFM.ru. Чтобы посмотреть их, нужно нажать кнопку «Текстовая версия выпуска», что под плеером на странице подкаста (пример).\n\r\nПока текстовые версии доступны не для всех подкастов. В качестве эксперимента мы решили сначала расшифровать четыре выпуска «Рунетологии» за май. Под катом — наиболее интересные вырезки из интервью с Алексеем Костаревым (i-Jet, «Счастливый фермер»), Артемом Геллером (kremlin.ru), Алексеем Аметовым (Look At Me) и Иваном Засурским (Часкор). Кому больше нравится читать, а не слушать — вам сюда.\n\n\nРунетология 51: совладелец i-Jet («Счастливый фермер» и другие игры) Алексей Костарев \n\n[М. Спиридонов]: В 2007 году ты увидел, что происходит на Facebook и вы тут же начали заниматься социальными приложениями?\n\n[А. Костарев]: Совершенно верно. Первой игрой была «Мафия», она появилась еще раньше, чем социальные сети, социальные игры. Мы сделали «Мафию» и не знали, куда с ней пойти. То есть просто повесить на какой-нибудь сайт, например, на mafia.ru, что было очевидно, но туда же нужно пользователей как-то завлекать? Столкнулись с тем, что затраты на рекламу несопоставимы со стоимостью разработки, да и денег у нас не было. И в очередной раз, когда я не знал в российском Интернете ни одного человека, я написал письмо тем компаниям, которые могли бы заинтересоваться — в «Яндекс», «Рамблер», «Майл.ру». Меня удивило, но на следующий же день мне ответили «Яндекс» и «Рамблер». Мы приехали, и ребята нас выслушали. И вот, компания «Рамблер», Алексей Садонов, который возглавлял игровое направление тогда (а позже ушел на Mail.Ru, хотя и оттуда сейчас уже ушел)… Алексей поверил в нас, и с учетом даже того, что на «Рамблере» были игры только казуальные, а наша все-таки абсолютно не подходила под формат, но являлась какой-то инновацией на тот момент. Приложений социальных не существовало, но в этой игре были друзья, в ней нужно общаться, она была мультиплеерная, эту игру многие знают по детским лагерям. Он поверил в нас, и мы повесили «Мафию» на портал «Рамблер», к нам пришла аудитория, и это был переломный момент.\n\n[М. Спиридонов]: Как это выглядело? В чем главный перелом?\n\n[А. Костарев]: К нам пришли пользователи. Сначала их было немного, человек 30. Уже после 30 человек мы не справились с этим потоком, наш сервер лег. Мы — ничего, мы снова немножко подделали сервер. Выделили человек 50. Затем мы доходили до цифр в 2000 человек онлайн и как-то выдерживали такие нагрузки. На тот момент, по-моему, мы с учетом всех оптимизаций, попробовали порядка 100 бизнес-моделей, боролись за каждый процент, за каждый рубль, хотя шутили, что все вместе мы зарабатываем на бутылку пива — и так продолжалось полгода. До тех пор, пока не появились приложения на Facebook. В этот момент мы поняли, что индустрия началась. Мы очень долго не могли понять феномен «игр с друзьями», нам казалось, что «Мафия» — это идеальная игра. Это неправда, это всегда происходит с разработчиком — любой свой продукт кажется лучше других. Мы отстранились от этого, мы «Мафию» двигали и в штатах на Facebook и там получили огромный опыт, перевели ее на 7 языков. И в какой-то момент в США я понял, что социальные сети будут не только в Facebook, они развиваются и дальше — Orkut в Бразилии, как пример. В этот момент Google — это был 2008 год — занялся активным продвижением своей платформы open social. Я подумал, что в очередной раз мы можем осуществить очередной рывок. На роликах — велосипеда у меня на тот момент еще не было, на велосипеде я уже ездил к венчурным капиталистам — я приехал в Google. «У меня такой проект, вы двигаете open social, вам нужны примеры успешных игр, сейчас мы на Facebook, но хотим двигаться дальше». Я приехал в американский Google. Я узнал контакты человека, который отвечал за это направление в Google и написал ему. В Долине с этим очень просто — если тебя интересует какой-то человек из большой или маленькой компании, то очень просто найти рекомендации к нему. Просто спрашиваешь у ребят и найдется хотя бы один, который знает кого-то, например, из Google. Тут же получаешь контакты, звонишь человеку и назначаешь встречу. Никаких костюмов, договоренностей и так далее. Через час уже встречаешься с нужным человеком в джинсах и футболке. Google предложил перевести «Мафию» на 4 языка, так как open social продвигался в ряде стран. И Google сами произвели этот перевод, мы вышли на эти социальные сети, хотя не сказать, что получили какой-то глобальный результат.\r\nЯ приведу один такой пример, образ. Когда мы последний раз общались с моим другом — очень известный стартап в Кремниевой долине, InvisibleCRM, Влад Воскресенский, — когда я у него спросили: «Что ты можешь сказать про Кремниевую долину?». Он сказал: «У меня была ситуация, через неделю когда я приехал, меня приглашают на тусовку...». Вся долина состоит из тусовок, интерпринеров, людей, которые что-то делают, они все общаются между собой. Он приходит на эту тусовку, там был американец, который спросил у него: «Влад, вы откуда?». «Я из Киева». «Я не понял, вы откуда? Вы где живете, здесь где живете?». «Я живу в Саннивейл». То есть никого не интересует где ты жил до этого, где ты был до этого. Если ты прожил здесь 1-2 дня, если пришел в эту тусовку интерпринеровскую, если ты там оказался, ты уже местный. Там все люди, которые приехали, и это самое главное. В отличие от Европы, Азии и так далее, где ты все равно являешься чужим\n\n[М. Спиридонов]: То есть там нет местных, там все понаехавшие?\n\n[А. Костарев]: Когда я попал в инкубатор, технопарк, зашел, там висело порядка 45 флагов. Российского не было, не было ни одной российской компании. Самый известный бизнес-центр. Соответственно, мы были первой российской компанией там. Там вообще не было до нас ни одной российской фирмы, хотя со всех остальных стран мира были.\n\n[М. Спиридонов]: Флаг повесили российский?\n\n[А. Костарев]: Да!\n\n[М. Спиридонов]: Вы купили, боюсь соврать, «Счастливого фермера» у китайской компании за сумму около 100 тысяч долларов. Верно?\n\n[А. Костарев]: Абсолютно неверно. Если быть честным, мы не покупали продукты и не покупаем до сих пор. Единственная схема, по которой мы работаем — разделение прибыли. Мы предлагаем зарабатывать деньги американской компании или российской, или азиатской. Мы вам дадим пользователей, мы вам расскажем, как эти деньги заработать, поможем выйти на другие рынки. Договариваемся без денег. И будем договариваться без денег.\n\nРунетология 52: совладелец «Опытного Креативного Бюро» (разработчик Kremlin.ru) Артем Геллер\n\n[М. Спиридонов]:В процессе создания сайта как-то участвовал сам господин Медведев? Какие-то эскизы просматривал, давал какие-то комментарии?\n\n[А. Геллер]: На знаковых этапах процесса работы, безусловно. Ну, я таких этапов могу выделить, как минимум, три — это концепция и описания портала, принятие дизайна и финализация процесса, проекта. Президент одобрил то, что получилось в итоге, и сайт запустился с этого момента.\n\n[М. Спиридонов]: Каким образом ты формулировал для себя, и вы формировали в команде с господами из Кремля задачи сайта? Он для чего?\n\n[А. Геллер]: Для людей, в первую очередь. Он не выполняет никаких других функций.\n\n[М. Спиридонов]: Ну, людям нужны хлеб, зрелища, развлечения какие-нибудь. «Для людей» — это очень общий ответ.\n\n[А. Геллер]: Объективно раскрывать полный спектр информации. Насыщенность всеми возможными технологическими удобными доступными вещами. Мы думали очень много о доступности, очень много думали о социализации и это нашло применение в некоторых аспектах сайта. Глобально задача проекта не формировалась никакая. Нет такого абзаца, который пафосными словами говорил о чем-то, что должен нести идеологически проект. Он должен быть демократичным, удобным и доступным, и социальным. Это самые важные вещи.\n\n[М. Спиридонов]: Как ты говорил, кто-то из координаторов или, может быть, сам господин Медведев о том, что он хочет видеть? Ведь заходят на сайт и видят его как бы альтер-эго виртуальное?\n\n[А. Геллер]: Мы предлагали и с нашими решениями либо соглашались, либо отвергали их. Предлагали сами, что очень редко, кстати, в клиентской части работы. Высказывали интересные вещи.\n\n[М. Спиридонов]: Можно сказать, что этот сайт выполняет задачу представить каждый момент времени, местоположение, деятельность и вообще жизнь Президента России? Или нет?\n\n[А. Геллер]: Да, но там разнесены по разным частям портала эти вопросы. Собственно, та часть, которую делала конкретно «Опытное Креативное Бюро» — то, что вы заходите по ссылке kremlin.ru.\n\n[М. Спиридонов]: А почему сайт Президента России довольно безличный, как мне кажется? Ни фотографий в шапке, ни каких-то таких элементов, относящихся непосредственно к господину Медведеву, только слова «Президент России», герб, точка.\n\n[А. Геллер]: Это не сайт Президента Россия Дмитрия Анатольевича Медведева, а сайт Президента России. Хотелось бы это подчеркнуть. Имеется в виду такой факт, что преемник будет пользоваться этим же ресурсом. Поэтому и нет фотографии Президента в шапке. К тому же, если говорить о дизайне, мы старались соответствовать тем современным доступным интерфейсным тенденциям, которые уже сложились в стране интерфейсов. Это операционные системы, это определенный софт, мы не хотели, чтобы пользователь отвлекался на красивые картинки, а приходил на сайт работать, читать. Или, в случае с журналистами, работать.\n\n[М. Спиридонов]: А сейчас кто выступает в качестве контент-менеджеров — вы или люди из Кремля?\n\n[А. Геллер]: Безусловно, пресс-служба Президента. К контенту сайта мы не имеем никакого отношения. Мы занимаемся тем, что развиваем ресурс технически, наполняем функционалом, предлагаем какие-то идеи. Если они находят понимание, мы их реализуем.\n\n[М. Спиридонов]: А почему, кстати, возвращаясь к началу реализации, были выбраны такие сроки, 4 месяца? Откуда такая спешка?\n\n[А. Геллер]: Наверное, как все в нашей стране, долго все рождалось и быстро делается. Нам неважно, какие были сроки, у нас была задача сделать за 4 месяца и мы ее реализовали. Мы головами понимали, что это теоритически реально, мы довольно жестко строили процесс работы и с задачей мы справились.\n\nРунетология 53: генеральный директор Look At Me Алексей Аметов\n\n[А. Аметов]: Сначала Look At Me существовал как стрит-фэшн-блог. И достаточно успешно в этом направлении развивался, был лидирующим стриn-фэшн-блогом в России на тот момент. И в какой-то момент Васе Эсманову пришла в голову идея, что на базе блога можно построить социальное медиа. То есть дать людям возможность писать какие-то посты и плюс сделать какую-то небольшую социальную сеть для этой тусовки людей, которая сложилась вокруг данного блога. Как раз в этот момент он обратился ко мне, мы встретились, обсудили возможности что с этим можно сделать и потом еще нашли третьего соучредителя, Екатерину Базилевскую. Она тогда работала генеральным директором агентства «Кислород» при группе агентств Leo Burnett. И мы ей тоже предложили с нами вместе начать это делать, у нее был большой опыт по рекламе по спецпроектам, по стратегическим планам различным для клиентов. Соответственно, она сама могла для нас делать стратегическое планирование.\n\n[М. Спиридонов]: Вскладчину вложили деньги?\n\n[А. Аметов]: Собрались все вместе и поняли, что нам еще нужно найти команду дизайнеров и разработчиков. Пришли в студию Nimbler, которой владели Антон Гладкобородов и Кирилл Тен. Мы предложили им за долю в проекте за «нарисовать и спрограммировать». Потом скинулись по 5 тысяч евро на зарплату первых сотрудников и какое-то оборудование, и начали делать.\n\n[М. Спиридонов]: Ты сказал, что через 3 недели продали первое рекламное место и через несколько месяцев, я знаю, вышли на окупаемость.\n\n[А. Аметов]: Да, но вышли на окупаемость, при учете того, что мы работали бесплатно. У нас были какие-то другие работы, на которых мы зарабатывали деньги. Все, что зарабатывал Look At Me мы тратили на зарплату сотрудников и оборудование.\n\n[М. Спиридонов]: И сейчас как у вас дела?\n\n[А. Аметов]: Сейчас проект в небольшом плюсе, потому что мы продолжаем активно инвестировать. Развиваем радио, развиваем магазин, какие-то новые редакционные проекты — такие, как Village — запускаем. Соответственно, все, что мы зарабатываем мы стараемся тратить.\n\n[М. Спиридонов]: Внешних инвестиций не было вообще?\n\n[А. Аметов]: Ни разу. Был кредит, когда начался кризис, и нас достаточно серьезно прижало. И взяли в кредит 100 тысяч долларов под адский процент — 30% годовых. В прошлом декабре отдали полностью и деньги, и проценты.\n\n[М. Спиридонов]: Это сильное решение. Есть даже такой прием у управляющей компании, когда речь идет об инвестировании в проект, который не очень очевиден, то предлагаются какие-то такие схемы: «Дадим денег, но в кредит под какие-то обязательства». Большинство людей ломаются именно на этом, я наблюдал такое не раз. Стоит уверенный с блещущими глазами идеолог проект, который говорит, что все будет классно и нужны деньги — хорошо, мы дадим, но дадим в кредит. Оформим именно как кредит с возможностью конвертации в инвестиции, если все будет хорошо. Если не хорошо, то будете просто отдавать, вы же верите в проект? На этом многие ломаются.\n\n[А. Аметов]: Достойная схема, на самом деле. Кредит очень здорово дисциплинирует. Есть 2 вещи, которые дисциплинируют — люди, которые работают и которым надо платить зарплату, и кредит, который надо отдавать.\n\n[А. Аметов]: Тут история в том, что деньги из безвоздушного пространства не появляются, они приходят откуда-то с какой-то целью. Есть инвестор, который хочет либо получить свои деньги назад преумноженными, либо — что еще хуже — хочет получить какой-то медиавес. Тогда он будет очень серьезно влиять на редакционную политику. И на все, что ты будешь делать. То есть, соответственно, если бы у нас было бы много денег, у нас был бы один из этих двух типов инвесторов, все равно не было бы какой-то спокойной жизни. Я не говорю про случаи, когда люди делают какие-то вещи — типа, «Топфотоп», — про которые все знают, когда задача только потратить деньги комфортным для себя образом с целью самоутвердиться и заработать себе на машину и квартиру.\n\n[М. Спиридонов]: Такая мысль пришла в голову, пока мы обсуждаем бизнес-составляющие вместе с творческими. Как ты думаешь, то движение вокруг вашего сайта или рядом с ним, движение хипстеров, молодых людей с динамичным мышлением, многие это называют, со своим взглядом на вещи, любопытных молодых людей. Есть ли в этом движении какой-то позитивный сдвиг в сознании молодежи? Как известно, многие люди старшего поколения называют молодежь — 16-25-летних — потерянными, будто интересуют ее лишь игры, потребление. Есть еще вариант в книжке «Бизнес в стиле фанк»: «Все, что нужно — это секс и шоппинг». То, что ты говоришь — точка зрения человека ответственного, который понимает цену деньгам, своему слову, готовый взять ответственность на себя, за какие-то серьезные поступки, за деньги те же самые. Является ли это твоим, вашим подходом к жизни? Или это подход к той группе молодежи, к хипстерам? Я с ними незнаком, хотя я чуть старше — мне 33, для меня это уже другое поколение. Вы такие все или ты с Василием и ваша команда отличаетесь?\n\n[А. Аметов]: Вообще молодежь было принято ругать во все годы, всегда говорили, что молодежь уже пошла плохая, непонятно куда катится мир. Это было при Пушкине, это было в СССР, теперь в России то же самое. Но я могу сказать, что у нас средний возраст команды — 24 года, и все ребята, которые работают у нас, в возрасте от 18 до 30 лет, все очень талантливые, умные, ответственные люди, у которых очень много разных интересов. Они делают очень крутые вещи. И их друзья тоже очень, в основной своей массе, интересные, хорошие ребята, которые часто приходят к нам в офис. Все, с кем я общаюсь, не вызывают у меня мысль, что это потерянное поколение. Хотя, на самом деле, детство большинства этих людей проходило в 90-е годы, когда никто ими не занимался, но, с другой стороны, поэтому, возможно, и меньше промывали мозги. Они больше думали сами.\n\n[М. Спиридонов]: Возможно. Социальная составляющая вашего проекта насколько важна? Вы — социальная сеть? Как вы себя позиционируете?\n\n[А. Аметов]: Мы, скорее, социальное медиа, не социальная сеть, в полном смысле этого слова. У нас социальные связи внутри профайлов не главенствуют, у нас доминирует медийный контент. Во вторую очередь, сервис событий. Но при этом все «провязано» социалкой, люди могут общаться, обсуждать что-то, добавлять друг друга в друзья. Смотреть кто на какое событие идет.\n\n[М. Спиридонов]: То есть вы превосходите по степени социальной активности «Хабрахабр»? Наиболее активный в этом смысле проект?\n\n[А. Аметов]: Думаю, что да. Потому что на «Хабрахабр» люди не ходят вместе на какие-то события, не обмениваются фотографиями, не знакомятся друг с другом как-то активно…\n\n[М. Спиридонов]: У вас очень сильный интерфейс наружу, в оффлайн?\n\n[А. Аметов]: Мы очень жестко завязаны на оффлайн. Это наше очень серьезное отличие от большинства других проектов\n\n[М. Спиридонов]: Неужели неинтересно встать в обойму проектов мировых брендов, те же самые GQ, те же «Гламур» и так далее? Мне кажется, что там вы бы смотрелись очень органически.\n\n[А. Аметов]: Я же с самого начал рассказывать, что нам никогда не нужен был инвестор и сытая жизнь, поэтому мы серьезно относимся к вопросу зарабатывания денег, к независимости своей. Пока мы не видели ни одного инвестора, ни одного человека, который приходил бы к нам с каким-то предложением, который бы нам нравился, с которым мы бы хотели работать. Все были российские компании. Может быть, через какое-то время здесь или на Западе нам будет интересно работать вместе и как-то развивать проект. В данный момент мы не продаем сайт\n\nРунетология 54: основатель и главный редактор «Частного Корреспондента» Иван Засурский\n\n[И. Засурский]:… а на самом деле я пришел, там очень смешно было, я пришел, встречаюсь с ними, они говорят «Чего ты хочешь?», я говорю «Мне нужна позиция в компании, я хочу быть заместителем генерального директора по PR», они «OK». Вот, я говорю, хочу столько-то денег, ну и, кстати, мало назвал, они сразу согласились.\n\n[М. Спиридонов]: Мало — это сколько?\n\n[И. Засурский]: То ли две, то ли четыре попросил тысячи долларов в месяц. Ну, я говорю, мне нужна была эта работа, я был пиарщик крутой, но я не был интернетчик, так, по-честному, я не особо врубался вообще что тут происходит. Но я из Америки привез ощущение, что нужно именно этим заниматься, а все остальное как бы вторично, нужно разбираться с этим, а потом из этого будет какое-то будущее дальше. И поэтому я не особо торговался, я потом дико жалел, что так продешевил, и в конце концов этот же Лопатинский в итоге оставил меня без денег, когда мы «разводились» с Рамблером. Но на самом деле он сделал это не по злу, и ничего личного не имел ввиду, просто им нужно было меня спрятать от этих акционеров несчастных из «Проф-медиа», которые покупали Рамблер, потому что если бы они просто со мной общались, они бы все по-другому делали. \n\n[М. Спиридонов]: Ага, а как бы они делали?\n\n[И. Засурский]: Ну, во-первых, они бы наверное не покупали, я был пиарщиком, который делал реанимацию находящейся в коме компании, которую с помощью искусственных почек, искусственных легких, искусственного чего-то как бы надували, значит, типа лягушку. Но в принципе я не обижаюсь, потому что, когда делаешь такую работу и в итоге кто-то страдает, как пострадал «ПрофМедиа», они конечно по своей глупости сделали, потому что они даже не встретились со мной, хотя я был там на виду, не спросили вообще ничего, что там происходит, а разговаривали с людьми, которые хотели продать им эту какашку. А он в то время еще не был какашкой, просто приоритет акционеров был очень четкий — заработать, у них было мало денег мне, они продали здание на Автозаводской и на 10 миллионов долларов, что они смогли сделать — они сделали. Поэтому они наняли в качестве «чучелка» Иру Гофман, которая просто ничего не знала про этот бизнес вообще и могла говорить с такой же наивностью, как я, когда меня наняли, про все, что нужно говорить акционерам и будущим покупателям.\n\n[М. Спиридонов]: А вот это интересно, ты когда все понял тогда? \n\n[И. Засурский]: Я сразу почти все понял, я пришел когда работать в первый день, выхожу в офис, а там люди с грустными глазами пакуют вещи, выяснилось, что в тот момент, когда наняли меня, уволили всю команду Ашманова, 30 человек. И я реально прихожу в Рамблер, который был в научном парке, а там все пакуют чемоданы. Там все было сразу понятно. И было понятно, что там целый год была команда, которая целый год врала про цифры, целый год люди говорили, что доходность на самом деле такая-то, ну доходности тогда не было, простите, аудитория у нас такая-то, Яндекс врет, что они нас обгоняют. Короче это ужасная история, компания, которая сама себе врет, которая переходит от одного клана к другому, какая-то была «гражданская война» внутри этого Рамблера. И я при этом еще ни во что не врубался, и мне потребовалось года полтора, чтоб разобраться, а потом я начал управлять процессом, то есть я запустил Rambler Vision, запустил мобильную версию, еще много чего сделал, но если честно, то у меня не очень получилось, объективно если говорить. Смысл такой, на самом деле акционеры заинтересованы в стабильности, их не очень волновало то, что там возникнет или не возникнет какой-то локальный успех, им главное, чтобы компания осталась «одним куском», чтоб ее можно было продать. Поэтому это очень полезный для меня опыт был, потому что я страшно злился, там такая странная история, была такая девушка, Таня Желонкина. Которая из mail.ru к нам пришла, которая как бы перехватила управление, стала исполнительным директором, но она была, что называется, нелояльна, то есть она все время «смотрела на дверь», и ей все время казалось, что ее вот-вот «кинут». Моя задача была постоянно ее успокаивать, пытаться сделать так, чтобы ее борьба за власть не привела к развалу тех проектов, которые я начал. Там был еще Олег Бунин, такой персонаж, он тоже сейчас довольно заметный, который был руководителем технической службы, я помог ему вырасти в этой должности и вместе мы делали фото, видео, и все остальное. Я не могу сказать, что мы все делали идеально, но просто Рамблер это жесть, то есть еще в тот момент уже ничего почти невозможно было сделать и при этом была очень кривая система управления, когда над всем сидит акционер, который не хочет, чтобы что-то трогали, потому, что это будет плохо выглядеть и непонятно, получится тогда продать его или нет, который только и ждет, когда будет хороший момент, чтобы его продать, и при этом понятно, что ситуация все хуже и хуже становится. \n\n[М. Спиридонов]: Тебя послушать, там был прямо какой-то кошмар, гражданская война и разруха.\n\n[И. Засурский]: Ну, это была моя жизнь, это был мой кошмар, люди, которые меня знают, они знают чего мне это стоило.\n\n[М. Спиридонов]: А скажи, там как-то менялась ситуация? Они до сих пор вполне себе, то есть Рамблер вполне подает признаки жизни, пускай и не выглядит идеально. \n\n[И. Засурский]: Ну… Номер какой Рамблер? Где он? Что это такое? Чем занимается эта компания? На чем они специализируются?\n\n[М. Спиридонов]: Ну Рамблер это некий медийный портал с поиском собственным, не самым лучшим, да, конечно, но аудитория старая за него еще держится.\n\n[И. Засурский]: Ну, я не хочу ничего плохого говорить про Рамблер, знаешь, я считаю что Рамблер, вообще, это высшая сущность, это бестелесное всеведущее некое существо, могущественное, которому я служил много лет, и не хочу предавать его даже сейчас, но я могу сказать, что дела этой корпорации они развивались от плохого к худшему, от худшего к катастрофе. Катастрофа настала сейчас, с одной стороны это популярный веб-сайт, но с другой стороны, там нет ничего уникального и даже Топ 100 теперь пользоваться невозможно, после того, как они его переделали. Знаешь, когда менеджмент меняется в компании все время, все время все надеются, что менеджмент подтянет компанию к какому-то своему уровню. В действительности, обычно когда в интернет приходит не специалисты, по крайней мере в Рамблере так было, что они все время компанию опускают до своего уровня понимания, то есть, чем меньше люди врубаются в то, что происходит, они всегда свежие, они всегда при власти, потому что акционеры берут их как свежих таких, больших, вкладывают в них свои надежды. И Рамблер эта такая компания, которая была уничтожена таким странным «симбиозом», когда огромная роль поддержания компании на плаву была у технических специалистов, которые просто там отверткой, чтоб не рассыпался на ходу, соответственно они были не за какое-то быстрое развитие, их главный приоритет был — чтобы там ничего не упало. С другой стороны были постоянно какие-то новые менеджеры. В какой-то момент у меня была полная власть в компании, но не долго, потому что на полгода уехал главный акционер в Америку, у него были какие-то проблемы, и на бумажке карандашиком мы расписали бюджет какой-то, который я выполнял, по PR, по рекламе, по продуктам. За это время я, что смог, успел сделать, а потом ко мне потерял доверие акционер управляющий и дальше была война в которой я непонятно зачем даже участвовал. Потому что, если бы был повзрослее, то мог бы понять, что люди меня «кинут» в итоге.\r\nСейчас, в принципе, я очень хорошо отношусь к Турищевой, я считаю, что она умница, но просто сейчас это корыто с разбитыми яйцами, и из него трудно курочку или петушка или вообще что-то извлечь. Но Рамблер это моя боль, это потому, что это у меня в руках умирало, много лет я пытался это спасти, в итоге пошел на конфликт с акционерами, они хотели ленту разогнать в общем-то. То есть у них были свои приоритеты, и я занял какую-то независимую позицию, и как менеджер с независимой позицией остался без своего пол-лимона. Нужно все-таки понимать, что когда тебя нанимают люди, они тебя нанимают, чтобы ты делал конкретную работу. Если ты начинаешь биться за судьбу компании, то на что ты можешь рассчитывать? Только на то, что потом ты сможешь на радио-шоу рассказать какой ты герой. \n\n[М. Спиридонов]: Зависит от степени осознанности тех людей и тех задач, которые они ставят перед проектом.\n\n[И. Засурский]: Ребята заработали полмиллиарда как бы в общей сложности.\n\n[М. Спиридонов]: На сделке по «Рамблеру»?\n\n[И. Засурский]: Ну а чего? Конечно. Сколько он стоил, «Рамблер» этот? Да ничего он не стоил, они как бы сделали из него чучелку, и чучелка выглядела красиво, и они его смогли продать, потому у них было два покупателя, которых они смогли по цене передрать между собой…\n\n[М. Спиридонов]:… понятно. Ситуация на рынке СМИ вообще, онлайн-СМИ, разумеется, как бы ты ее охарактеризовал, она стоит, движется?\n\n[И. Засурский]: Ну, жопа, жопа, в том смысле, что если бы люди реально как бы знали экономику, я думаю, что меньше было бы проектов в интернете новостных, потому что очень тяжелая у всех ситуация, очень неправильная ситуация на интеллектуальном рынке, какие-то монополии рекламные, какой-то в интернете уже возник свой «Видео Интернешнл», который тут же там сдулся. Мне не нравится все это, я не считаю, что эта система работает эффективно, я не считаю, что она работает справедливо, я не считаю, что она обслуживает интересы рекламодателей должным образом\n\n[М. Спиридонов]: А чьи интересы обслуживает, рекламных агентств?\n\n[И. Засурский]: Ну, может быть, рекламных агентств в основном. Отмывателей какого-то трафика. Ну, то есть это все игра в дурака, а я не хочу играть в дурака. Я делаю сделки с реальными людьми, мне потом перед ними стыдно, понимаешь меня?\n\n[М. Спиридонов]: Понимаю, а как было бы правильно тогда, можешь нарисовать картинку идеального состояния рынка?\n\n[И. Засурский]: Идеальное состояние рынка — когда как бы люди получают именно ту аудиторию, которая им нужна. А любая аудитория получает именно тот продукт, который ей нужен. Вот идеальное состояние рынка. Ну, как это тебе объяснить, я не знаю\n\n[М. Спиридонов]: Нет, вроде понимаю, то есть ты считаешь, что перекос сейчас в том, что многие проекты искусственны, с искусственным трафиком, с искусственной аудиторией и таким образом обманывают рекламодателей\n\n[И. Засурский]: Они убивают весь наш бизнес. Эти гандоны убивают весь наш бизнес, потому что из-за них цена держится эта, понимаешь? Им кажется, что они играют в какую-то крутую игру, что они изобрели велосипед. На самом деле они торгуют порнотрафиком. Это отражается, потому что когда ты приходишь в Нокию или куда-то там, называешь свои цены, они говорят: «У этих же столько-то, почему у вас столько?». Потому что эти люди на самом деле продают fishki.net, но в другой оболочке, понимаешь? Поэтому я не думаю, что эта ситуация вечная, потому что бесконечно рекламодателей обманывать не получится, наверное, но вот пока что эта рекламная мафия она в силе, она действует, но я думаю, что мы с «Часкором» доберемся и до них. Понимаешь, мы идем к вам. Так что мы расскажем правду.\n\n[М. Спиридонов]: То есть в таком контексте получается, «Часкор» выступит санитаром леса.\n\n[И. Засурский]: Ну, ты видел же был же рейтинг как бы, топ качественных СМИ. Мы вошли в десятку. И в этом топе качественных СМИ, который возглавила лента, там, конечно, были разные издания, но там не было «РИА новостей», знаешь, а что им там делать?\n\n Послушать предыдущие выпуски и подписаться на RSS подкаста \n Страница «Рунетологии» на Facebook", {"day": "17", "month": "июня", "time": "16:14"}, {"rate": 41, "views": 486}], ["Совсем недавно я анонсировал конференцию с Артемом Геллером о создании сайта kremlin.ru. Конференция прошла в минувшую среду (2 декабря). Все желающие имели возможность задать Артему вопрос. Сама конференция доступна у нас в архиве, а здесь я опубликую часть наиболее интересных на мой взгляд вопросов и ответов.\n\n\n\n\n\nАлексей Колеватых: Здравствуйте, Артем, скажите, сколько эскизов вы подготавливали, перед тем как у вас получился конечный эскиз, который в дальнейшем превратился в сайт? Какие особенности демонстрации и принятия экскизов у сайтов такого высокого государственного значения?\nАртем Геллер: Добрый день, Алексей. Если отвечать по сути, то в папке с проектом 705 макетов в формате .psd, а сама папка занимает 1,5Gb. Для веб-проекта — это очень большой размер.\n\r\nВ связи с тем, что базовой ценностью в нашем случае были динамичные информационные потоки, мы начали разработку макетов со страницы отдельной новости и только ближе к концу подошли к главной странице. Это довольно необычно потому, что в большинстве своем разработка веб-сайтов начинается с главной страницы. \n\r\nВажно заметить, что еще до начала разработки была тщательно прописанная концепция, более того, были созданы предварительные макеты знаковых разделов.\n\r\nОсобенностей демонстрации и принятия эскизов не было, мы просто работали в теснейшей кооперации с пресс-службой Президента РФ. Личные визиты, файлы, почта, постоянная связь.\n\n\nЕвгений Калмыков: Привет, Артем.\r\nА почему копирайт на самом главном сайте страны не по ГОСТу сделан?\r\nШутка :) \r\nАртем, если бы Вы могли начать работу над проектом снова, что бы Вы сделали иначе?\nАртем Геллер: Привет, Женя.\r\nНачать, наверное, нужно с того, что результатом работы я доволен. Работа над порталом продолжается и если возникают мысли сделать что-то новое, то эти мысли находят свою реализацию. Ведь проект по настоящему живой, как снаружи так и внутри. \n\r\nТак же хотелось бы отметить, что в скором времени на сайте Президента появятся не анонсированные интересные и новаторские функции и модули, суть которых структурировать, упростить и сделать интерактивной работу с определенными типами информации.\n\n\nАлиса Николаева: Сколько людей работало над проектом?\nАртем Геллер: Добрый день, Алиса. Если исключить пресс-службу Президента, а брать только технологов, программистов и дизайнеров, — то примерно 10 — 15 человек в течении 4,5 месяцев.  \n\n\nЕвгений Калмыков: Артем, идея создания сайта и то, каким он должен быть — это инициатива сверху или Вы имели некий набор предложений?\nАртем Геллер: Добрый день, Евгений.\r\nБезусловно, идея создания сайта — инициатива сверху, в ответ мы (ОКБ), в числе других компаний, изложили свои мысли и внесли предложения. \r\nИ я рад, что дизайн портала делал именно я, потому что кто-то другой мог сделать плохо.\n\n\nЛёша Огоньков: Как разрабатывались специальные версии сайта? Использовали ли вы какие-то рекомендации, например WCAG, при разработке «версии для слабовидящих»?\nАртем Геллер:Алексей, большое спасибо за этот вопрос.\r\nСкажу, что мы думали о доступности в рамках всех подсайтов.\r\nБезусловно, мы полностью придерживались стандартов и рекомендаций. Использовали свои наработки в этой сфере и первоисточник:\r\nНациональный стандарт ГОСТ Р 52872–2007 «Интернет-ресурсы. Требования доступности для инвалидов по зрению», Web Content Accessibility Guidelines (WCAG) — (от W3C) (международный), Section 508 Standards — США, WaSP — Великобритания, DAL — Дания.\n\r\nВопрос доступности был изучен ещё шире. Мы читали и анализировали сайты, созданные инвалидами, и сайты, созданные для инвалидов, где ведутся действительно интересные дискуссии на тему доступности этой большой части активных пользователей интернета.\r\nНами была применена новая технология, родившаяся в Англии под названием zoom layout (http://joeclark.org/access/webaccess/zoom/), это очень правильная идея:\n\nАвтоматическое форматирование контента;\nМножество колонок становится одной колонкой;\nВизуально навигация упрощается;\nМеню переходит наверх;\nШрифты увеличиваются;\n\r\nВсе это обеспечивает максимальную доступность.\n\r\nМы пошли ещё дальше, помимо основных рекомендуемых стандартами цветовых гамм, мы ввели ещё несколько дополнительных, про которые узнали из специализированных форумов, т.е.  из первоисточника.\n\n\n\nДмитрий Зимин: Артем, привет! Хотел задать вопрос ещё на 404fest, да не успел. Вопрос: были ли заданы какие-то особенные требования, которые не встречаются на «обычных» сайтах. Например, тройной уровень безопасности или какая-нибудь многоступенчатая система публикации? И спасибо большое за сайт, перед иностранцами теперь не стыдно.\nАртем Геллер: Привет, Дим!\r\nСпасибо за положительный отзыв, от тебя слышать это особенно приятно :)\n\r\nУровню безопасности был отдан безусловный приоритет, но нам смогли обеспечить полноценный уровень работы в этих условиях. Были не большие моменты, от которых пришлось отказаться по соображениям безопасности, но они не значительны. \n\r\nДа, для пресс-службы Президента РФ создана многоступенчатая система публикации, которая основана на их пожеланиях. Хочу еще раз заметить, что нам повезло работать с профессионалами, именно такие люди работают в пресс-службе.\n\nО конференциях\r\nОнлайн-конференции 404 проходят каждую неделю. В рамках конференции можно задавать вопросы известным дизайнерам, программистам, руководителям проектов, и т.д. Вопросы принимаются в течение недели, начиная с четверга, а ответы показываются в среду следующей недели.\r\nТак-же на сайте опубликован архив конференций с Александром Савицким (ТМ), Сергеем Чикуенком, Ильей Бирманом (Бюро Горбунова) и многими другими. \r\nА 9 декабря пройдет конференция с Иваном Сагалаевым, руководителем группы разработки контент-сервисов в компании «Яндекс».", {"day": "8", "month": "декабря", "time": "17:18"}, {"rate": 20, "views": 1000}], ["Артем Геллер — учредитель и креативный директор Опытного Креативного Бюро. Опыт работы Артема составляет 10 лет в области веб-разработок в качестве дизайнера и арт-директора. \n\r\nГлавным проектом Артема и их бюро стал проект kremlin.ru — официальный сайт Президента Российской Федерации. Этот проект включает в себя Информационный ресурс о деятельности главы государства «События», институты при Президенте «Государство», версия портала Президента РФ для «Слабовидящих», «Мобильная Версия» информационного ресурса о деятельности Президента РФ, сервис отправки обращений «Письма Президенту».\n\r\nСовсем недавно Артем принял участие в фестивале веб-разработчиков 404fest, где выступил с докладом о работе над этим важным проектом. \n\r\nВ рамках еженедельных он-лайн конференций 404ok мы решили дать возможность всем желающим узнать об этом проекте больше. Артем будет рад рассказать о том как рождались идеи, как велась работа с гоcударственными органами и о многом другом. Вы можете поучаствовать в конференции, задав интересующий вас вопрос.", {"day": "1", "month": "декабря", "time": "16:51"}, {"rate": 22, "views": 1900}]], "refs_quant": 21}