{"info": {"rate": 47.73, "subs": 86, "industries": ["Веб-разработка", "Программное обеспечение", "Веб-сервисы"], "about": "Мы мыслим инновациями\n\r\nГК «Иннотех» — это современная высокотехнологичная быстроразвивающаяся ИТ-компания. С 2020 года мы разрабатываем инновационные решения для цифровизации бизнеса. \n\r\nГК «Иннотех» выстраивает партнерские отношения с ведущими компаниями финансового сектора, предлагая им комплексные решения для фронт- и бэк-офисов, современные финтех-продукты, системы работы с большими данными. Кроме того, ГК «Иннотех» выполняет на заказ технологические проекты любой сложности, помогая своим клиентам на пути цифровой трансформации.\n\r\nЗа два года мы собрали команду из более чем 8 600 профессионалов ИТ-индустрии. А также стали известны крутым корпоративным мерчем и уникальным автобусным роад-шоу InnoTech On Toure."}, "refs": [["На Хабр Карьере запустилась карьерная неделя — это что-то вроде дня открытых дверей, который длится всю неделю. В этот раз в битве за сердца фронтендеров сошлись пять компаний: ALM Works, Simbirsoft, РТ Лабс, Альфа Банк  и Иннотех сняли короткие видеопитчи о своих лучших работодательских качествах и выложили свои самые горящие фронтенд-вакансии. Схема классическая: смотрите питчи на pitch.habr.com, отдавайте свой голос за лучший кнопкой «Хочу у вас работать» и откликайтесь на вакансии с кодовой фразой (она придет в письме после регистрации), которая гарантирует быструю обратную связь.В конце недели мы проведем круглый стол — встречаемся в пятницу 4 марта в 17:00, чтобы поближе познакомиться с ребятами из компаний и подвести итоги. Также не забывайте оставлять свои вопросы на pitch.habr.com про карьеру, технологии, скиллы фронтендеров — мы зададим их на круглом столе. А если не успеем всё обсудить, то обязательно опубликуем пост с ответами в нашей рубрике «Собеседование наоборот» (вот такой, например).А еще в честь Недели Фронтенда мы собрали для вас лучшие материалы с Хабра за последние несколько лет:Как мы распилили монолит. Часть 1Адаптация Android-приложения для незрячихКажется, мы стали забывать основы фронтенда«Пап, ты уже старый для этого»: как я в 40 лет ушёл из редакторов во фронтенд-разработчикиПрофессия: фронтенд-разработчик                                                           ———————————————ALM WorksSimbirsoftРТ Лабс Альфа Банк Иннотех", {"day": "28", "month": "февраля", "time": "12:38"}, {"rate": 8, "views": 5500}], ["Привет, Хабр, мы — Иннотех. Если говорить официально, то мы создаём современные высоконагруженные фронтальные системы, омниканальные продукты и высоконадёжные платформы для поддержки банковского бизнеса. Помогаем выводить клиентский опыт на новый уровень, внедряя AI-технологии в банковские продукты.Но давайте упростим: мы пилим для клиентов банковские решения, которые в 2022 году будут использоваться ещё и на международном рынке.Коротко — история компании31 декабря 2019 года было создано юридическое лицо Группа компаний «Иннотех». Однако старт операционной деятельности начался только 7 мая 2020 года. Созданная в эпоху локдаунов и пандемии, ГК «Иннотех» изначально сделала упор на дистанционный формат работы. Поэтому наши сотрудники трудятся в двух странах и 126 городах. 28–29 ноября 2020 года провели первый масштабный онлайн-хакатон Innotech Hack. Второй хакатон прошёл с 18 по 20 июня 2021 года. Кстати, почитать о нём можно тут. В 2022 году мы планируем... Ну, уже догадались, что третий онлайн-хакатон. Но об этом объявим отдельно.11 января 2021 года был озвучен амбициозный план по увеличению численности сотрудников и масштабированию бизнеса. 3 сентября стартовал масштабный проект Innotech On Tour. На брендированном автобусе руководство компании проедет по 17 российским городам, рассказывая о компании. 18 февраля 2022 года — запуск корпоративного блога ГК «Иннотех» на Хабре.За неполные два года мы выросли до 6 тысяч сотрудников. И каждый из них — носитель уникальных знаний и умений. Деятельность команды «Иннотеха» охватывает множество сфер: от информационной безопасности и масштабирования до DevOps, backend, frontend и full stack.Мы решили, что нужно помогать другим специалистам в развитии. Поэтому готовы делиться нашими наработками, кейсами и антикейсами, подходами и мыслями. Авторами корпоративного блога выступят сотрудники Иннотеха, которые с удовольствием ответят на мнения и вопросы в комментариях к постам. И конечно, мы ищем новых профессионалов, которые захотят влиться в команду ГК «Иннотех». Все вакансии можно найти здесь. Выбирай город, направление, опыт, и найдёшь подходящую вакансию.", {"day": "18", "month": "февраля", "time": "17:46"}, {"rate": -6, "views": 1900}], ["Привет, Хабр. Меня зовут Максим Мишута, и я расскажу вам про «Платформу исследования рисков». Это проект, реализованный «Иннотехом» для банка ВТБ, я в нём участвовал в роли IT-менеджера.Хороший специалист обязан быть увлечён своим проектом. Я постараюсь также быть хорошим рассказчиком и увлечь этим проектом вас. Если зайдёте под кат, сможете узнать следующие любопытные (надеюсь) вещи:что вообще происходит с IT-инфраструктурой ВТБ;как банки зарабатывают на рисках;что такое «Платформа исследования рисков»;как мы её разрабатывали;почему это не было легко.Глобальная трансформация ВТБ«Глобальная трансформация» — это очень модное словосочетание в последние несколько лет. Многие крупные компании приходят к мысли о необходимости масштабных изменений. Чаще всего эти изменения связаны с модернизацией IT-инфраструктуры, но это лишь средство. Цель — модернизация процессов.Начиная с 2019 года в ВТБ было запущено несколько программ глобальной трансформации. Они предусматривают полное обновление производственных и сервисных процессов, модернизацию производственных платформ для фронт- и бэк-офиса, изменение философии взаимодействия с внешним и внутренним клиентом. По сути, банк переходит на новый финтех-уклад.«Платформа исследования рисков» (далее — RRP, Risk Research Platform) относится к программе «Модернизация платформы данных», запущенной в 2020 году. Эта программа призвана переосмыслить и качественно улучшить источники данных для IT-систем банка, сделать их максимально доступными, надёжными и консистентными.Торговля рисками«Риски» звучит, как что-то плохое. Как банку удаётся на них зарабатывать? Если удариться в философию, можно сказать, что риск — обратная сторона ценности. У вас есть деньги? Есть риск, что их могут украсть. Поэтому вы несёте деньги в банк. Банк берёт на себя ваш риск, но при этом он также получает и выгоду: может пустить вклад «в рост». При этом риск для банка меньше, чем для простого человека, а выгоду он умеет извлекать более эффективно.Это максимально упрощённый пример, но он показывает суть. Риск и выгода везде идут рука об руку. Банк выдаёт кредит? Есть риск, что заёмщик не сможет или не захочет по нему расплатиться. Банк принимает этот риск, но взамен получает выгоду — процент по кредиту. Банк обменивает одну валюту на другую? Существует риск, что курс изменится в невыгодную сторону, и, чтобы получить свою выгоду, банк берёт комиссию за обмен. Любое движение средств — это также сопутствующее движение рисков.С рисками имеют дело все. Если так задуматься, спустить всю получку в игральных автоматах — это тоже в каком-то роде риск-менеджмент, но крайне не эффективный. Банк отличается тем, что работает с рисками профессионально, на основании тщательного и трезвого расчёта.Это не значит, конечно, что банк никогда не проигрывает. Порой проигрывает, да ещё как: Lehman Brothers или Barings Bank с грустью это подтвердят. Однако также банк хорошо умеет делать выводы из своих и чужих ошибок. А на случай, если он выводы делать не хочет, существуют рекомендации Базельского комитета. Можно сказать, что эти рекомендации написаны кровью: обычно они обновляются после очередного мирового экономического кризиса и направлены на то, чтобы не допустить его повторения.По сути, Базельские рекомендации стимулируют развитие культуры управления рисками. Они запрещают банкам чрезмерно рискованные виды финансового поведения. Например, в них есть требования к уставному банковскому капиталу и его ликвидности. Грубо говоря, это не даёт банку слишком заиграться в финансовые инструменты и потерять намного больше средств, чем у него есть.Так что же такое RRP?Чтобы управлять рисками, в первую очередь необходимо их анализировать. А для анализа нужны данные, крайне желательно — качественные.Наверное, каждому знакомо если и не понятие, то ощущение «предельной сложности». Например, когда при ведении бизнеса уже не хватает экселевской таблички и приходится заводить CRM-систему. Или когда в разработке программного продукта вдруг понимаешь, что пора разбить монолит на микросервисы. У банков также случается момент «предельной сложности», когда работа с данными становится запутанной, хаотичной, и хочется как-то её унифицировать.Крупный банк — это живой организм, который растёт и меняется, и вместе с ним растут и меняются источники его данных. Слияния и поглощения, изменения в IT-инфраструктуре — всё это приводит к тому, что у банка оказывается одновременно несколько источников, которые могут иметь разные форматы, разную степень достоверности и т. д. Нетрудно представить, в какой ад может превратиться анализ рисков при таком раскладе.Конечно же, хочется иметь единый источник данных: унифицированных, консистентных, актуальных. Вот бы существовал инструмент, позволяющий этого достичь… Погодите-ка. Кажется, такой инструмент действительно существует, и это как раз «Платформа исследования рисков». Далее, чтобы при пересказе не случилась потеря точности, приведу паспорт проекта.Цель и ключевые результаты проектаЦель проекта: Разработка платформы для интегрированного анализа рисков (кредитный и рыночный риски) группы на платформе ХД для целей управления рисками и капиталом (в т. ч. расчёта RORAC).Ключевые результаты проекта:•       витрины и результаты расчётов калькуляторов рисков (кредитный и рыночный риски) реплицируются в Hadoop, синхронизируются на уровне сущностей и доступны для интегрированного анализа;•       создаётся глоссарий с описанием каждой витрины, сущностей, атрибутов и различий между ними (только по реплицируемым данным), контролем и целевыми уровнями качества данных;•       проводится индустриализация процессов анализа данных и расчёта риск-показателей, внедрения изменений в методологию, процедур актуализации данных;•       регламентируется и реализуется контроль качества данных, в т. ч. кросс-сверки между витринами в RRP;•       разработаны и регламентированы промышленные источники данных из витрин рисков, доступные для внешних потребителей.Как это работаетВ рамках проекта нам нужно было создать промышленные регулярные процессы по доставке данных систем-источников в единое место, по очистке данных, проверке данных на консистентность, непротиворечивость и соответствие данных разных источников в разрезе исследуемой сущности (клиента, контракта и прочее). Также нам нужен был слой витрин, с которым будут работать аналитики и который можно использовать как источник для разных подразделений. Витрины данных — это логическое объединение специально созданных таблиц и представлений для решения определённых утилитарных задач.В проект мы заложили следующее изменение тракта данных, чтобы отсечь львиную долю ручного труда: первоначальные процессы подготовки данных с использованием труда аналитиков (as is) мы подменили на процессы промышленной подготовки данных (to be).Изменение трактаНа момент начала проекта у нас сложился IT-ландшафт, схематично изображённый ниже. По каждому направлению анализа рисков существует свой источник: данные по кредитному, по рыночному риску, по резервам… Отдельно существует большой RDM-источник (Reference Data Management, управление справочными данными). Каждая система-источник предоставляет свою витрину данных. Отдельно существует автоматизированная система для работы с этими витринами. Система развернута на базовом функционале SAS, что позволяет пользователям выстраивать сложные аналитические процессы и формировать витрины, необходимые для расчёта риск-метрик и отчётности.Изменение IT-ландшафта (красным пунктиром отмечены созданные потоки данных)Но эти процессы нельзя назвать промышленными: они не отвечают критериям регулярности, надёжности, масштабируемости, отсутствует релизная политика. Также везде присутствует человеческий фактор, а, как известно, причина 90% ошибок находится между креслом и монитором. Теоретически эту SAS-систему можно было допилить до состояния промышленной. Однако программа «Модернизация платформы данных» ставила перед нами более глобальную цель: внедрение общих стандартов для процессов получения данных из источников. Так появилось озеро данных.Озеро данных — концептуальная архитектураНаша область RRP выделена в область витрины DRP, поскольку предоставляет данные непосредственно бизнес-пользователям. Для озера же RRP занимает лишь небольшой финальный кусочек общего пространства данных.На первом этапе мы сделали репликацию данных источников на промышленном движке озера данных. Причём сделали это два раза. Первые процессы по репликации реализовали на EFW (ETL Framework: sqoop/jdbc + ObjectDispatcher/CaptureDispatcher), но озеро не стоит на месте и переехало на движок Spark Airflow (Apache Spark — ETL, Airflow — оркестратор), так что итоговую репликацию мы сделали на Spark Airflow. По своей сути репликация — это механизмы запуска SQL-запросов, оптимизированные под Impala, которую регулярно запускает Spark Airflow.Репликация состоит из двух частей: инициирующая загрузка и регулярная инкрементальная загрузка. Для источников с размером, превышающим 50 GB, ежедневная загрузка возможна только с помощью инкремента, иначе чересчур дорого по ресурсам. У нас ключевые источники измеряются терабайтами, поэтому самое интересное — это, конечно, расчёт инкремента. К сожалению, логику не покажу, права на неё принадлежат ВТБ.Вторым этапом мы сделали кросc-сверки. Кросc-сверка — комплекс запросов по загруженным данным из источников, которые проверяют данные по параметрам. Главным на данном этапе было разработать и запрограммировать логику кросc-сверок. Здесь мы тесно сотрудничали с аналитиками заказчика. Аналитики помогли нам с логикой, и они же работают с результатами проверок, сохранёнными в виде таблиц. Изучение этих результатов позволяет им лучше понять, как движутся данные.Третьим этапом мы реализовали аналитические витрины. Витрины разного назначения: для риск-аналитиков, для построения отчётов, для предоставления данных другим подразделениям банка.Доступ к витринам осуществляется с помощью инструмента Hadoop Hue (тонкий клиент), DBeaver. Из самого интересного — это отчёт по AQR (оценка качества активов) и витрина расчёта риск-показателей для RORAC (рентабельность капитала, скорректированного на риск).Логика отчётов — это полноценная story по Agile. Именно так мы её и сдавали: по кусочкам. Сделали совместно с заказчиком логику, защитили её. Отработали на прототипе и перед заказчиком же защищали прототип. Только после этого выкатили в прод. Впрочем, это не конец пути, лишь очередной этап: дальше отчёты будут дорабатываться с учётом опыта их использования заказчиком.Четвёртым этапом стала реализация глоссария данных. Нумерация условна: мы занимались этим параллельно с другими задачами. Глоссарий — очень полезный инструмент для аналитиков, работающих с моделированием, data mining, отчётностью, аудитом и т. п., поскольку позволяет понять входные данные и повышает прозрачность всего процесса расчёта.В рамках системы Informatica Axon мы описывали входные данные источников. Основной объём информации брали из самих источников, их метаданных, но также многое восстанавливали, опускаясь на уровень учётных систем и документации. Это была кропотливая ручная работа.Наш проект длился примерно год. На выходе мы получили новые тракты данных, существенно изменяющие IT-ландшафт.Мы многого достигли, но ещё более важно то, чего можем достичь в дальнейшем. На базе архитектуры RRP будет легче наращивать количество источников данных, развивать аналитический слой витрин. В IT есть такое понятие, как технический долг — так вот, у нас эдакий технический долг наоборот, что-то, что облегчает дальнейшую разработку и поддержку. Также RRP позволяет увеличить автоматизацию и качество тракта данных рисков, что, безусловно, повышает внутреннюю культуру по управлению рисками.По словам моего коллеги Данила Трофимова из управления консолидированного анализа рисков ВТБ, внедрение платформы позволило существенно повысить эффективность бизнес-процессов и высвободить ресурсы риск-менеджеров для решения интересных аналитических задач по моделированию и управлению рентабельностью капитала с учётом риска. Управление эффективностью использования капитала — критически важная для банка задача, которая требует интеграции данных из большого количества профильных систем, покрывающих отдельные виды риска, и возможности их оперативной обработки для целей динамического анализа.Что могло пойти не такКак и любой проект, наш не обошёлся без подводных камней. Как люди опытные, мы, разумеется, это учитывали, выделили время и ресурсы с запасом, и всё же отдельные контрольные точки проект прошёл в предельно допустимые сроки. На нас повлияли два глобальных фактора: пандемия и изменение производственного процесса в банке. Второй фактор повлиял радикально.Проект RRP зарождался, когда ВТБ жил по водопадной модели разработки. Под эту модель были заточены архитектурные документы, интеграционные карты, бизнес-требования, функциональные спецификации. Когда же проект открылся, банк почти без разбега прыгнул в Agile. Поменялось всё: структуры подразделений, роли, процессы взаимодействия и т. д. Но главное для нас — изменились и продолжали изменяться требования к документам. Все учились и набивали шишки, получали новые опыт и вводные. Так что комплект обязательной документации пережил 14 этапов согласований. И это было очень критично, поскольку без документов мы не могли получить доступы для разработчиков, а также открыть доступы для интеграций. Процесс сдвинулся, когда на уровне программы появился директор-координатор технологических проектов и взял эту боль на себя.Ещё одним сюрпризом стала смена движка репликации. Руководители разогнали банк так, что некоторые процессы пошли быстрее, чем ожидалось. Под самый Новый год, 27 декабря, озеро данных получило новый движок. Мы же в это время завершали тестирование первого релиза на старом движке, поэтому не уследили. Так что после новогодних каникул вся команда, скажем так, очень удивилась, а менеджерам пришлось оперативно переделывать план проекта.На этом фоне пандемия повлияла существенно меньше: как только команды научились удалённо работать (а для «Иннотеха» удалённая работа команд — это естественный процесс, ведь сама компания была создана в пандемию), проект быстро вошёл в график. Возникли некоторые трудности, когда учились удалённо собирать и выводить первый релиз, но мы быстро их преодолели.Спасибо, что дочитали эту статью. Надеюсь, что оказался хорошим рассказчиком и вам было интересно.Буду рад, если оцените наш проект на портале Global CIO. Оставляйте ваши вопросы/комментарии, с удовольствием на них отвечу.", {"day": "20", "month": "января", "time": "10:59"}, {"rate": 4, "views": 1300}], ["Привет, Хабр! Давно хакатон INNOHACK 2.0, анонс которого публиковался в начале июня. Организатор хакатона - ГК «Иннотех» — группа компаний, которая занимается разработкой высоконагруженных фронтальных решений, омниканальных продуктов для банковского рынка, внедрением ИИ в банковские продукты и созданием мобильных продуктов.Цель - привлечь к решению важных задач в этой сфере талантливых специалистов, способных предложить новые идеи. Для достижения этой цели и проводился хакатон. Давайте посмотрим, как он прошел и что предложили участники.Подробности INNOHACK 2.0 включал в себя 5 актуальных бизнес-задач, отобранных экспертами ГК «Иннотех»:Геймификация обучения. Создание геймифицированого приложения для обучения сотрудников.Информационная безопасность. Поиск и определение фишинговых сайтов.Генерация форм. Создание динамического конструктора форм.Маркет для поиска инвесторов. Создание маркета для поиска инвесторов и свободного размещения средств пользователями.Мэтчинг потенциальных кандидатов. Обработка резюме с источников, находящихся в открытом доступе.Общий призовой фонд хакатона — 1 200 000 рублей. Призовой фонд каждого кейса — 240 000 рублей.К участию приглашались:Backend разработчики;Frontend разработчики;Системный аналитик;DevOps;QA;UI/UX.Задача по привлечению участников оказалась не самой простой. Во-первых, параллельно проходило несколько масштабных ИТ-ивентов: это и «Цифровой прорыв», Moscow City Hack, Хакатон Редсофт и ЭЛЬДОCODE. Во-вторых, конечно, жара… Она не самым стимулирующим образом действует на проявление активности.Как все прошлоПосле анонса заявки на участие в отборочном туре подали 404 команды, из них 76 команд прошли отборочный тур. Общее количество одобренных участников команд - 210 человек. География хакатона получилась весьма обширной - 75 городов, включая Москву ~ 35%, Санкт-Петербург ~ 11%, Самару ~ 7%, Екатеринбург ~ 4%, Новосибирск ~ 4%, Краснодар ~ 3%, Красноярск ~ 2%. Другие города ~ 33%.После трех чек-поинтов количество команд сократилось до 33, а количество участников - до 109. В финал вышли 15 команд и 44 участника.У хакатона INNOHACK 2.0 было несколько особенностей. В первую очередь, это несколько уровней оценки. Приложение нужно было не просто разработать, а еще и подготовить инфраструктуру для его развертывания —  CI/CD pipeline. За это команды получали дополнительные баллы. Кроме того, для команд с sql-специалистами был создан отдельный рейтинг. За описанные тест-кейсы и найденные баги в созданных на соревновании продуктах давались дополнительные баллы. Так нам удалось создать своего рода мини-стартапы внутри хакатона, которые обеспечивали практически полный цикл работ над продуктом, как оно и бывает в реальности.Победители - кто они? Победили 5 команд, по одной в каждом направлении.Метчинг кандидатов — Команда IKIT + ANIME + PI = LOVEУчастники разработали сервис-агрегатор резюме соискателей, который помогает увеличить эффективность работы HR-отделов разных компаний. Сервис собирает всю необходимую информацию по заданным критериям, где HR может уже выполнить финальный выбор участников. Сервис предоставляет удобный UX, самые рутинные задачи перекладываются на автоматизированную систему. В будущем планируется добавить аналитику воронки найма для повышения конверсии.Алексей Бобров, капитан команды-победителя трека: «Участие в хакатоне после закрытия сессии я воспринял, как вариант отдохнуть и развлечься. Не вышло - из пяти участников команды в первую ночь соревнования нас осталось двое. Мы до 9 утра работали над прототипом, а потом поняли, что все не то… Если бы не идея, которая вдруг сдвинула все с мертвой точки. Это движение замотивировало подтянуться группу поддержки нам в помощь. В целом, 48 часов прошли будто 1 месяц. После все ощутили приятную и вместе с тем грустную усталость. Для меня хакатон был, словно путешествие в какие-то джунгли, но оно, увы, закончилось».Геймификация обучения — Команда AVMКоманда разработала VR-решение для того, чтобы улучшить эффективность получения пользователями необходимых soft-skills. В приложении используются все основные приемы геймификации, включая мотивацию, статусность и, конечно, вознаграждение - полученные баллы можно обменять на подарки от партнеров, включая сертификаты, билеты в кино или концерт.Кирилл Скосырев, капитан команды-победителя трека: «Мы шли побеждать. После регистрации увидели, что в треке 15 команд и поняли, что просто не будет. Основная сложность была в том, что задача предлагалась очень обширная: помимо самой платформы для геймификации обучения персонала, предполагалось заложить фундамент для технического масштабирования решения и приложить тесты. Очень понравился прикладной характер задач. И идея с коммуникационной платформой - отличная». Конструктор форм — Команда: #964b00Команда разработала динамический конструктор форм, который позволяет составлять экранные формы пользователем системы, сохранять экранные формы в базу данных на сервере, получать экранные формы с сервера, вводить пользовательские данные и отправлять их на сервер, а также получать и визуализировать пользовательские данные.Альбина Купцова, капитан-команды-победителя трека: «Мы шли пробовать свои силы, сформировав команду в самый последний момент. Настрой был боевой. Честно сказать, задача для нас не показалась сложной. Понравилось, что на организационные собрания не тратили много времени». И еще два победителя:Информационная безопасность — Команда: Item404Антон Лопаницын, участник команды-победителя трека: «Если в анонсе хакатона я вижу секцию по информационной безопасности, то иду участвовать. Таковых мало, поэтому всегда интересно посмотреть на задания. В хакатоне INNOTECH HACK было сложно, поскольку была необходима специфическая экспертиза, ну и дедлайны, конечно. Очень классный опыт работы с платформой - в других мероприятиях по разным чатам на разных ресурсах ищешь напарников, а тут все в одном месте, плюс помощь кураторов. Понравились синки с экспертами. Они дают подсказки и фидбэки еще на стадии прототипа, это помогает не уйти в другую сторону по фичам». Маркет для поиска инвесторов — Команда: DragonsМихаил Марцинюк, капитан команды-победителя трека: «Было интересно поучаствовать, всегда хотел попасть на хакатон. Онлайн-формат очень удобен с точки зрения работы, но, к сожалению, усложняется нетворкинг. Изначально я был один и искал себе команду прямо на платформе. Это непросто. Один участник прямо перед хакатоном испарился. Но я справился. Понравилась атмосфера внутри команды - соревновательная. После победы все зарядились на работу - очень крутой эффект». Каждая из команд-победителей получила  240 000 рублей. И еще один приятный сюрприз - любой из участников хакатона может получить оффер от ГК \"Иннотех\".Уже на закрытии участников опросили о том, что они думают о хакатоне. В большинстве случаев мнение положительное - 80% опрошенных участников пожелали принять участие в следующем хакатоне.В целом, все прошло весьма интересно, будем надеяться, что проекты, предложенные участниками, будут реализованы для решения реальных задач в бизнесе.", {"day": "8", "month": "декабря", "time": "13:25"}, {"rate": 5, "views": 388}], ["7 декабря состоялась церемония награждения лауреатов премии Рунета 2021 года. В этом году на премию было подано 1097 работ за вклад в развитие российского сегмента сети интернет в девять основных и четыре специальные номинации. Финалистами конкурса в каждой номинации стали по 10 организаций. \n\r\nЛауреатами премии Рунета 2021 стали 52 компании и 3 персоны. Причем раньше организаторы (Российская ассоциация электронных коммуникаций — РАЭК) награждали несколько лучших представителей в каждой из номинации, по мнению экспертного сообщества. В этом году они обратились к помощи искусственного интеллекта и добавили еще одного лауреата, который выбирался именно по мнению ИИ. \n\r\nНоминация «Государство и Общество», победители:\n\n\n Благотворительный фонд «Подари жизнь»;\n АНО «Диалог»;\n Правительство Москвы, проект Цифровая экосистема Москвы;\n ФНС России;\n Программа «Пушкинская карта» / АО «Почта Банк».\n\r\nНоминация «СМИ и Массовые коммуникации»: \n\n\n Телеканал 360;\n Медиахолдинг Independent Media;\n АО «Коммерсантъ».\n\r\nНоминация “Образование и Кадры”:\n\n\n Правительство Москвы, проект “Московская электронная школа” (МЭШ);\n Проект программы “Сбер для детей и родителей” совместно с Rambler&Co;\n ООО “Цифровое образование”, проект ИКОП “Сферум”;\n Образовательная платформа “Нетология” (ООО “Нетология”);\n Компания Samsung Electronics.\n\r\nНоминация «Наука, технологии и инновации»:\n\n\n Gett;\n Иннотех;\n Skillbox ;\n Промобот;\n SberDevices ;\n Билайн.\n\r\nНоминация “Культурные проекты в Сети”:\n\n\n Общественное телевидение России;\n Проект “Путь героя” информационного агентства ТАСС и киностудии “Союзмультфильм”;\n Эмпатия Манучи (авторский канал Манучарова Вячеслава);\n Федеральное государственное бюджетное учреждение культуры «Всероссийское музейное объединение “Государственная Третьяковская галерея”.\n\r\nНоминация “Игровая индустрия и киберспорт”:\n\n\n Федерация компьютерного спорта города Москвы — “Московский Киберспорт”;\n ESforce Holding;\n Cybersport.Metaratings;\n MetaMMA;\n Goose Gaming.\n\r\nНоминация “Креативные индустрии”:\n\n\n Ассоциация профессиональных участников творческой экономики “Федерация креативных индустрий”;\n ООО “Гэллэри Сервис”;\n Vinci Agency;\n Проект по веб-инклюзии (Студия Артемия Лебедева).\n\r\nНоминация “Здоровье и медицина”:\n\n\n Здоровье.ру;\n Проект „Здоровое Питание“ (Федеральная служба по надзору в сфере защиты прав потребителей и благополучия человека);\n Правительство Москвы, проект по использованию технологий компьютерного зрения на базе искусственного интеллекта (ИИ) для анализа медицинских изображений.\n\r\nНоминация “Экономика и бизнес”:\n\n\n СберМаркет;\n Balance Platform;\n Московская биржа;\n Метарейтинг.\n\r\nНоминация “За развитие среднего и малого бизнеса в Рунете”: \n\n\n Портал для предпринимателей Smallbusiness.ru;\n ПАО „МТС“, проект “Знаем лично”;\n Банк ВТБ ПАО, проект интернет-банк.\n\r\nНоминация “#СЧАСТЬЕЕСТЬ”: Автономная некоммерческая организация по развитию экологических, социальных и патриотических проектов „Сад Памяти“.\n\r\nНоминация “Развитие внутреннего туризма”: \n\n\n Проект Oh My Град;\n Россия: 85 приключений, проект онлайн-медиа Russia Beyond, входящее в телесеть RT;\n АНО “Проектный офис по развитию туризма и гостеприимства Москвы” Туристический сервис RUSSPASS;\n Комитет по туризму города Москвы, проект Discovermoscow.com.\n\r\nНоминация “Открытые коммуникации”:\n\n\n Мэр Вологды — Сергей Воропанов;\n Правительство Тульской области;\n Федеральное агентство по туризму, портал Russia.travel.\n\r\nНародном голосовании премии Рунета 2021 были выбраны такие лауреаты: \n\n\n в номинации “КТО”: Дмитрий Спиридонов;\n в номинации “ЧТО”: Forza;\n в номинациилучший цифровой регион (номинация “Где”): город Москва.\n\r\nВдобавок за персональный многолетний вклад в развитие интернет-отрасли награду премия Рунета 2021 получил экс-глава Роспечати Михаил Сеславинский. \n\n\n\r\nВ этом году Хабр также подавал заявку на участие в премии Рунета в номинации «Креативные индустрии». Заявлен был наш конкурс «Технотекст». Мы не стали лауреатами, но вошли сперва в шорт-лист, а затем и в число финалистов рядом с очень серьёзными соперниками. Описание заявки Хабра можно посмотреть на странице сайта конкурса.", {"day": "8", "month": "декабря", "time": "09:30"}, {"rate": 6, "views": 2300}], ["В Яндекс.Практикум приходят учиться с разным уровнем подготовки. Среди студентов есть те, кто только начинает карьеру в IT, с нулевым опытом, так и те, кто уже работает в сфере, но хочет перейти с позиции джуниора на мидла. \n\r\nМногие приходят с желанием сменить место работы: получить должность в определённой компании или просто найти то место, где будет комфортно. Чтобы достичь такой цели, нужно не только успешно закончить обучение, но и грамотно подготовиться к этапу собеседований. \n\n\n\r\nМы собрали несколько историй от выпускников Практикума, которые после курса «Мидл фронтенд-разработчик» устроились на работу мечты: кем они работали ранее, почему пошли на курс и что могут посоветовать разработчикам в поисках работы. \n\r\nИм слово.\n\nАнтон Субботин, Яндекс.Практикум\r\nНа свою предыдущую работу я пришёл в качестве интегратора — это был мой первый опыт взаимодействия с IT-продуктами. В мои обязанности входили раскатка продуктов на клиентов, постановка задач, контроль их выполнения и другие менеджерские дела. То есть когда клиент попадал из воронки продаж в CRM, надо было настроить трекинг, проследить, чтобы для него был готов дизайн, презентовать продукт, питчить, общаться — всё это было на мне.\n\r\nК тому же я был единственным человеком в команде. Не скажу, что клиентов было много, но в таком случае знания не распространяются внутри команды — никакого чувства локтя. А когда команда выросла, я уже ушёл из интеграции.\n\r\nМесяцев через семь меня захотели перевести на позицию фронта. Но не потому что карьерный рост, а потому что предыдущий фронт решил уйти. Руководство решило не искать фронтов на стороне, а взять меня. Было, прямо скажем, нервно, потому что опыта у меня было мало, а ответственности привалило с запасом.\n\r\nКогда я понял, что развивать особо нечего, а команду расширять не планируется, я пошёл в Практикум. До этого у меня был опыт прохождения курсов на HTML Academy. \n\r\nПрошёл вводное тестирование, начал заниматься, прошёл первый одиночный модуль и уехал в отпуск на Кипр. Там проветрил голову, а когда вернулся — приступил к командному модулю, где у меня впервые в жизни появилась фронтенд-команда. И мы хорошо сработались. У нас отлично выстроились процессы по Agile, были чёткие проектные задачи, всё делали с нуля и вместе. В общем, было круто.\n\r\nК финалу курса я значительно подтянул софт-скилы — команда же. Харды тоже улучшились — CI/CD, NGINX, да и вообще весь командный модуль был для меня в новинку. И эти же знания помогли на собеседованиях — я понял, как быстро делать интерфейсы на React.\n\r\nПомимо просмотра этих ваших интернетов в поиске типичных задач повторял теорию на Javascript.info. Делал акцент на те части, где у меня были ощутимые пробелы, например, в работе с промисами, так как не имел дела с запросами на основной работе. Дополнительно читал документацию по React по той же причине. В итоге оказалось, что не зря: вопросов и по тому и по другому было достаточно много.\n\r\nПосле основного курса мне написали ребята из карьерного трека: обсудили желания и страхи, сферы, в которых хотелось бы работать, помогли составить резюме. После того как я его разместил на паре ресурсов, пришло немало предложений от больших компаний. Походил на собеседования, прошёл их и в итоге получил три оффера от Озона, ВТБ и Яндекса.\n\r\nМне очень помогала табличка со сложностями, которые возникали на собеседованиях. Главным для меня было не ошибаться в тех задачах, в которых косячил на предыдущих техинтервью. И отсюда закономерный вывод: прежде чем идти в крупные компании, лучше походить на разогрев в маленькие или средние.\n\r\nВ итоге я выбрал Яндекс. На финальном собеседовании с командой мне сразу стало понятно, что я смогу тут работать. Всего было пять собеседований, и на них было всё от базовых вопросов по HTML/CSS до сложной вёрстки. Финал был уже в формате личностного общения и оценки софт-скилов.\n\r\nПри подготовке к собеседованиям советую найти примерный пак вопросов, которые вам будут задавать, и хорошо его проработать. Но не стоит усердствовать и репетировать именно перед собеседованием — забьёте себе голову и занервничаете, если что-то пойдёт не по тому плану, который вы выстроили у себя в голове. Резюме лучше сделать покороче и исключить оттуда всё нерелевантное, но это лучше уточнить у знакомых HR.\n\nАндрей Артамонов, Авито\r\nПосле университета у меня было три работы: довольно долго проработал в самом вузе, потом немного в компании, которая занималась продажами через интернет, а потом уже ушёл в продуктовую разработку.\n\r\nСоответственно, мои навыки росли примерно такими же шагами: сначала администрирование сайта и работа с CMS, затем JS и React на второй работе. На третьей работе задачи были куда разнообразнее и добавилось больше коммуникаций по продукту.\n\r\nНа каждой работе я проходил курсы, после которых устраивался на новую. Так вышло и с Практикумом, где я начал заниматься в сентябре 2020-го. Тогда не приходилось особо думать и выбирать: если целиться в большие курсы для более или менее шарящих ребят, альтернативы не было. Я тщательно изучил программу курса, и мне сразу понравилось, что курс не просто про фронтенд — дополнительно рассматривались и инфраструктурные вопросы, связанные с бэкендом.\n\r\nОценка подобных курсов и полученных на них навыков — штука субъективная. На работе мне не хватало обратной связи, а в Практикуме нашей команде достался отличный ментор — опытный разработчик, проработавший в нескольких крупных компаниях. Что-то полезное для себя можно было извлечь даже из простого общения с ним. \n\r\nЧто же касается поиска работы после курсов, то я не откликался на все вакансии скопом. Меня давно интересовала работа в Авито. Компания — лидер в своей отрасли, значит, задачи и цели у неё соответствующие. Насчёт сложности собеседования особо ничего сказать не могу. Кроме того, что я его прошёл.\n\r\nВ Авито у меня было два технических собеседования. Первое — скоринговое, примерно на полчаса. На нём задавали вопросы без особого погружения в проблематику. Сейчас в процессе скоринга могут предложить решить несложную задачку. \n\r\nВторое собеседование — на два часа. На нём проверяют глубину знаний, задачек становится больше, и сами они сложнее. Темы на обоих собеседованиях примерно одни и те же — чистый javascript и то, что около него, например, клиент-серверное взаимодействие и безопасность. В Практикуме последним уделяется достаточное внимание. \n\r\nКстати, у Авито есть интересный репозиторий на Гитхабе. Там можно почитать про этапы собеседования, инженерные грейды и другие внутренние штуки, которые могут быть интересны потенциальным кандидатам.\n\r\nЧто касается подготовки к собеседованию, то сейчас есть много способов настроить себя на них. На ютьюбе можно найти записи тренировочных и настоящих собеседований и посмотреть, какие вопросы на них задают. Можно и даже нужно порешать задачки на Codewars и LeetCode. А ещё можно пройти мок-собеседование в Практикуме. \n\r\nЕсли вы хотите найти отличную работу, могу посоветовать следующее:\n\n\nпостарайтесь, чтобы вам по-настоящему было интересно то, чем вы занимаетесь;\nсистематизируйте свой путь программиста и разделите его на этапы. На каждом будет своя цель, достижение которой можно точно спланировать;\nважно общаться с другими разработчиками. Не только с менторами, но и с ребятами, которые прямо сейчас вместе с вами что-то изучают;\nпостоянно развивайтесь, постоянно. Веб сейчас занимается именно этим — не отставайте.\n\n\nКирилл Пономарёв, Авито\r\nДо Практикума я работал разработчиком в промышленной компании. Я выполнял множество разных задач фулстек-разработчика, вдобавок работая с более отвлечёнными штуками типа макросов в Excel. В общем, такой разнорабочий от IT: и фронтенд запилить, и бэк доделать, и таблички распарсить. Все задачи были довольно сложными, но по фронту — самые серьёзные, включая вёрстку дашбордов со сложными графиками.\n\r\nСистемной возможности учиться на этой работе у меня не было. Оставалось только самообразование, потому что никаких корпоративных курсов не предполагалось. К тому же не было коллег, у которых можно было бы проконсультироваться или набраться опыта в плане фронта.\n\r\nЯ пошёл в Практикум, чтобы понять для самого себя, я уже мидл или ещё нет. Выбрал курс фронтового мидла — хотел посмотреть, как оценят мой код, получить по нему обратную связь. Оказалось, что код я пишу вполне себе мидловый, а значит, можно смело менять работу.\n\r\nСам курс очень помог мне систематизировать знания. Помогла и подборка литературы — не скажу, что я осилил её целиком (нет, не осилил), но при подготовке к собеседованию это мастхэв. Как ни странно, у меня были пробелы в алгоритмах. Заполнить их помогли задачки на LeetCode и мок-собесы.\n\r\nПосле прохождения курса я воспользовался помощью команды Практикума в плане трудоустройства: мне помогли оформить резюме и провели полезные тренировочные собеседования по хард- и софт-скилам. У меня было три мок-собеседования, на которых я решал алгоритмические задачи. Сразу скажу, что в какую-то конкретную компанию я не целился, целью было именно проверить, могу ли я рассчитывать на мидловские позиции. \n\r\nВ итоге я выбрал Авито, потому что компания максимально подходила под мои внутренние установки: я хотел полную удалёнку, но при этом иметь возможность набираться опыта от коллег. А ещё хотел именно в продуктовую компанию.\n\r\nНа собеседовании было много из того, что мы проходили в Практикуме: безопасность на фронте, сетевое взаимодействие. Без подготовки не факт, что я бы это осилил. По теории было стандартно: поднятие, замыкание, контекст вызова, event loop. В статье «70 вопросов по js для подготовки к собеседованию» упомянуты все необходимые вопросы, но иногда для глубокого понимания искал информацию на learn.javascript.ru.\n\r\nЗадачки по js разбирал с помощью статей на Хабре — вот первая и вторая части. Задачки по алгоритмам разбирал на LeetCode. Также было полезно повторить материалы по сетевому взаимодействию.\n\r\nВсего у меня было три встречи:\n\n\nкороткое техническое интервью в формате «вопрос — ответ», оно заняло полчаса;\nдвухчасовое техническое собеседование, где было много теории и лайвкодинг с задачками по js и алгоритмам;\nфинал с техлидом команды и HR — поговорили про мой прошлый опыт и про то, как устроены процессы в команде, с которой будем работать. \n\r\nЧерез пару дней после финального собеседования мне сделали оффер.\n\r\nСейчас у меня испытательный срок в Авито. Могу сказать, что это ощутимый рост по сравнению с предыдущей работой. В текущем месте процессы прозрачны и хорошо отлажены, поэтому работать достаточно комфортно.\n\nАлексей Щеглов, Яндекс\r\nМой бэкграунд не самый технический — я был преподавателем английского языка. В сферу IT попал через компанию Kameleoon, мы занимались A/B-тестированием. Там было сложно с фреймворками — это был чистый JS-мир. И месяцев через 10 я понял, что хорошо бы подучить фреймворки и по возможности сменить работу. Обзор вакансий давал понять: Angular, Vue и фреймворки востребованы. Так я и начал искать себе курсы по теме.\n\r\nДо этого, само собой, прошёл курсы на Coursera и HTML Academy и просмотрел кучу обучающих видео на ютьюбе. Курс Практикума — один из немногих с углублением по теме и хорошо нацеленный на мидла. К слову, я не считал себя мидлом в то время, но это и было интересным: посмотреть, как работает мидл, что он должен знать и уметь, какие требования будут предъявлять. \n\r\nНа курсе мне было тяжелее, чем всем остальным, потому что у ребят уже были хоть какие-то навыки в плане фреймворков и более или менее релевантный опыт в бэке, а у меня — нет. А самым сложным были всякие околопрограммистские штуки про сборку и архитектуру. Изучать это самостоятельно довольно тяжело, как и проектировать без опыта. В общем, я бы советовал этот курс тем, у кого уже есть хотя бы год–полтора живого опыта — другими словами, если вы уже знаете, как собираются проекты и как работать с гитом.\n\r\nЯ уделял учёбе около 20 часов в неделю, но порой это время доходило и до 30. Дополнительно сидел с задачами и на выходных. Самый главный плюс для меня — карьерный трек и помощь с нахождением работы. Эйчары вышли на связь за неделю до окончания курса, мы обсудили, как улучшить резюме. В четверг я его обновил, а в пятницу начал получать отклики от компаний, включая Яндекс.\n\r\nПоиск работы и прохождение собеседований оказались для меня довольно простыми. Помогли мок-интервью Практикума — приобрёл уверенность. На собеседованиях были вопросы по RLE, всякие задачи на замыкания, вёрстка. Я не особо готовился, всего лишь немного освежал теорию. По итогу мне пришли офферы из Озона, Иннотеха и ещё пары компаний. \n\r\nМогу дать один главный совет: не спешите с собеседованиями в большие компании. Можно отложить их на пару недель и потренироваться на кошках: походите на собеседования в небольшие компании на похожие должности. Там будут похожие задачи, поэтому вы сумеете немного набить руку, и То-Самое-Большое-Собеседование уже не будет таким страшным и волнительным.\n\r\nСделайте себе сводную табличку с собеседованиями, по которым ходите, вроде календаря. Даты будут на виду, если вам потребуется куда-то втиснуть внезапное новое собеседование. А ещё вы сможете постфактум писать в табличку свои впечатления и сравнивать их: условия труда, зарплату, команду и коллектив, продукт, первые впечатления от компании и прочее. Это очень поможет в выборе.\n\nО трудоустройстве в Практикуме\nОльга Клочкова \nПродакт-менеджер курса и карьерной программы «Мидл фронтенд-разработчик»\n\r\nПроцесс трудоустройства мидлов отличается от трудоустройства тех выпускников, которые только начинают свой путь в профессии. Во втором случае у студента нет опыта работы, и ему очень важно получить ту самую первую работу по новой специальности. Необязательно рассматривать её на долгие годы — важно просто открыть дверь в коммерческую разработку.\n\r\nКарьерная программа после курса «Мидл фронтенд-разработчик» строится из расчёта, что выпускникам необходимо менять работу и строить дальнейший план развития, уже находясь в сфере разработки. Поэтому мы ввели в курс карьерные консультации, тестовые технические интервью, а также поддержку куратора.\n\r\nКарьерные консультации проходят в два этапа: сначала выпускник тренирует свои навыки самопрезентации и отвечает на вопросы по оценке софт-скилов. Потом консультант помогает определиться с желаемой позицией, проанализировать рынок и построить стратегию поиска новой работы. \n\r\nС помощью материалов карьерной программы выпускник составляет резюме и оформляет портфолио. Сделать хорошее и цепляющее резюме непросто, но вполне возможно — в этом снова помогает консультант. Резюме для мидл-разработчика важно тщательно продумывать — высока вероятность, что вас могут спросить за каждое слово в нём.\n\r\nЗатем студент проходит мок-интервью — это тестовое собеседование с техническим специалистом. Они помогают обрести уверенность и получить фидбек по слабым зонам. Всё это позволяет прийти на живые собеседования более подготовленным. \n\r\nРынок фронтенд-разработки вырос, поэтому на одного разработчика, как правило, охотятся несколько крупных компаний и агентств. Важно найти место, которое поможет разработчику перейти на следующую ступеньку в развитии, даст посильные карьерные вызовы и приведёт в сильную команду. \n\r\nКроме того, зарплата заметно разнится от вакансии к вакансии. Здесь важно уметь оценивать предложение в годовом скоупе: учитывать бонусы, опционы, премии, плюшки вроде ДМС и стоматологии, а ещё вклад компании в развитие самого разработчика. \n\r\nНа собеседованиях рекрутеры будут смотреть не только на хард- и софт-скилы мидл-разработчика, но и оценивать его персональные качества. Именно поэтому в крупных продуктовых компаниях финальные собеседования обычно не связаны с проверкой технических знаний — кандидат просто общается с командой. Здесь важно не только рассказывать, но и задавать вопросы — про команду, про процессы и проект. Так вы проявите свою компетентность: вы не соглашаетесь на абы что, оцениваете комфорт и примеряете корпоративную культуру. В свою очередь команда смотрит, насколько им будет комфортно работать с вами. \n\r\nИ последний совет: не стоит недооценивать развитие софт-скилов. Чем лучше они прокачаны, тем больше вероятность получить оффер по верхней границе зарплатной вилки.\n\r\nПомните, хорошая работа не приходит сама по себе. Мало просто освоить навыки программирования, чтобы получить оффер на желаемую должность — нужно научиться подавать себя потенциальным работодателям.\n\nСоветы\n\nПовторите теорию на Javascript.info. Сделайте акцент на тех частях, где у вас есть ощутимые пробелы.\nПорешайте задачи на Codewars, LeetCode и learn.javascript.ru.\nСделайте таблицу, куда будете записывать сложности, которые возникали на собеседованиях, чтобы в дальнейшем их проработать.\nПрежде чем идти в крупные компании, лучше походить на разогрев в маленькие или средние.\nНайдите примерный пак вопросов, которые вам будут задавать, и хорошо его проработайте. \nНе репетируйте ответы перед собеседованием: если что-то пойдёт не по тому плану, который вы выстроили у себя в голове, вы станете больше нервничать. \nИсключите из резюме нерелевантный опыт. Тщательно продумайте его содержание, потому что спрос с мидлов выше, чем с джуниоров.\nНайдите на ютьюбе записи тренировочных и настоящих собеседований и посмотрите, какие вопросы на них задают. \nНе забывайте о софт-скилах.\nУчитесь правильно оценивать свои навыки, чтобы не потерять в зарплате.", {"day": "5", "month": "октября", "time": "15:25"}, {"rate": 15, "views": 8400}], ["Привет, Хабр! Меня зовут Анна Лунева, я руководитель направления по работе с брендом работодателя в ГК «Иннотех». Это группа компаний, которая занимается разработкой высоконагруженных фронтальных решений, омниканальных продуктов, систем искусственного интеллекта и мобильных приложений для банковской сферы.\n\r\nМы постоянно ищем сильных ИТ-специалистов, которым можно доверить сложные задачи. Один из основных методов привлечения нужных нам профессионалов – хакатоны. Только за последние полгода мы провели уже два. Подробнее о них я расскажу ниже. Ну а в целом давайте поговорим о том, как разработчику наняться в хорошую компанию, приняв участие в хакатоне.\n\nДля чего нужны хакатоны?\r\nВсе знают, что хакатоны появились в хакерской среде еще в 90-х, а позже стали распространенной формой состязания между разработчиками, боровшимися за призы организаторов. С годами этот формат мероприятий превратился в большой бизнес. Вспомним хотя бы пример проекта GroupMe, который родился именно на хакатоне, организованном TechCrunch, а позже был продан корпорации Microsoft за $85 млн. Со временем хакатоны распробовали многие крупные компании, которые теперь используют в своих интересах. Вот некоторые из них.\n\nПоиск новых идей\n\r\nНесмотря на то, что крупные компании обладают огромными возможностями и ресурсами, иногда им необходимы свежие мысли на тему дальнейшего развития продуктов. Как бы талантливы ни были штатные сотрудники, у них тоже в какой-то момент заканчиваются прорывные идеи. А бизнес живет, только пока растет. Для продолжения экспансии нужны новые ответы на старые вопросы. И в такой ситуации лучше обратиться за «помощью зала».\r\nЧасто бывает, что в таком случае компании проводят внутренние хакатоны, приглашая на них собственных сотрудников из разных департаментов. Тестировщик может неожиданно что-то предложить разработчикам и наоборот. Это работает и дает хороший результат. В других случаях компания объявляет внешний конкурс, хорошими наградами привлекая сторонних специалистов. Далее, если нужная идея получена, то ее могут поручить реализовать своим сотрудникам или нанять победителя в штат, чтобы он развивал ее уже в рамках компании.\n\nРешение сложных задач\n\r\nИногда решить какую-то задачу не так и просто, даже при наличии больших ресурсов. Нужен быстрый прорыв, который можно обеспечить мгновенной концентрацией множества умов. В этом случае организуется крупный хакатон с участием пары сотен человек, и все они работают над поставленной перед ними проблемой, конкурируя между собой.\n\r\nТакой сценарий выгоден всем – и компании, и разработчикам. Первая получает сразу несколько вариантов решения сложной задачи, причем за очень короткий срок. Вторые, в случае победы, получают установленный организатором приз, зачастую очень немаленький. Плюс, как и в предыдущем случае, участие в хакатоне может принести им новую интересную работу.\n\nПоиск ценных кадров\n\r\nПоиск специалистов в штат может являться и основной целью хакатона. Крупным компаниям всегда нужны способные специалисты. Еще в 2018 году ФРИИ предсказал, что к 2028 году стране не будет хватать двух миллионов ИТ-специалистов. И пока, похоже, прогноз сбывается. Найти профессионалов помогают задачи разного уровня сложности, который зависит от требуемых компетенций потенциального сотрудника – от джуниора до сеньора.\r\nПредставителям тех команд, которые качественно и в срок решают поставленные задачи, делают привлекательные офферы. Иногда работу предлагают всей команде, если им и в дальнейшем предстоит сообща работать над одним проектом.\n\r\nЧто касается ГК «Иннотех», мы преследуем еще одну цель – повышение нашей репутации среди ИТ-специалистов, многие из которых регулярно участвуют в хакатонах для оттачивания своих навыков и повышения компетенции. А еще им, как и нам, нужна реклама. Собственно, почему бы и нет?\n\r\nЗа полгода мы провели два хакатона. Первый, INNOHACK, состоялся в конце ноября и продолжался два дня. На него мы привлекли разработчиков, аналитиков, тестировщиков и UA/UX-дизайнеров, из которых и были составлены команды. Нам тогда необходимо было найти разработчиков Java и JS уровней мидл и сеньор. Мы с этой задачей справились.\n\r\nВторой хакатон прошел этим летом и длился уже три дня – с 18 по 20 июня. Он назывался INNOHACK 2 и стал гораздо более масштабным. В нем приняли участие 400 специалистов из 75 городов. Призовой фонд составил 1,2 млн рублей. Экспертное жюри включало 30 ведущих в своей сфере профессионалов, которые помогали участникам придумывать, разрабатывать и упаковывать их идеи.\n\r\nЕсли участники первого хакатона решали одну общую задачу, то те, кто принял участие во втором, могли выбрать для себя одно из пяти актуальных направлений: информационную безопасность, банковский сектор, HR (поиск потенциальных кандидатов), UA/UX (генерация форм) и инвестиции (онлайн-маркет для поиска инвесторов).\n\nКак готовиться к хакатону?\nКоманда\n\r\nОбычно в хакатонах принимают участие команды, в состав которых входят специалисты разного профиля. В некоторых случаях составлять команды помогают организаторы мероприятия, но такая практика не очень распространена. Чаще в конкурсе участвуют уже сработавшиеся коллективы, состоящие из разработчиков, тестировщиков, дизайнеров, аналитиков и продакт-менеджеров. Профиль специалистов может меняться в зависимости от направленности хакатона и задачи, которую нужно решить.\n\r\nСобрать команду, если ее нет, не так уж и сложно. В этом отлично помогают профильные форумы, тематические группы и чаты в социальных сетях и мессенджерах. Есть даже специализированные сообщества, которые занимаются подбором команд. Если вы уже являетесь сотрудником технологической компании, можете попробовать собрать команду среди коллег.\n\nМоральная и профессиональная подготовка\n\r\nВ ходе хакатонов чаще всего приходится решать действительно сложные задачи, которые могут быть неожиданностью для участников. Чтобы быть готовым ко всему, стоит изучить мероприятия, которые уже проходили – их профиль, задачи, решения участников и т.п. Причем речь идет не только о российских хакатонах, но и зарубежных – из США, Европы и других стран.\n\r\nСейчас, в эпоху пандемии, большинство мероприятий проводится онлайн. А значит, если вы в достаточной степени владеете английским языком, то можете потренироваться, приняв участие практически в любом хакатоне, которые теперь можно выбирать, как товары в интернет-магазине.\n\r\nНе менее важно подготовить оборудование и ПО: проверить ноутбук, установить все необходимые фреймворки, библиотеки и пр. Для этого хорошо бы еще «на берегу» в общих чертах проработать концепцию своего проекта. Когда начнется мероприятие, будет уже не до того, и если проект заведомо нежизнеспособен, то выбыть из числа участников, к сожалению, можно еще до завершения хакатона.\n\r\nЕще нужно быть готовыми к импровизациям. Не работает выбранное ранее решение – разработайте другое, пусть оно и будет менее зрелым. Стрессоустойчивость и способность к импровизации часто помогают занять одно из призовых мест.\n\nУзнать все об организаторах\n\r\nДля того, чтобы идея и реализация предлагаемого проекта понравилась организаторам, стоит узнать о них побольше. Что за компания проводит мероприятие, какие задачи решает, что для нее наиболее актуально? Кстати, если среди судей есть эксперты, которые известны пристрастием к определенным технологиям, можно пробовать сделать их частью своего проекта. Конечно, если это применимо в вашем случае.\n\nНайм участников хакатона\n\r\nКомпании-организаторы часто хантят победителей. Оффер может получить вся команда или какая-то ее часть. Но не надо думать, что победа обязательна. Бывает и так, что влиться в коллектив компании предлагают членам проигравших команд. Возможно, кто-то предложил интересную идею, или показал очень высокий уровень профессионализма в актуальной для компании отрасли – все это влияет на вероятность получения оффера.\n\r\nСейчас в ГК «Иннотех» работает более 3500 профессионалов в сфере ИТ и постоянно открыто около 300 вакансий. Для нашей компании идеальный вариант – когда на работу приглашается около 10% участников хакатона. У других организаций процент может быть выше или ниже – все зависит от дефицита специалистов определенного профиля.\n\r\nВывод же из всего этого простой: если вы хорошо подготовились и проявили себя, то вероятность, что вы получите предложение о работе, гораздо выше нуля. Конечно, это актуально для тех случаев, когда компания в принципе стремится кого-то найти. Но об этом несложно узнать – организаторы обычно рассказывают о своих целях и намерениях в условиях хакатона. Если там есть пункт о возможности найма – можно смело подавать заявку и начинать готовиться.", {"day": "13", "month": "сентября", "time": "12:58"}, {"rate": 4, "views": 1200}], ["Подборка мероприятий на неделю\n\nBlockchain Z-Days 2021\n\n14 июня (понедельник) — 17 июня (четверг)\nонлайн\nбесплатно\nBlockchain Z-Days 2021 — это глобальная онлайн-конференция, которую организовывает сообщество IT-профессионалов. Участники смогут присоединиться к более чем 20 докладам о прогрессивных технологиях, которые базируются на знаниях и реальным опыте спикеров.\n\nHydra 2021\n\n15 июня (вторник) — 18 июня (пятница)\nонлайн\nот 10 000 р.\nКонференция по разработке параллельных и распределенных систем Hydra 2021 — 15-18 июня.\r\nВас будет ждать 4 дня докладов обо всем, что касается работы в этой сфере.\n\n.Net Кухня\n\n15 июня (вторник) — 17 июня (четверг)\nонлайн\nбесплатно\nПриглашаем тех, кто работает в .NET или интересуется этой сферой, в гости на .NET-кухню. вместе с эксперами из ижевского EPAM будем разбираться в ингредиентах, миксовать компоненты, узнавать лайфхаки, чтобы было вкусно!\n\nКак освоить методологию создания новых продуктов и поиска точек роста\n\n15 июня (вторник)\nМясницкая 13с18\nбесплатно\nМероприятие будет полезно лидерам бизнес-подразделений, продакт-менеджерам, project-менеджерам, agile-коучам, скрам-мастерам, консультантам.\n\nOnline LoGeek Night: QA Automation\n\n17 июня (четверг)\nонлайн\nбесплатно\nНа митапе специалисты компании Luxoft в области QA Automation поделятся своим опытом и расскажут о минусах и плюсах двух способов хранения тестовых данных с примерами на Java. А также раскроют тему автоматизации высокоуровневого тестирования ПО максимального уровня безопасности для авионики.\n\nDevOps MeetUp\n\n17 июня (четверг)\nУниверситетская 7\nбесплатно\nВ четверг 17 июня собираемся в Иннополисе, чтобы вместе со спикерами из Provectus и Skyeng узнать все про GitOps и Deploy. Также будет организована онлайн-трансляция.\r\nСпикеры:\r\nРустам Гимадиев, Senior DevOps Engineer из Provectus, расскажет, как построить инфраструктуру так, чтобы любой с доступом в Git мог внести изменения и получить актуальное состояние, поговорим про kubernetes, terraform и argocd/flux/tektoncd.\n\nOnline Frontend meetup\n\n17 июня (четверг)\nонлайн\nбесплатно\nСпикеры\r\n-Иван Соловьев, Teamlead Evrone — Как полюбить Snowpack\r\nРасскажу почему стоит использовать Snowpack, как я дошёл до этого и на какие грабли напоролся.\r\n-Борзунов Игорь, Frontend-разработчик, Росбанк — В жизни вашего проекта не хватает WebGL\r\nВ данном выступлении я хочу показать то, как на наших с вами глазах видоизменяется веб, а именно — в сторону WebGL. \n\nХакатон INNOHACK 2.0\n\n18 июня (пятница) — 20 июня (воскресенье)\nонлайн\nбесплатно\nГК «Иннотех» объявляет о старте регистрации на второй онлайн хакатон INNOHACK 2.0 с общим призовым фондом 1 200 000 рублей.", {"day": "14", "month": "июня", "time": "10:06"}, {"rate": 1, "views": 554}], ["ГК «Иннотех» — группа компаний, которая занимается разработкой высоконагруженных фронтальных решений, омниканальных продуктов для банковского рынка, внедрением ИИ в банковские продукты и созданием мобильных продуктов.\n\r\nЗадач чрезвычайно много, причем в самых разных направлениях. Для того, чтобы привлечь к их решению талантливых специалистов, способных предложить новые идеи, «Иннотех» проводит хакатон, уже второй по счету. Называется он INNOHACK 2.0. Подробнее — под катом.\n\nКогда был первый хакатон?\nОн проводился осенью 2020 года, понятно, в онлайн-режиме. Тогда цель была одна — создание сервиса для идентификации по фотографии клиентов банка и сбора их финансового профиля из разных открытых источников.\n\nА что теперь?\r\nВторой хакатон будет гораздо масштабнее первого, просто потому, что и задач, которые нужно решать, накопилось больше.\n\r\nINNOHACK 2.0 включает в себя 5 актуальных бизнес-задач, отобранных экспертами ГК «Иннотех»:\n\n\nГеймификация обучения. Создание геймифицированного приложения для обучения сотрудников.\nИнформационная безопасность. Поиск и определение фишинговых сайтов.\nГенерация форм.  Создание динамического конструктора форм.\n Маркет для поиска инвесторов. Создание маркета для поиска инвесторов и свободного размещения средств пользователями.\nМетчинг потенциальных кандидатов. Обработка резюме с источника/находящихся в открытом доступе.\n \r\nСейчас началась регистрация на хакатон. Его общий призовой фонд — 1 200 000 рублей. Призовой фонд каждого кейса — 240 000 рублей. \n\nКто может участвовать?\r\nПрофиль задач и требования к решениям хакатона предполагает участие:\n\n\n Backend разработчики;\n Frontend разработчики;\n Системный аналитик;\n DevOps;\n QA;\n UI/UX.\n \r\nВкусные офферы от ГК «Иннотех» прямо во время хакатона или сразу после участникам, проявившим себя с лучших и профессиональных сторон.\n\nРекомендации участникам:\n\n\n Соберите команду из коллег, друзей и единомышленников.\n Если нет команды, то можно найти ее на платформе хакатона — там есть информация о всех командах и участниках. Если не нашли, мы поможем найти самых крутых тиммейтов. Просто напишите нам:).\n Не пропустите дедлайн регистрации 15 июня.\n Будьте рядом с высокоскоростным интернетом и обеспечьте наличие веб-камеры и микрофона во время онлайн-хакатона.\n \nНу окей, а когда начало?\r\nУже совсем скоро, времени осталось не так много. Открытие хакатона и публикация подробной информации по задачам для участников состоится 18 июня в 19:00 по московскому времени. Финал хакатона — 20 июня в 15:00 по мск. Ну а закрытие — в тот же день, в 21:00.\n\r\nЗарегистрироваться можно по этой ссылке, дополнительная информация по хакатону — здесь.", {"day": "10", "month": "июня", "time": "13:33"}, {"rate": 3, "views": 692}], ["Подборка мероприятий на неделю\n\nHolyJS 2020 Moscow: Большая конференция для JavaScript-разработчиков\n\n25 ноября (среда) — 28 ноября (суббота)\nонлайн\nот 16 000 р.\nHolyJS 2020 Moscow станет деcятой по счету специализированной конференцией по JS, проводимой JUG Ru Group. Более 1000 JS-разработчиков соберутся в онлайне, чтобы обсудить новости стремительно развивающейся экосистемы, свежие инструменты, фреймворки, паттерны и сотни изменений с экспертами со всего мира и услышать несколько десятков докладов о фронтенде и не только. Коснемся и бэкенда, и десктопа.\n\nJoker 2020\n\n25 ноября (среда) — 28 ноября (суббота)\nонлайн \nот 16 000 р.\nJoker — техническая Java-конференция для опытных разработчиков и тимлидов.\r\nJoker — это четыре дня, четыре трека и четыре десятка технических докладов, которые вы сможете обсудить с 2000 коллегами-участниками конференции.\r\nОсновные темы: производительность, concurrency, тестирование, распределенные системы и высокие нагрузки в мире Java, а также будущее платформы.\n\nОнлайн-хакатон Changellenge >> Hack&Change\n\n27 ноября (пятница) — 29 ноября (воскресенье)\nонлайн\nбесплатно\nHack & Change от Changellenge >> — первый хакатон, сосредоточенный на процессе. На твой профессиональный рост повлияет не результат соревнования, а то, что ты получишь во время участия. Тренируй навыки, практикуйся на реальных задачах, заводи знакомства с представителями топовых работодателей и круто проводи время среди единомышленников. Готов к изменениям? Тогда погнали.\n\nХакатон Flutterthon\n\n27 ноября (пятница) — 02 декабря (среда)\nонлайн\nбесплатно\nОсновная задача: создать систему виджетов спортивных событий, которые будут отображать статистику, как текущую, так и изменяющуюся в режиме реального времени. Призовой фонд 160 000 р.\n\nХакатон INNOTECH HACK\n\n28 ноября (суббота) — 29 ноября (воскресенье)\nонлайн\nбесплатно\nТебя ждет интересная задача: создать сервис для идентификации по фотографии клиентов банка и сбора их финансового профиля из различных открытых источников.\r\nИ еще:\r\n— 800 000 рублей — призовой фонд;\r\n— возможность построить карьеру в ГК «Иннотех» (компания заинтересована в крутых специалистах);\r\n— классный мерч.", {"day": "23", "month": "ноября", "time": "10:17"}, {"rate": 7, "views": 697}], ["Специалисты Центрального аэрогидродинамического института имени профессора Н.Е. Жуковского (входит в НИЦ «Институт имени Н.Е. Жуковского») приняли участие в разработке пилотажного стенда на базе промышленного робота KUKA немецкой компании KUKA Roboter. \n\r\nПрототипом экспериментальной установки стал авиационный тренажер для самолета DA-42, созданный специалистами Германского аэрокосмического центра DLR. \n\r\nЗаказчиком работ выступило АО ЦНТУ «Динамика», исполнителем — АО «ИННОТЕХ».\n\r\nУникальность проекта в том, что впервые в России промышленный робот KUKA использовался в качестве системы подвижности авиационного тренажера. \n\n\n\r\nТакая конструкция позволила превзойти классические пилотажные стенды по диапазону линейных и угловых перемещений (3,2–4,2 м против 0,8–1,3 м и ±180ᵒ против ±25ᵒ) и в конечном итоге достовернее имитировать перегрузки, действующие на летчика в полете.\n\n\n\n\r\nНа подвижную часть робота, которая обычно перемещает некрупные объекты, ученые установили универсальную кабину пилота, снабженную системой визуализации, имитаторами кабинного оборудования и сменными (самолет/вертолет) рычагами управления. \n\n\r\nНовый стенд отличается многофункциональностью — за считанные часы его можно переоборудовать из кабины магистрального самолета в кабину истребителя или вертолета.\n\r\nДля примера — стационарный комплексный тренажёр самолёта Сухой Суперджет-100:\n\n\r\nВ рамках проекта специалисты ЦАГИ разработали алгоритмы системы подвижности и модель динамики истребителя, а также провели сравнительный анализ систем подвижности нового стенда с одним из уже имеющихся. \n\r\nМоделирование различных режимов показало, что KUKA как система подвижности превосходит классические тренажеры по точности воспроизведения перегрузок и ускорений.\n\r\n«Современные тренажерные технологии достигли небывалых высот — они создают почти точную иллюзию полета. Но есть проблема — ограничение по геометрии системы подвижности. Абсолютного решения она не имеет, однако даже небольшое продвижение в этом направлении является достижением. \n\n\n\r\nИ в этом мы добились заметных успехов», — рассказал руководитель проекта — заместитель начальника отделения динамики и систем управления летательными аппаратами ФГУП «ЦАГИ», д.т.н. Андрей Бюшгенс.\n\r\nПо словам ученого, особую ценность созданной установке придает возможность более реалистичного моделирования сложных ситуаций, таких как дозаправка в воздухе, посадка на палубу авианесущего корабля, групповой пилотаж, режимы сложного пространственного положения самолета транспортной категории, а также висение и крановые операции вертолета.\n\r\nВ начале августа стенд передадут Военно-медицинской академии им. С.М. Кирова Министерства обороны Российской Федерации. \n\r\nОжидается, что установка будет использоваться для обучения и тестирования курсантов, а также при исследованиях в одной из дисциплин авиакосмической медицины (иллюзии полета).", {"day": "1", "month": "августа", "time": "06:46"}, {"rate": 18, "views": 4700}], ["В юбилейный день космонавтики в Москве открылась 2-я Международная выставка-форум «Инновации и технологии 2011». Она продолжалась три дня и на площади в пять тысяч квадратных метров собрала более тысячи идей и готовых образцов инновационных продуктов со всей России. \n\r\nВ этот раз особое внимание было уделено полету Гагарина в космос. На стендах крутились видеофильмы о спутниках, МКС, космонавтах и жизни на борту космолета. Ключевое место в экспозиции занимала площадка ракетно-космической корпорации «Энергия». Она представила изобретения самого широкого спектра — от образцов космической промышленности до трехколесных электрических мопедов.\n\n\n\r\nКроме того, большое внимание было уделено робототехнике. Самые разные образцы — от роботехнических комплексов и андроидов до евроботов и маленьких манипуляторов, собранных школьниками. На одном стенде был представлен R.Bot, разработка, которая может использоваться в множестве систем — от высотного видеонаблюдения до роботизированной полиции. На другом — несложный манипулятор, собранный девятилетним изобретателем. Он умеет различать объекты и передвигать их с места на место. Во второй день выставки на стенде Евробота развернулась демонстративная «схватка» между двумя роботами.\n\n\n\r\nИнтерактивные мобильные роботы R.BOT 100 распознает препятствия, может двигаться самостоятельно к человеку.\n\n\n\r\nАналог R.BOT-а, прототип недорог до 2к$ на стадии стартапа \n\n\n\r\nПримечательно робот собран 9-летним ребенком «Лаборатория Робототехники» г.Москва\n\r\nСреди других интересных разработок были представлены, например, литий-ионные аккумуляторы повышенной емкости, принципиально новый преобразователь энергии, особый газ, который может гасить пожары (кстати, очень актуально в свете грядущих лесных пожаров), системы удаленного присутствия и многие другие.\n\r\nТакже в рамках выставки стартовал «Салон изобретений» — около шестидесяти малых инновационных предприятий, частных изобретателей и молодых ученых из самых разных сфер представили свои разработки. Среди них будут отобраны несколько проектов и рекомендованы потенциальным инвесторам. \n\r\nПо итогам Иннотеха 2011 «Российская венчурная компания», один из организаторов выставки, планирует создать кластерный фонд иформационно-телекоммуникационных технологий, робототехники, мехатроники и интеллектуальных систем. Предполагается, что объем фонда составит два миллиарда рублей.\n\r\n«Агентство по инновациям и развитию» участвовало в Иннотехе с собственным стендом. Мы рассказывали о нашей деятельности по оценке, отбору, сопровождению и внедрению инновационных проектов. Было приятно осознавать, то наша работа интересна такому количеству профессионалов в инновационной сфере.", {"day": "22", "month": "апреля", "time": "02:18"}, {"rate": 5, "views": 1100}]], "refs_quant": 12}