{"info": null, "refs": [["Пермская компания «Промобот» представила второй инженерный вариант человекоподобного робота Robo-C-2 с подвижными лицом, головой, шеей и руками, которые помогают устройству взаимодействовать с аудиторией и жестикулировать. Робот может двигать глазами, бровями и губами, а также поддержать разговор. \n\r\nПроизводитель пояснил, что приобрести робота модели Robo-C-2 с практически любой внешностью по желанию можно по цене от 2,8 млн рублей.\n\r\nПредставитель «Промобот» пояснил, что робот Robo-C-2 оснащен новыми сервоприводами, широким диапазоном регулирования микромимики, гиперреалистичными силиконовой кожей и глазами. Используемые для его работы алгоритмы и технологии «Промобот» позволяют Robo-C-2 воспроизводить свыше 600 вариантов микромимики человека, максимально реалистично имитируя эмоции для окружающих.\n\nМимика Robo-C-2.\n\r\nПроизводитель уточнил, что руки робота Robo-C-2 способны выдержать нагрузку до одного килограмма. Например, он может что-то взять в руку, указать направление или даже пожать руку собеседнику. Робот может работать в режимах базовой жестикуляции, двигать конечностями по команде извне или по команде инженера.\n\nНовая версия Robo-C-2 пока без ног (они в разработке, причем сразу на основе системы динамической стабилизации), но может немного поворачиваться вокруг своей оси и выполнять поклоны и другие телодвижения\n\r\nВ августе 2021 года «Промобот» представила первый вариант человекоподобного робота Robo-C, который может двигать мышцами лица, поддерживать разговор и отвечать на вопросы.\n\r\nКомпания «Промобот» основана в 2015 году в Перми. Ее роботы трудятся в 43 странах мира в качестве администраторов, промоутеров, консультантов, гидов и консьержей, заменяя или дополняя обычных сотрудников. Сейчас роботов от «Промобот» можно встретить в Сбербанке, Московском метро, Музее современной истории России, МФЦ, аэропорту Балтимор-Вашингтон и Дубай-Молле. Недавно появились версии роботов «Промобот» для проверки QR-кодов граждан,", {"day": "11", "month": "января", "time": "19:31"}, {"rate": 14, "views": 4700}], ["7 декабря состоялась церемония награждения лауреатов премии Рунета 2021 года. В этом году на премию было подано 1097 работ за вклад в развитие российского сегмента сети интернет в девять основных и четыре специальные номинации. Финалистами конкурса в каждой номинации стали по 10 организаций. \n\r\nЛауреатами премии Рунета 2021 стали 52 компании и 3 персоны. Причем раньше организаторы (Российская ассоциация электронных коммуникаций — РАЭК) награждали несколько лучших представителей в каждой из номинации, по мнению экспертного сообщества. В этом году они обратились к помощи искусственного интеллекта и добавили еще одного лауреата, который выбирался именно по мнению ИИ. \n\r\nНоминация «Государство и Общество», победители:\n\n\n Благотворительный фонд «Подари жизнь»;\n АНО «Диалог»;\n Правительство Москвы, проект Цифровая экосистема Москвы;\n ФНС России;\n Программа «Пушкинская карта» / АО «Почта Банк».\n\r\nНоминация «СМИ и Массовые коммуникации»: \n\n\n Телеканал 360;\n Медиахолдинг Independent Media;\n АО «Коммерсантъ».\n\r\nНоминация “Образование и Кадры”:\n\n\n Правительство Москвы, проект “Московская электронная школа” (МЭШ);\n Проект программы “Сбер для детей и родителей” совместно с Rambler&Co;\n ООО “Цифровое образование”, проект ИКОП “Сферум”;\n Образовательная платформа “Нетология” (ООО “Нетология”);\n Компания Samsung Electronics.\n\r\nНоминация «Наука, технологии и инновации»:\n\n\n Gett;\n Иннотех;\n Skillbox ;\n Промобот;\n SberDevices ;\n Билайн.\n\r\nНоминация “Культурные проекты в Сети”:\n\n\n Общественное телевидение России;\n Проект “Путь героя” информационного агентства ТАСС и киностудии “Союзмультфильм”;\n Эмпатия Манучи (авторский канал Манучарова Вячеслава);\n Федеральное государственное бюджетное учреждение культуры «Всероссийское музейное объединение “Государственная Третьяковская галерея”.\n\r\nНоминация “Игровая индустрия и киберспорт”:\n\n\n Федерация компьютерного спорта города Москвы — “Московский Киберспорт”;\n ESforce Holding;\n Cybersport.Metaratings;\n MetaMMA;\n Goose Gaming.\n\r\nНоминация “Креативные индустрии”:\n\n\n Ассоциация профессиональных участников творческой экономики “Федерация креативных индустрий”;\n ООО “Гэллэри Сервис”;\n Vinci Agency;\n Проект по веб-инклюзии (Студия Артемия Лебедева).\n\r\nНоминация “Здоровье и медицина”:\n\n\n Здоровье.ру;\n Проект „Здоровое Питание“ (Федеральная служба по надзору в сфере защиты прав потребителей и благополучия человека);\n Правительство Москвы, проект по использованию технологий компьютерного зрения на базе искусственного интеллекта (ИИ) для анализа медицинских изображений.\n\r\nНоминация “Экономика и бизнес”:\n\n\n СберМаркет;\n Balance Platform;\n Московская биржа;\n Метарейтинг.\n\r\nНоминация “За развитие среднего и малого бизнеса в Рунете”: \n\n\n Портал для предпринимателей Smallbusiness.ru;\n ПАО „МТС“, проект “Знаем лично”;\n Банк ВТБ ПАО, проект интернет-банк.\n\r\nНоминация “#СЧАСТЬЕЕСТЬ”: Автономная некоммерческая организация по развитию экологических, социальных и патриотических проектов „Сад Памяти“.\n\r\nНоминация “Развитие внутреннего туризма”: \n\n\n Проект Oh My Град;\n Россия: 85 приключений, проект онлайн-медиа Russia Beyond, входящее в телесеть RT;\n АНО “Проектный офис по развитию туризма и гостеприимства Москвы” Туристический сервис RUSSPASS;\n Комитет по туризму города Москвы, проект Discovermoscow.com.\n\r\nНоминация “Открытые коммуникации”:\n\n\n Мэр Вологды — Сергей Воропанов;\n Правительство Тульской области;\n Федеральное агентство по туризму, портал Russia.travel.\n\r\nНародном голосовании премии Рунета 2021 были выбраны такие лауреаты: \n\n\n в номинации “КТО”: Дмитрий Спиридонов;\n в номинации “ЧТО”: Forza;\n в номинациилучший цифровой регион (номинация “Где”): город Москва.\n\r\nВдобавок за персональный многолетний вклад в развитие интернет-отрасли награду премия Рунета 2021 получил экс-глава Роспечати Михаил Сеславинский. \n\n\n\r\nВ этом году Хабр также подавал заявку на участие в премии Рунета в номинации «Креативные индустрии». Заявлен был наш конкурс «Технотекст». Мы не стали лауреатами, но вошли сперва в шорт-лист, а затем и в число финалистов рядом с очень серьёзными соперниками. Описание заявки Хабра можно посмотреть на странице сайта конкурса.", {"day": "8", "month": "декабря", "time": "09:30"}, {"rate": 6, "views": 2300}], ["Эмоциональный робот ЮляЧто такое мультимодальность?В самом термине заложено, что это симбиоз множества способов извлечения смысла. На сегодняшний день это множество включает в себя следующее:устная речьписьменные источникиаудиоканалыжестытактильная информациявизуальные каналыпространственное восприятиеполученный предыдущий опытПоследнее добавляет в плоскостную структуру мультимодальности ещё и ось времени. Теперь попробуем понять, насколько хорошо робот может обрабатывать все перечисленные типы информации. И забегая вперед, можно сказать, что каждый из каналов по отдельности роботы научились обрабатывать уже с достаточно высоким качеством, а в некоторых случаях модели распознавания превосходят в этом даже человека. Однако собирать полученную информацию со всех каналов в “точке смысла” умеет лишь человек, и на вопрос как он это делает в научных и промышленных кругах пока нет полного и однозначного ответа.Мы в команде Промобот пробуем определить подход в разработке мультимодальности, отвечающий пользовательским требованиям, предъявляемым к современным человекоподобным роботам.Что такое человекоподобный робот?Робот Юля (Промобот)Понятие \"Человекоподобный робот\" имеет ряд определений в научной литературе в зависимости от области исследования и сферы применения. Например, в исследованиях по мехатронике наиболее часто встречающимися будут термины Automaton и Mechanical doll. В робототехнике мы используем Machine Human, Simulation robot, Beauty robot. В трудах по философии  можно встретить – Lifelike robot, Realistic robot. А в социологии – Human-like, Humanoid, Antropomorphic, Avatar. В научной фантастике роботов разделяют даже по половому признаку. Так Android (робот-мужчина), Gynoid (робот-женщина), Droid (робот среднего рода) и Cyborg (кибернетический организм). Как мы видим, определений достаточно много и, возможно, этот список еще можно дополнить. Мы проводим социологические опыты по мультимодальности и поэтому будем использовать в дальнейшем термин “человекоподобный робот”.План исследованияВ широкой перспективе мы запланировали 4 этапа исследования, которое поможет создать не только схемы распознавания мультимодальных сообщений в парадигме Человек-Робот, но и оттестировать модели генерации мультимодальности в парадигме Робот-Человек. Таким образом, круг замкнется и будет оттестирована полная парадигма взаимодействия Человек-Робот-Человек.Ключ к определению схемы Человек-Робот вероятнее всего лежит в поле исследований, связанных с когнитивными моделями, теорией разума и методами HRI. Эти три направления являются основным источником идей для всех, кто хотел бы научиться делать человекоподобных роботов. Наш Топ-10 наиболее популярных открытий HRI в мире:Внешность может нести определяющее значение в том, как человек воспринимает робота. Установлено, что люди демонстрируют негативные социальные и эмоциональные реакции, а также сниженное доверие к человекоподобным роботам, если последние имеют изъяны во внешности и поведении (эффект «Зловещей долины» Масахиро Мори)Качественная имитация на роботах человеческой манеры поведения, жестов, языка тела, мимики с помощью технологий телеприсутствия способна нивелировать негативное отношение и повысить процент положительных эмоций от общения (Джон П. Уитни)В случаях, когда роботы настойчиво навязывают общение и не соблюдают «безопасное расстояние» (вторгаясь в личное пространство пользователя), человек испытает негативные эмоции и предпочтет обратиться скорее к другому человеку, чем к роботу (Чад Эдвардс)Если робот не активен совсем, это тоже способно вызывать негативные эмоции. Робот воспринимается как бесполезный, и его присутствие начинает раздражать (Хироши Исигуро)Если робот не отвечает ожиданиям пользователя, это способствует формированию негативного тренда в отношении робота. Люди вкладывают в понятие робот характеристики из научной фантастики, которые не реализованы или не реализуемы на текущем уровне развития технологий, и обязательно разочаровываются, когда реальный робот не может делать ничего из выдуманного (Чад Эдвардс)Эмоции робота как правило человек приравнивает к человеческим. И если их проявление у робота имеет изъяны это вызывает отторжение. Зловещая долина – может быть просто эффект отторжения к людям с дефектами, это заложено эволюцией (Хироши Исигуро)Если роботы используют небуквальный язык, например сарказм или иронию в некорректных случаях, люди относятся к этому с таким же снисхождением, как и в ситуации с обычными людьми и способны простить ошибки употребления (Хайме Банкс)В соответствии с гипотезой контакта (Гордон Олпорт), контролируемое (сценарное) взаимодействие с социальным роботом может уменьшить неопределенность на старте общения и повысить готовность взаимодействовать с роботомФизический контакт с роботом, прикосновения, рукопожатия со стороны пользователя уменьшают негатив, и страхи, сформированные еще до общения с роботом, нивелируются (Марлена Фроне)Нашему мозгу все равно кого (робота или человека) и как воспринимать (как робота, как человека), главное, чтобы ожидания не расходились с реальностью, а это дело привычки, которую надо формировать (Айсе Пинар Саюгин)С учетом этих выводов мы сформировали ряд гипотез на проверку.Наши гипотезы:Основная задача машин - дарить впечатления людям. Роботы справляются с этой задачей в целевых сценариях и это способствует повторному визиту пользователя при применении одного из трех подходов. Мы их назвали базовый, гибридный и имитационныйЧеловек не обращает внимание на вид и на манеру общения робота совсем, если не имеет завышенных ожиданий. Таким образом, если робот используется в сферах, где он приходит на замену текущим устройствам в качестве \"горизонтального обновления\", он несет больший потенциал для создания положительного впечатления у пользователя (Наиболее яркий пример в истории, когда автомобиль вытеснил гужевой транспорт с дорог). Примечания к первой гипотезе:Базовый подход основывается на принципах автономности робота и опирается только на функционал в рамках текущего уровня развития технологий;Гибридный подход опирается на технологию работы робота в связке с человеком, так называемый, дополненный интеллект;Имитационный подход опирается на технологии телеприсутствия.В рамках каждого из трех подходов по первой гипотезе тестируется какой из параметров и в какой мере влияет на положительное восприятие робота человеком.Тестируемые параметры:эмоции на уровне текста;голос и интонация, приближенные к человеческому уровню воспроизведения: на уровне синтеза робота, обработанной аудиозаписи голоса актера под синтез робота, эмоционального голоса актера без наложений;эмотиконы на \"лице\" робота;жесты, мимика и язык тела;поддержание диалога в соответствии с транзакционной моделью Э. Бёрна;fallback - ответ робота в случаях, когда он не знает ответа в соответствии с сентимент анализом и транзакционной моделью Э. Бёрна.Методика тестирования гипотез:Робот Юля (Промобот)Для тестирования гипотез мы использовали 2 типа интервью: интервью с пользователем-владельцем в рамках custdev мультимодальности и интервью пользователя с роботом в рамках заданного сценария с подключаемыми/отключаемыми опциями. Дополнительно мы использовали экспертную оценку наших разработчиков и архитектора диалоговой системы Промобот. Так появился целостный подход к выявлению концепции социального робота для бизнеса способного обрабатывать мультимодальность. Весь процесс был поделен на  4 этапа. На первом этапе мы хотели выявить какие из каналов мультимодальности и, самое главное, в каких проявлениях нужны современному пользователю (custdev). Затем мы запланировали проверить релевантность некоторых из пользовательских требований, а также их действительное влияние на человека. Для этого мы создали несколько сценариев, где были учтены некоторые из пользовательских требований и предоставили пользователям возможность пройти их на роботе. Цель - замерить показатели эффективности: как выглядят метрики клиента в общении с роботом, с человеком и с гибридом. На третьем этапе (об этом в следующих статьях) должны появиться требования от разработки и схемы мультимодальности на основе механизмов формирования положительных эмоций у человека, которые также пройдут фильтр тестирования. И, наконец, будет определена модель мультимодальности, отвечающей пользовательским требованиям, предъявляемым к современным роботам и формат ее заполнения.Этап 1: Custdev по мультимодальности на уровне Человек-РоботРобот Юля (Промобот)Сбор информации на первом этапе осуществлялся в течение 6 месяцев путем интервьюирования, в ходе которого владельцу робота после общения с Promobot V4 задавалось 2 вопроса: \"Чего вам не хватает в функционале робота?\" и \"Для чего вам нужен данный функционал?\".Ответы владельцев мы разделили на несколько групп по модулям реализации, а также кластеризовали их по типам аргументации для удобства дальнейшего анализа нашими разработчиками и формирования MVP на основе подхода “посмотреть, что нужно пользователю и приземлить на то, что можем реализовать на текущий момент мы”. Ниже в таблице представлены результаты.Таблица 1: Ожидания от робота VS Что мы можем дать и с каким качествомПо итогу, custdev продемонстрировал высокую осведомленность владельцев роботов на счет технических ограничений в реализации функционала робота (видимо наша техническая поддержка очень хорошо выполняет свою работу). Однако при формировании запросов все равно наблюдается “полет фантазии”, и мы склоняемся здесь к тому, что конечный пользователь также сильно влияет на владельца. Предполагаем, что некоторые из требований попадут в long-list после оценки разработчиков и архитектора Диалоговой системы Промобот.Этап 2: Генерация мультимодальности на уровне Робот-ЧеловекYaskawa-kun, робот-мороженщикАналитика ответов и подготовка к третьему этапу идет своим чередом. А мы параллельно запустили второй этап – внутреннее тестирование мультимодальности. На втором этапе был разработан сценарий под кодовым названием “Мороженщик” на основе транзакционного анализа. Пользователю необходимо было пройти сценарий 3 раза с тремя разными персонажами. У каждого персонажа был свой голос ((1) робо-синтез, (2) актерская озвучка, (3) актерская озвучка, адаптированная под робо-синтез), своя манера общения и эмотиконы, предполагался также свой язык тела. Помимо этого, когда робот не знал ответа, сентимент анализ помогал ему сообщить об этом пользователю в соответствии со схемой транзакционного анализа и тем самым снять эмоциональное напряжение и продолжить диалог. На выходе оценивалось как пользователь воспринимает образ, где он дошел до конца сценария, и с кем ему было общаться наиболее комфортно. На текущем этапе тестирование в самом разгаре.А мы, не дожидаясь его результатов уже спланировали третий, который позволит понять в рамках какого функционала наш робот будет наиболее востребованным для бизнеса.Этап 3: Методика работы с ожиданиями пользователя на уровне обработки мультимодальностиЧтобы провести третий этап в соответствии с установками нам понадобилось “приземлить ожидания пользователя” на существующие методики и технологии. Мы использовали для разных типов сценария следующие подходы:БазовыйСкромный, но дающий в определенной мере предполагаемый “WOW-эффект”. Здесь робот будет минимально антропоморфным при оценках человеком, что выглядит вполне понятным даже для него самого. Поэтому сделать так, чтобы видели не робота, а его функционал и оценивали только то, как хорошо выполняется задача, является программой максимум. В случае применения только базового функционала не нужно, чтобы люди пытались полноценно сравнивать такого робота с человеком, его могут воспринимать как дроида, которого можно создать по любому подобию и у него будет:своя модель речи, жестов, распознавания, мимики построенных на понятных технологиях NLP, CV, ASR, TTS, с применением различных сенсоров, алгоритмов на основе когнитивной лингвистики (грамматики конструкций), векторной семантики и многих других моделей. У таких роботов могут быть суперспособности, например, возможность говорить на языке животных (как в фильме Финч (2021))свой способ передвижения - колесасвой способ познания мира (база знаний)свой тип поведенияГибридныйРобот-ассистент и ассистент для роботаМожет быть достигнут с помощью гибридных методов: amplified intelligence. Так для выработки привычки взаимодействия с роботом на основе базового функционала необходим консультант со знанием сценария взаимодействия с роботом и периодично его демонстрирующий в окружении людей тем самым провоцируя их повторять только сценарные действия и улучшая фон удовлетворенности от общения с роботом (Так внедряли терминалы и банкоматы Сбера, так это работает с презентацией любого нового продукта на выставке).ИмитационныйРобот, управляемый человекомЗдесь речь идет о технологиях телеприсутствия. Максимально скопировать человека может сегодня только человек. Эта история про автоматоны в витрине магазина еще в детстве заставляла меня прилипать на час другой к витрине “Детского мира” в Хельсинки, робот манекен в витрине, который двигается и привлекает внимание к новой коллекции. Данный вариант по сей день актуален и несет ценность, пусть даже и для тестирования гипотез.С точки зрения технологий робота уже не будут пытаться полноценно сравнивать с человеком, его воспримут как дроида, которого мы можем создать по любому подобию, но вместе с тем мы сталкиваемся с фактом, что такой подход является нерасширяемым.Чтобы реализовать данный подход сценарий “Мороженщик” будет расширен и размножен на трех разных подходах, а затем оттестирован на пользователях. Планируется собрать фидбек по следующему пулу вопросов:Какой сценарий вызывает наибольший отклик и приятие?Какие минусы у каждого из трех сценариев в плане реализации?Какие плюсы у каждого из трех сценариев в плане реализации?Что нужно добавить, чтобы сценарии заставляли вас возвращаться снова и сноваПравильно (ожидаемо) ли отработали мультимодальные (эмоции, жесты, мимика) схемы на роботе?Вернетесь ли к этому роботу еще за мороженным?Хотите купить этого робота?ВыводыО выводах пока говорить рано. Ждем результатов всех этапов и проработки 4 этапа, который позволит объединить весь собранный материал воедино и создать впервые подход в разработке мультимодальности, отвечающий пользовательским требованиям, предъявляемым к современным человекоподобным роботам.Дальнейшая работаРобот Юля (Промобот)Предварительный анализ показал, что пользовательские требования, собранные в основном от владельцев роботов, не всегда имеют связь с реальностью. Поэтому проработка возможностей технологий на предмет максимального удовлетворения запросов пользователей является также необходимой. Что является не менее важным - это правильно собрать поведенческий модуль робота. Тестирование четвертого этапа должно, во-первых, позволить собрать данные полученные на первых трех этапах в единый поведенческий модуль, а, во-вторых, установить режимы работы модуля в целом. Об этом мы напишем в последующих публикациях. Продолжение следует...СсылкиLakоff, G. (1987). Women, Fire, and Dangerous Things. What Categories Reveal about the Mind. Гл. 1, 17.Бёрн, Э . (2009). Трансакционный анализ в психотерапии / Пер. с англ. А.А. Грузберга, М.: Эксмо, 416 с.Baron-Cohen, S. (1991). Precursors to a theory of mind: Understanding attention in others. In A. Whiten (Ed.), Natural theories of mind: Evolution, development, and simulation of everyday mindreading. Oxford: Basil Blackwell, 233-251. Kahn, Peter H.; Ishiguro, Hiroshi; Friedman, Batya; Kanda, Takayuki (2006-09-08). What is a Human? - Toward Psychological Benchmarks in the Field of Human-Robot Interaction. ROMAN 2006 - the 15th IEEE International Symposium on Robot and Human Interactive Communication, 364-371. Edwards, Chad; Edwards, Autumn; Spence, Patric R.; Westerman, David (21 December 2015). Initial Interaction Expectations with Robots: Testing the Human-To-Human Interaction Script. Communication Studies. 67 (2): 227-238Mori, M. (1970/2012). The uncanny valley (K.F. MacDorman & N. Kageki, Trans.). IEEE Robotics & Automation Magazine, 19(2), 98-100. Distributed Little Red Hen Lab “Multimodal communication research” https://github.com/RedHenLab", {"day": "3", "month": "декабря", "time": "13:38"}, {"rate": 2, "views": 1300}], ["На днях стало известно о том, что в России стартовала разработка универсальной робототехнической платформы, которая позволит создавать модели знаний для систем искусственного интеллекта. Партнеры проекта - \"Фонд содействия инновациям\" и компания \"Промобот\" (резидент Фонда \"Сколково\"). В развитие платформы в течение 2 лет будет вложено 40 млн рублей. О подробностях - под катом. Для чего и для кого создается платформа?Универсальная платформа может быть востребована у разработчиков робототехнических решений. С её помощью на рынок могут поступить новые сервисные роботы для индустрии ритейла, гостиниц, транспорта, развлечений и многих других. По данным Национальной ассоциации участников рынка, робототехники в 2018 году объем мирового рынка профессиональной сервисной техники составил $9,2 млрд,  на 32% больше, чем в 2017-м. В 2029–2022 годах прогнозируемый рост рынка профессиональных сервисных роботов составит 45%.Павел Кривозубов, руководитель направления «Робототехника и искусственный интеллект» кластера информационных технологий Фонда «Сколково»: «Компания “Промобот” уже давно переросла уровень стартапа и стала флагманской российской робототехнической компанией, разрабатывающей передовых отечественных роботов, применяемых во всём мире. Финансируя самые перспективные разработки в области робототехники и искусственного интеллекта, компания переходит на новый уровень развития. Уверен, что сотрудничество с ведущим российским грантовым фондом позволит “Промоботу” сделать данную разработку качественно, тем самым дав возможность робототехническим компаниям дооснастить своих роботов новым и востребованным функционалом».Основные возможности платформыВ первую очередь, инвестиции направят на разработку универсальной роботизированной платформы с качеством распознавания русской речи не менее 96%, функцией синтеза речи, функцией автоматического безаварийного передвижения, функцией навигации (сбой локализации не более чем в 1% случаев), возможностью исполнения скриптов движения (позволяет отправлять на выполнение команды устройства другим системам), функцией детектирования и нахождение людей с точностью не менее 85%, печати документов, приема платежей, выдачи карт доступа.Олег Кивокурцев, директор по развитию Promobot: «Робот — идеальный сотрудник: у него всегда отличное настроение, он никогда не опаздывает и не ошибается и в эпоху пандемии, такие решения очень своевременны».Финансирование осуществляется в рамках конкурса “Коммерциализация 2021”, (Очередь (XIV)), который проводит «Фонд содействия инновациям». Конкурс направлен на предоставление грантов малым инновационным предприятиям, завершившим НИОКР и планирующим создание или расширение производства инновационной продукции.Победитель получает 20 млн рублей, при условии равного софинансирования со стороны компании. Таким образом, общее финансирование проекта составляет 40 млн рублей.", {"day": "3", "month": "ноября", "time": "15:13"}, {"rate": 5, "views": 739}], ["Разработчики из новосибирской команды Pro Control создали некопируемый QR-код с двухфакторной системой проверки. Он включает обычный QR-код, а также внутреннюю матрицу, которую невозможно распечатать на обычном принтере и распознать специальными программами. Авторы технологии рассчитывают, что она поможет в борьбе с поддельными QR-кодами, которые нужны для посещения общественных мест.По их словам, обычные QR-коды можно распечатать на принтере в виде тысячи экземпляров, а также сделать их электронные копии с помощью специальных программ.Однако двухфакторная система проверки делает такое копирование невозможным. Код состоит из двух частей — обычный QR-код и внутренняя голографическая матрица, которую фактически нельзя скопировать или размножить. Для печати каждого такого QR-кода нужен специальный принтер.Ранее компания «Промобот» представила роботов для проверки QR-кодов привитых или переболевших коронавирусом граждан в Москве, Санкт-Петербурге и Перми. Сервисные роботы пермского стартапа будут выполнять функцию контролеров на входах в рестораны, театры, торговые центры, вокзалы и другие общественные места.Роботы оснащены сканерами для проверки на подлинность QR-кодов и паспортов, а их информационная система интегрирована с госуслугами для сверки информации о ковид-статусе проверяемых граждан.С 30 октября по 7 ноября в стране объявили нерабочие дни из-за ситуации с коронавирусом. Вице-премьер Голикова предлагала ввести допуск на работу привитых и переболевших граждан с помощью QR-кодов.", {"day": "31", "month": "октября", "time": "08:58"}, {"rate": 1, "views": 22000}], ["АНО «Национальные приоритеты», которая организует информационное сопровождение нацпроектов, разработала информационную кампанию по повышению доверия российской общественности к искусственному интеллекту. 26 октября состоится церемония подписания кодекса этики в сфере искусственного интеллекта. Ее проведут в рамках первого международного форума «Этика искусственного интеллекта: начало доверия».Медиаплан кампании по повышению доверия к ИИ включает публикации в СМИ («Аргументы и факты», Forbes, бортовые журналы «Аэрофлота» и S7 и др.), а также создание тематических выпусков научно-популярной программы «Просто наука» на телеканале СТС. На эти цели из бюджета проекта «Искусственный интеллект» должны выделить 46,9 млн рублей. Отдельное финансирование выделят из нацпрограммы «Цифровая экономика» на создание посвященных искусственному интеллекту выпусков телепрограмм «Чудо техники», «Умный дом», «Про здоровье» и др.В презентации АНО «Цифровые приоритеты» говорится, что технологиям ИИ хотят придать «эмоциональный характер проводника справедливости для человека» и убедить россиян, что искусственный интеллект «приносит больше справедливости в их жизни, обеспечивая равный доступ к новым возможностям». В настоящее время, согласно опросу ВЦИОМа, большинство россиян (65 %) считают, что ключевой областью применения искусственного интеллекта является система видеонаблюдения.«На данный момент в общественном сознании существует немало мифов и опасений, касающихся того, что искусственный интеллект стремительно врывается во многие сферы нашей жизни: помогает ли он или способен навредить, кто главнее, человек или технология», — говорит Алексей Сидорюк, директор по направлению «Искусственный интеллект» в АНО «Цифровая экономика». По словам главы МТС AI Александра Ханина, тема искусственного интеллекта нуждается «не столько в популяризации, сколько в корректировке восприятия ее обществом». «Пандемия и связанные с ней ограничения сформировали у населения скептичное отношение ко многим технологиям искусственного интеллекта как способам контроля за соблюдением новых правил, а также бесконтрольным наблюдением за жизнью человека. При этом полезные сервисы, такие как разработка индивидуальной программы обучения для человека с помощью искусственного интеллекта в образовании или прогнозирование выхода из строя различных установок для предотвращения техногенных катастроф, остаются в тени», — подчеркивает Ханин.Исполнительный вице-президент по развитию цифрового и нового бизнеса «ВымпелКома» Евгений Черешнев сомневается, что федеральная рекламная кампания сможет изменить общественное мнение об ИИ. «Для ИИ нужно или вкладываться в создание действительно качественных фильмов и сериалов, или строить рекламные кампании на принципе демонстрации успешных кейсов», — рассуждает Черешнев.По словам директора по развитию компании «Промобот» Олега Кивокурцева, для популяризации искусственного интеллекта необходимо также показывать примеры успешных компаний и использовать современные медиаканалы для привлечения молодой аудитории, в том числе TikTok и YouTube.Между тем в церемонии подписания кодекса этики в сфере искусственного интеллекта примут участие чиновники администрации президента и правительства, а также представители «Газпром нефти», МТС, Российского фонда прямых инвестиций, Сбера, Яндекса, интернет-холдинга VK.В разработке кодекса участвовали компании альянса, представители Аналитического центра при правительстве РФ, Минэкономразвития России, экспертного и академического сообщества. В сентябре документ обсудили в Общественной палате и Совете Федерации. В него внесли некоторые правки. Например, исходная формулировка одного из принципов гласила, что технологии ИИ необходимо внедрять там, где это принесет пользу людям. Яндекс переформулировал ее: «Технологии ИИ нужно применять по назначению и внедрять там, где это принесет пользу людям». Рекомендации кодекса рассчитаны на системы искусственного интеллекта, применяемые исключительно в гражданских целях. Для реализации положений кодекса будет создана комиссия, в которую войдут представители бизнес-сообщества, науки и госорганов. Подписавшие кодекс компании должны будут назначить уполномоченных по этике искусственного интеллекта.Кодекс также рекомендует бизнесу добросовестно информировать своих пользователей об их взаимодействии с системами искусственного интеллекта, когда это затрагивает вопросы прав человека и критических сфер его жизни, и обеспечивать возможность прекратить такое взаимодействие. Кодекс содержит рекомендацию разработчикам ИИ сотрудничать между собой по вопросу выявления и проверки информации о способах создания универсальных систем искусственного интеллекта и предотвращения угроз, которые они несут. Ранее НАТО выпустило первую стратегию в области искусственного интеллекта. Она закрепляет стандарты и принципы ответственного использования технологий ИИ в соответствии с международным правом и ценностями альянса. Правительство Великобритании также опубликовало национальную стратегию искусственного интеллекта. Документы содержат план «новой национальной программы и подхода к поддержке исследований и разработок» в сфере ИИ, а также материалы по управлению и регулированию сферы.", {"day": "26", "month": "октября", "time": "10:22"}, {"rate": 15, "views": 1200}], ["По информации издания «Коммерсантъ», мэрия Москвы потребовала от владельцев торговых центров и подключить их камеры, установленные на входах в здания, к централизованной столичной системе видеонаблюдения, чтобы отслеживать соблюдение масочного режима гражданами и идентифицировать нарушителей для последующего штрафа.\n\r\nМэрия еще в прошлом году запрашивала от ТЦ подключения видеокамер к своему единому центру хранения данных (ЕЦХД), но более 300 владельцев закрытых торговых площадок этого не сделали. Теперь им грозят штрафы за невыполнение указов властей столицы или даже приостановка в работе.\n\r\nВладельцы ТЦ до 20 октября должны начать активно взаимодействовать с департаментом информационных технологий Москвы и подключить свои входные камеры (минимальные требования по их характеристикам: разрешение 720p, частота кадров — 15–25 к/с) по защищенным каналам к ЕЦХД.\n\r\nЭксперты пояснили изданию, что всего в Москве 600 больших торговых центров, а половина из них так и не подключена к ЕЦХД. Фактически у их владельцев есть неделя на выполнение требования мэрии. «Коммерсантъ» уточнил, что в среднем на один торговый центр приходится не менее 6 камер на входных группах, а всего к ЕЦХД должны срочно подключиться около 2 тыс. камер. Сейчас в столичную систему видеонаблюдения интегрированы более 200 тыс. камер.\n\r\n19 октября 2021 года мэр Москвы Сергей Собянин на фоне критической ситуации из-за роста заболеваемости COVID-19 объявил, что с 25 октября по 25 февраля все компании обязаны перевести на удалёнку 30% своих сотрудников, а также всех сотрудников старше 60 лет и тех, у кого есть хронические заболевания. Привитым и переболевшим (если это произошло за последние полгода) коронавирусом сотрудникам компаний можно не работать удаленно. \n\r\nРанее компания «Промобот» сообщила, что предоставит роботов для проверки QR-кодов привитых или переболевших коронавирусом граждан в Москве, Санкт-Петербурге и Перми. Сервисные роботы пермского стартапа будут выполнять функцию контролеров на входах в рестораны, театры, торговые центры, вокзалы и другие общественные места.", {"day": "20", "month": "октября", "time": "11:03"}, {"rate": 4, "views": 2100}], ["По информации «РИА Новости», компания «Промобот» предоставит роботов для проверки QR-кодов привитых или переболевших коронавирусом граждан в Москве, Санкт-Петербурге и Перми. Сервисные роботы пермского стартапа будут выполнять функцию контролеров на входах в рестораны, театры, торговые центры, вокзалы и другие общественные места.\n\r\nПредставитель «Промобота» пояснил, что их роботы для этой цели дополнительно оснащены сканерами для проверки на подлинность QR-кодов и паспортов, а также их информационная система интегрирована с порталом «Госуслуг» для сверки информации о ковид-статусе проверяемых для входа граждан.\n\n\n\r\nРазработчик называет этих роботов «автоматическими QR-контролерами». Они также скоро появятся в некоторых аэропортах и образовательных учреждениях страны, где введен пропуск по QR-кодам в различные учреждения. \n\n\n\r\n«Промобот» уточнила, что ее роботы этой модификации будут не только стоять, а способны перемещаться у входов в охраняемые зоны и общаться с посетителями. \n\nПример выполнения роботом операции по проверке паспорта и QR-кода у человека.\n\nСканер QR-кода удобно расположен, а вот для сканирования паспорта нужно наклониться. \n\r\nКомпания «Промобот» основана в 2015 году в Перми. Ее роботы трудятся в 43 странах мира в качестве администраторов, промоутеров, консультантов, гидов и консьержей, заменяя или дополняя обычныхсотрудников. Сейчас роботов от «Промобот» можно встретить в Сбербанке, Московском метро, Музее современной истории России, МФЦ, аэропорту Балтимор-Вашингтон и Дубай-Молле.\n\nРоботы от «Промобот» также могут измерять температуру людей бесконтактным термометром и способны проводить опрос на наличие первичных симптомов COVID-19", {"day": "17", "month": "октября", "time": "15:44"}, {"rate": 6, "views": 2600}], ["Пермская компания «Промобот» разработала человекоподобного робота Robo-C с подвижными руками с восемью двигателями, которые помогают устройству взаимодействовать с аудиторией и жестикулировать, сообщили РИА Новости в пресс-службе компании.  Робот также обладает гиперреалистичной кожей, чтобы точнее воспроизводить эмоции, но главным новшеством разработчики считают подвижные руки, которые могут работать в 12 режимах свободы.   Изображение: promo-bot.ruПроцесс передачи команд в руку реализован с помощью скриптов. Возможны три режима: базовая жестикуляция при общении, движения по команде извне — можно попросить робота сделать жест, например, помахать рукой, и по команде инженера разработчика. В перспективе планируем научить робота писать на различных языках и рисовать. Разработка заняла четыре месяца— поделился директор по развитию «Промобота» Олег Кивокурцев.  Также известно, что разработчики приступили к созданию ног робота. Впервые человекоподобный робот-компаньон с подвижными руками будет представлен публике в сентябре на международном форуме ВЭФ-2021.  Обновленный Robo-C копирует эмоции человека: может двигать глазами, бровями, губами и другими \"мышцами\", а также поддерживать разговор и отвечать на вопросы, воспроизводить свыше 600 вариантов микромимики человека, максимально реалистично имитируя его эмоции— сообщили в компании.  Напомним, что компания \"Промобот\" основана в 2015 году в Перми, чьи роботы трудятся в 43 странах мира в качестве администраторов, промоутеров, консультантов, гидов и консьержей, заменяя или дополняя \"живых\" сотрудников. Их можно встретить в Сбербанке, Музее современной истории России, МФЦ, аэропорту Балтимор-Вашингтон и Дубай-Молле.", {"day": "29", "month": "августа", "time": "16:14"}, {"rate": 11, "views": 7000}], ["Мы уже рассказывали, что встреча людей и машин на производстве в основном заканчивается миром. Где-то эффективнее автоматизировать производственные задачи, но во многих сферах по-прежнему полезнее делать ставку на одушевлённый пролетариат, но в целом роботы и люди всё теснее сотрудничают на фабриках, работая буквально бок о бок. Возникает вопрос: как сделать так, чтобы машины случайно не навредили человеку? Рассказываем историю проблемы, в которой уже пролилась первая кровь, а также о технологиях, предотвращающих эти неприятные столкновения.\n\r\nЕщё при жизни фантаста и футуролога Айзека Азимова, сформулировавшего три закона мирного сосуществования робота и человека, нашлась машина, которая их нарушила. \n\nКстати, если кто забыл, законы простые: \n\n\nРобот не может причинить вред человеку или своим бездействием допустить, чтобы человеку был причинён вред.\nРобот должен повиноваться всем приказам, которые даёт человек, кроме тех случаев, когда эти приказы противоречат Первому закону.\nРобот должен заботиться о своей безопасности в той мере, в которой это не противоречит Первому или Второму законам.\n\n\nЧем меньше расстояние между людьми и роботами, тем больше риск несчастных случаев. Для обеспечения безопасности требуется тщательный менеджмент, включающмй разделение робота и рабочей зоны. Источник: Toshiba\n\r\n25 января 1979 года в городе Флэт-Рок (шт. Мичиган, США) 25-летнему рабочему склада фабрики «Форд» Роберту Уильямсу поручили извлечь детали, хранившиеся на огромном стеллаже, который в то же время обслуживала пятиуровневая машина-манипулятор. Она была разработана компанией Litton Industries для перемещения болванок на складе. Часть машины представляла собой однотонные транспортные средства для перевозки — тележки на резиновых колесах, оснащенные механическими манипуляторами для перемещения болванок. Уильямса отправили сделать работу, с которой не справился робот — какие-то детали остались без внимания машины. Рабочий забрался на третий уровень стеллажа и начал выполнять задачу. Тем временем здесь же появилась одна из тележек, которая ударом манипулятора мгновенно убила рабочего, не заметившего её приближения. Тело Уильямса оставалось на полке полчаса, пока его не обнаружили рабочие. Робот буднично продолжал перемещать болванки. Родные рабочего отсудили 10 млн долларов ущерба, а Уильямс, сам об этом уже не узнав, вошёл в историю как первая жертва робота. \n\r\nСимволично, что смерть Уильямса случилась в годовщину премьеры пьесы Карела Чапека «Россумские универсальные роботы», которая состоялась в 1921 году. Именно это произведение дало нам понятие «робот», а также первое описание тотального уничтожения человечества восставшими машинами. \n\r\nВпрочем, назвать смерть Роберта Уильямса убийством — это значит допустить большое преувеличение, ведь у фабричной машины не было главного «квалифицирующего признака» умышленного убийства — мотива. И даже в июле 2016 года, когда полицейский робот со взрывчаткой был использован для ликвидации преступника в Далласе (шт. Техас, США), действиями машины все ещё руководил человек. \n\nЧасто ли роботы наносят вред человеку?\r\nХотя все роботы за исключением военных проектируются так, чтобы ни одно из правил Азимова нарушено не было, полностью избежать жертв не удаётся. Много ли их? Статистику драматичных инцидентов с роботами нельзя назвать обширной, хотя травмы и даже убийства с участием машин происходят регулярно. \n\r\nСогласно исследованию, проведённому Управлением по безопасности и гигиене труда США (Occupational Safety and Health Administration — OSHA), промышленные роботы стали причиной не менее 33 случаев смерти и травм на рабочем месте в этой стране за 30 лет. Однако есть и более мрачные данные. В 2013 году германские страховые компании подсчитали, что каждый год в ФРГ происходит порядка 100 инцидентов с промышленными роботами. \n\r\nВ более раннем исследовании 1987 года, охватившем предприятия из США, ФРГ, Швеции и Японии, установлено, как именно роботы вредили рабочим: в 56% случаев они наносили проникающие ранения, в 44% — удары. Большинство несчастных случаев были вызваны плохой организацией рабочего места (20 из 32 проанализированных инцидентов), а человеческие ошибки спровоцировали только 13 неприятных ситуаций. \n\r\nЕсть статистические данные о неудачном использовании роботов в отдельных сферах их применения. К примеру, как принято говорить у медиков, «своё кладбище открыли» медицинские коботы: в 2013 году команда учёных проанализировала статистику Управления по санитарному надзору за качеством пищевых продуктов и медикаментов США (US Food and Drug Administration, FDA) и обнаружила, что с 2000 по 2013 год во время хирургических операций, которым ассистировали роботы, произошли 144 смерти, 1 391 травма и 8 тыс. неисправностей устройств. Среди них две смерти и 52 ранения были вызваны самопроизвольным отключением робота во время операции или совершения им неправильного движения. Одна смерть и 119 травм произошли из-за того, что элементы робота или удерживаемой им оснастки падали на пациента.\n\nРоботы в хирургии применяются там, где точности рук и взгляда даже самого опытного хирурга недостаточно — от операций на позвоночнике до пересадки волос. Источник: YouTube-канал IEEE Spectrum \n\nПочему роботы стали опаснее?\r\nОсновная и почти философская проблема: роботы не осознают себя частью мира, и соответственно, могут быть опасны для окружающих. Однако если 20-40 лет назад робот был электромеханической машиной с очень ограниченным кругом повторяющихся задач, и его можно было буквально «держать в клетке», то есть ограничить к нему доступ, чтобы он случайно никому не навредил, то сегодня ситуация меняется. Чтобы роботы заменили отдельных работников либо дополнили их возможности своими, машины приходится выпускать из клеток. За одним конвейером могут трудиться одновременно два сортировщика — живой и механический. Более того, роботы становятся многозадачными, для чего им нужно передвигаться по цеху. \r\nСоответственно, образуется единое рабочее пространство человека и машины, в котором может случиться всякое. \n\nПромышленные роботы представляют несколько типов угроз в зависимости от их происхождения:\n\n\nмеханические опасности, которые возникают в результате непреднамеренных и неожиданных движений или потери роботом инструментов; \nопасность поражения электрическим током, например, контакты с токоведущими частями или соединениями; \nтепловые опасности, такие как связанные с горячими поверхностями или воздействием экстремальных температур;\nшум, способный навредить органам слуха.\n\r\nЧто же провоцирует эти угрозы? По наблюдениям специалистов OSHA, многие инциденты с участием роботов происходят не в нормальных условиях эксплуатации, а при внештатных ситуациях, к примеру, во время перепрограммирования, техобслуживания, ремонта, тестирования, настройки или регулировки. Далее следуют внешние факторы, не зависящие от человека, — природные или технические, скажем, сбой электропитания. \n\nВсего принято выделять семь основных причин выхода роботов из-под контроля:\n\n\nошибки управления, то есть ошибки в системе управления или программном обеспечении, что приводит к нестабильному поведению или увеличению опасного энергетического потенциала машины;\nнесанкционированный доступ — нарушение неподготовленным специалистом охранной зоны рядом с машиной; \nмеханические неисправности — наиболее непредсказуемые и опасные сбои, которые могут привести к неправильной или неожиданной работе робота; \nприродные факторы — в этой группе причин всё то, что может повлиять на поведение робота в силу природных причин, в частности, электромагнитные или радиочастотные помехи, а также неблагоприятные погодные условия;\nсбой системы питания — например, пневматические, гидравлические или электрические приводы могут нарушать электрические сигналы в линиях управления; результат — выброс энергии, поражение электрическим током, увеличение риска пожара, особенно когда что-то искрит в роботах, использующих горючее гидравлическое масло;\nнеправильная инсталляция робота или его элементов провоцирует массу аварийных ситуаций, в том числе и при попытках исправить ошибки; \nчеловеческий фактор: ошибки программирования, сопряжения, управления, нарушение техники безопасности. \n\nВ январе 2019 года промобот одного из ТЦ в Лас-Вегасе заблудился в районе парковки и был сбит Tesla Model S. Хотя промобот находился в неположенном месте, виноватым оказался водитель машины, отключивший автопилот. Источник: YouTube-канал Promobot\n\r\nЧаще всего нештатные ситуации возникают либо при вмешательстве в работу робота человека, либо из-за изменений окружающей среды, на которую механический рабочий отреагировать не может. Какие технологии позволяют это предотвратить?\n\nКакие технологии обеспечивают безопасность роботов?\r\nБезопасным сотрудником робота делают три ключевых навыка: 1) контролируемая остановка, 2) контроль скорости и разделения зон, 3) ограничении мощности и силы. Разъясним эти понятия.\n\nКонтролируемая остановка (Safety-rated Monitored Stop, SMS)\n\r\nКонтролируемая остановка робота происходит, как только человек оказывается в определённой зоне поблизости от машины, скажем, для замены оснастки, регулировки, настройки или других действий непосредственно с роботом. При этом продолжается подача питания, а робот автоматически переходит в режим бездействия. Как только оператор покидает зону контроля, робот возобновляет рабочие операции без дополнительных команд. \n\r\nДля измерения расстояние от робота до человека (или другой помехи) используются сенсоры удалённости разных типов (оптические, звуковые и др.), которые определяют расстояние до объекта, посылая сигнал и получая отклик. Чтобы обеспечить максимальную безопасность датчики имеют две параллельные системы передачи и обработки сигналов о появлении в заданной зоны помехи. Сигналы поступают в два разных модуля в контроллере робота и обрабатываются отдельно, причём разными алгоритмами. Затем они проходят перекрёстную проверку. \r\nСоответственно, если один из каналов по какой-либо причине откажет, робот всё равно остановится.\n\nТак работает контролируемая остановка манипулятора. Магистр Университета Антверпена использовал для создания этой системы Kinect v2 от Microsoft. Источник: Nick van Oosterwyck / YouTube \n\nКонтроль скорости и разделения зон (Speed and Separation Monitoring, SSM)\n\r\nЭта более сложная технология безопасности предусматривает изменение поведения робота при нахождении человека в определённой зоне рядом с машиной — например, замедление работы робота. \n\r\nТехнически это происходит так: машина непрерывно измеряет положение и скорость перемещения объекта в зоне видимости. SSM может быть реализована как в статических, так и в динамических условиях. Ключевой при этом является технология распознавания окружающих объектов. В частности, для SSM применима технология распознавания объектов Toshiba. Изначально мы разрабатывали её для решения задач складскими роботами, которые должны были научиться обращаться с посылками, в том числе разных размера, цвета, веса и формы. Если робот должен видеть, что он захватывает, то почему бы ему не научиться распознавать коллег, в том числе людей? Технологию распознавания Toshiba основана на использовании двух камер RGB-камеры и 3D-камеры. Объединяя полученные ими картинки, робот может определять положение объекта в пространстве и направление его движения.\n\nОграничение мощности и силы (Power- and Force-Limited, PFL) \n\r\nЭто одна из наиболее часто применяемых технологий, которая позволяет избежать вреда человека при контакте человека и машины. Она предполагает использование разных техник, в том числе и сенсоров силомоментного очувствления. Он преобразуют измеряемые компоненты векторов сил и моментов в сигналы, пригодные для обработки роботом, который «прикасается» к тем или иным предметам. К примеру, такие датчики установлены на кронштейнах роботов Toshiba, которые занимаются сортировкой разного типа посылок, в том числе и хрупких. Прежде чем взять посылку робот «ощупывает» её и датчик определяет, с каким объектом по форме, упругости, размерам имеет дело машина. Исходя из полученных данных, робот выбирает силу зажима и скорость обращения с объектом.\n\nКакие технологии сделают робота безопаснее в будущем?\r\nПромышленные роботы в будущем в отличие от своих предшественников, которые были способны лишь к ритмичному повторению ограниченного круга задач, будут взаимодействовать с меняющейся средой и человеком. Чтобы робот мог это делать и выполнять нетипичные задачи, он в той или иной мере должен освоить основные навыки человека, в частности — умение слушать. \n\r\nСовсем недавно Toshiba представила новую технологию распознания речи, основанную на искусственном интеллекте. Это первая в мире разработка такого рода: любой робот или простое электронное устройство сможет обрабатывать голосовые команды без подключения к интернету и облачным данным. Иными словами, обрабатывающее устройство встраивается в машину. \n\r\nСначала нейронная сеть обрабатывает звук, отделяя голосовые команды от посторонних шумов. Далее используется методика расширения данных в нейронной сети. Расширение данных — это метод изучения небольших объемов информации, в данном случае — устных высказываний. \n\n\n\n\n\r\nПутём случайного присвоения нулевого веса соединениям между узлами нейронной сети можно генерировать смоделированную речевую информацию, как если бы говорящий говорил по-разному. Успешная идентификация людей происходит благодаря обучения ИИ на основе образцов их речи, что позволяет распознавать конкретных говорящих, даже когда доступно лишь небольшое количество высказываний. Источник: Toshiba\n\r\nToshiba сократила количество требуемых образцов речи до такой степени, что новая технология может распознать пользователя всего по трём высказываниям. Такая технология отлично подойдёт для роботов и коботов, с которыми не нужно быть многословными. Во всяком случае, пока.\n\r\nИскусственный интеллект будет помогать в будущем роботам не только лучше слышать, но и видеть, думать и перемещаться, что со временем полностью устранит преграды между рабочими-людьми и их искусственными коллегами.", {"day": "5", "month": "июня", "time": "15:25"}, {"rate": 6, "views": 2400}], ["По последним данным ВЦИОМ, 88% россиян позитивно или нейтрально относятся к искусственному интеллекту. 54% жителей нашей страны уже готовы к появлению технологий ИИ дома и в индустрии развлечений. А две трети готовы получать госуслуги с помощью машин. \nУчёные сейчас активно изучают взаимодействие людей с искусственным интеллектом и роботами. \nВ декабре 2019 года в России провели первое полевое исследование, связанное с изучением отношения людей к роботам при получении услуг. Результаты оказались неожиданными.  \n\nЧто исследовалось?\nОсновная задача сервисных роботов — общение и взаимодействие с людьми. Интеграция роботов в общество становится важной задачей не только для науки, но и бизнеса. Как побудить людей общаться с ними? Это не просто научно-техническая или экономическая проблема, но в первую очередь социальная и психологическая. Все эти вопросы рассматриваются в рамках междисциплинарного направления Human-Robot Interaction (HRI). \nВ последние годы всё чаще проводятся международные конференции, публикуются научные статьи по этой тематике. А ведущие робототехнические компании открывают отделы HRI. \nОтношение людей к роботам также рассматривается в рамках HRI. В данном случае социальные установки людей изучали в процессе взаимодействия с промоботом при получении госуслуг. \nУчёные проверяли истинность следующей гипотезы. \nУ людей есть предрасположенность к оценке роботов и взаимодействия с ними, которые проявляются в конкретной ситуации и зависят от социальных характеристик людей. Эта предрасположенность влияет на оценку больше, чем технические и функциональные возможности робота. Другими словами социологи выясняли, что клиенты думают о роботах до взаимодействия с ними, как меняется их отношение после взаимодействия, и как это отношение влияет на оценку оказания услуг. Кроме того, учёные определяли, каким способом клиентам комфортнее всего получать услуги и почему. \nИсследование проводили учёные Пермского национального исследовательского политехнического университета и компания Promobot. \nКак проводилось исследование?\nНаучная работа включала в себя два этапа: лабораторный эксперимент и полевое исследование. \nУчастники исследования получали госуслугу четырьмя способами. Первые два — это «чистые» сценарии коммуникации, где человек взаимодействовал с человеком и с роботом. Два других способа были связаны с гибридными системами: получение услуги у человека, который общается строго в рамках диалоговой системы робота («роботизированный человек»), и у робота, которым дистанционно управляет человек («очеловеченный робот»). \n\nКлиенты не знали, в каком случае дроидом управляли, а где живому сотруднику «подсказывала» машина. \nЛабораторный этап\nКаждый доброволец, который участвовал в этом эксперименте, получал условный “паспорт” всеми четырьмя способами. То есть на экспериментальной площадке были представлены два «живых» сотрудника и робот, к которому участники подходили дважды. \nДля участия в эксперименте отобрали 40 человек. Предварительно участники эксперимента заполнили онлайн-анкету, которая позволила оценить их социальные установки по отношению к новым технологиям и роботам. В результате добровольцев разделили на три группы. \n\nСоциологи наблюдали за ходом эксперимента, фиксировали поведение участников, замеряли время взаимодействия и невербальные реакции. \nПосле всех процедур по получению паспорта, добровольцы снова заполняли анкеты. Кроме того, сразу после эксперимента проводились фокус-групповые интервью, где участники обсуждали полученный опыт с модератором. Предметом анализа стали результаты наблюдения, различия в анкетах «до» и «после» взаимодействия, а также результаты групповых обсуждений.\nВ эксперименте участвовали добровольцы, интересующиеся современными технологиями и робототехникой, готовые тратить время и силы на исследования в этой области! \nПолевой этап\nПолевое исследование провели на территории Многофункционального центра «Мои документы» (МФЦ) в Перми, где рядовые граждане получают госуслуги. Участниками исследования стали клиенты МФЦ, которые получали услугу у робота или человека и согласились на опрос после взаимодействия. Каждый опрошенный взаимодействовал только с одной из систем. \nВсего опросили 200 человек — по 50 для каждой из систем взаимодействия. Как и в лабораторном эксперименте, социологи наблюдали за участниками, фиксировали их поведение и невербальные реакции, замеряли время взаимодействия. Основой для анализа на этом этапе стал опрос в форме интервью. \nНа этом этапе опросили людей, которые действительно получили услугу. Они не знали, что участвуют в исследовании. \nКакие выводы?\nНа основе научных данных подтвердилось наличие у людей предрасположенности к оценке роботов и их работы. Эта предрасположенность зависит от возраста человека, его background’а и опыта взаимодействия с роботами. \nИсследование носило разведывательный характер, результаты обладают научной новизной. Для более глубокого изучения требуется проверка устойчивости измерений в повторных процедурах.\nРезультаты проведенного исследования свидетельствуют, что человеку еще нужно привыкнуть к новому типу взаимодействия «робот-человек»: прочувствовать в регулярном общении удобство голосового ввода и общую надежность работы системы, приобрести уверенность в собственных правильных действиях. \n\nНадежда Оплетина, к.социол. н., доцент МГТУ им. Н.Э. Баумана\n1. Интерфейс важнее характера коммуникации\nПри получении услуг нам не важно как говорит наш собеседник, гораздо важнее, как он выглядит. Другими словами, человеку важнее говорить с человеком, а не по-человечески. \n\nЛабораторное исследование показало, что при взаимодействии со всеми четырьмя системами люди не замечали разницы между чистыми и гибридными вариантами коммуникаций — между человеком и роботизированным человеком, а также между роботом и очеловеченным роботом. И это несмотря на то, что они знали, что участвуют в эксперименте. \nВывод подтверждается и полевыми исследованиями. Опрошенные клиенты МФЦ, получавшие услугу у человека и человека, который говорил по скрипту робота, одинаково оценивали взаимодействие почти по всем показателям: эмоциональность, доброжелательность, адекватность реакции и активность участия, качество речи, удобство и лёгкость получения услуги и др. \n\nПри этом стиль общения робота тяжело давался сотрудникам, а внешне различия выражались в безэмоциональности, минимальном визуальном контакте, многократном повторении без интонаций одних и тех же фраз одному и тому же клиенту. Интересно, что несмотря на это именно роботизированный человек получил заметно более высокую оценку за «свободу общения». \n2. Контекст определяет отношение к роботам\nРеспонденты, интересующиеся современными технологиями и робототехникой, выше оценивают качество взаимодействия с роботами. Но есть один нюанс. \n\nПолевое исследование показывает: те, кто положительно относятся к фильмам и книгам про роботов, выше других оценивают взаимодействие с роботом при получении госуслуг. \nЧем выше погруженность человека в тему роботов в целом, тем выше его оценка взаимодействия с роботом, но среди самых увлеченных оценки снижаются и становятся снова одними из самых низких. Исследователи предполагают, что это связано с завышенными ожиданиями этой категории людей. \n\nОчевидно, что на степень принятия роботов как ассистентов и как партнеров влияют не только социальные установки, но и опыт взаимодействия с ними. И, следовательно, чем чаще люди будут взаимодействовать с роботами, в частности, роботами Promobot, тем комфортнее и безопаснее последние будут восприниматься. \n\nЕлена Гаврилина, к. филос.н., доцент МГТУ им. Н.Э. Баумана\n3. Опыт взаимодействия влияет на решение его повторить\nЛюди, получившие услугу у робота, более расположены обращаться к нему снова, чем те, кто не имеет этого опыта. Расширение опыта взаимодействия с роботами приводит к увеличению количества обращений к ним.\n\nПосле взаимодействия с роботом в среднем на 30% возрастает готовность обращаться к нему в будущем. \nКлиенты МФЦ, которые получали услугу у робота, вдвое чаще готовы получать в будущем услуги у робота, чем те, кто получал услугу у человека. При этом удовлетворенность от коммуникации с роботом не зависит от того, сам обратился человек к роботу или его направили администраторы. \nСреди тех, кто получил услугу у дроида, 83% готовы вернуться к нему в будущем. \n\n4. Молодые люди более позитивно настроены к роботам\n\nВ МФЦ получать услуги с помощью роботов в основном предпочитают молодые люди 18-30 лет. Причиной они называют быстроту и простоту взаимодействия с роботом. \nОпрошенные среднего возраста если и обращаются к роботу, то по направлению администратора. Возрастные участники исследования чаще обращаются к человеку, потому что предпочитают живое общение. \n\nПолученные выводы позволяют утверждать, что изучение социальных установок в отношении роботов у пользователей-клиентов является первым в России научно-прикладным исследованием, которое соответствует высоким мировым стандартам в области оценки технологий (Technology Assessment).\n\nНаталья Черепанова, Доцент Школы инженерного предпринимательства, Томский политехнический университет \nПочему это важно?\nРоботы уже выполняют функции помощников, репетиторов, тренеров, администраторов, консьержей и даже компаньонов. Это обеспечивает потенциал для повышения качества жизни широкого круга людей.\nЗадача проектирования социальных роботов, которые способны к «человеческому» взаимодействию, очень сложна. Разработчикам нужно спроектировать поведения роботов так, чтобы люди могли устанавливать с ними связи похожие на «человеческие», например дружеские.\nДля того, чтобы проектировать поведение робота должным образом и нужны подобные исследования.\nЧто дальше?\nРассказывает Елена Серёдкина, один из координаторов исследования.\nВ основе современной робототехнической парадигмы должна лежать концепция проактивных роботов, которые выступают инициаторами диалога с человеком и демонстрируют (имитируют) социальный и эмоциональный интеллект, поощряя людей к коммуникации.\nСледующий шаг будет связан с более глубоким анализом гибридных систем и переходом к полевым исследованиям с участием гиперреальных антропоморфных роботов. С одной стороны, такие роботы, хотя бы частично, облегчают естественное взаимодействие с людьми. С другой же, чем больше робот похоже на человека, тем вернее мы «падаем» в «зловещую долину». Феномен отторжения антропоморфных роботов людьми до сих пор до конца не изучен. В следующий раз мы выйдем в поле с антропоморфными роботами и посмотрим, какой будет реакция людей.\nНаписано на основании отчётов по результатам социологического исследования.", {"day": "19", "month": "февраля", "time": "20:19"}, {"rate": 8, "views": 3700}], ["Обычно робототехника из России вызывает в основном смех, и некоторое разочарование при презентации. Эта реакция привычна для большинства из стран СНГ, но уже не очевидна для других стран. Один из примеров перемен — последняя разработка компании Промобот, которая испугала Courtney Linder из журнала Popular Mechanics.\n \n\r\n(пример видео для понимания что именно имеет в виду Courtney Linder)\n\r\nДалее уже перевод ее впечатлений от Промобота Robo-C в статье Russians Will Do This to You, Whatever This Is, If You Want.\n\r\nНазвание статьи интригует…\n\nРусские сделают «это» с тобой, если хочешь.\r\nРоссийский стартап под названием Promobot предлагает новую линейку андроидов, которых можно сделать похожими на заказчика.\n\r\nКомпания утверждает, что робот может использоваться в качестве офисного работника, консультанта, администратора или соседа по комнате.\n\r\nRobo-C (так называется робот-андройд) имеет более 600 выражений лица и реалистичную искусственную кожу.\n\r\nТолько представьте себе картину будущего.\n\r\nВы подходите к входной двери своего дома, вставляете ключ в замок, и затем заходите внутрь. Это был долгий день на работе. Вы говорите в комнате — «какие команды НФЛ играют сегодня вечером?», и электронный голос говорит вам: «Грин Бэй сегодня играют с« Филадельфия Іглс»!», и за тем за углом стены вы видите «это». Это ваш двойник. Это робот. Вы добровольно приобрели его.\n\r\nИ это реально. \n\r\nТак Российская стартап-компания Promobot убеждает нас в том, что нам «это» нужно, несмотря на то, что «это» сильно мешает и, откровенно говоря, не нужно, учитывая, что у нас уже есть устройства вроде голосового помощника, которые могут помочь нам определить время, прочитать погоду, запустить музыку и добавлять события в наш календарь.\n\r\nRobo-C является универсальной платформой, на базе которой компания создала уже другие «лица», которые похожи на Арнольда Шварценеггера и Альберта Эйнштейна. \n\r\nЭто первые «звездные» андроиды компании. Настоящий Шварценеггер даже встретился со своим клоном в начале этого года за кулисами Synergy Global Forum, в образовательном центре в Нью-Йорке.\n\r\nЗнаменитые роботы это привычно, Но вот настоящий шок если вы сможете заказать такого робота, который будет выглядеть точно так же, как вы, ваш партнер, или ваш ребенок. Цена такого бота и сроки производства не указаны на сайте, но Promobot рекомендует потенциальным клиентам оставлять свои контактные данные, добавляя что «наш специалист свяжется с вами, и расскажет вам все об условиях покупки — доставки роботов \".\n\r\nКаждый Robo-C может имитировать более 600 выражений лица, чтобы показать различные эмоции, такие как страх, радость и удивление, и многие другие. Антропоморфная машина может поддерживать разговор, и отвечать на вопросы. Компания даже разработала специальную искусственную кожу, чтобы имитировать какое-то ложное чувство человечности, если вы возьмете руку одной из этих моделей.\n\r\nЭти роботы поставляются с зарядной станцией, защитным стеклянным кубом и чем-то, что называется роботизированным комплексом.\n\r\nАндроиды напоминают персонажей в натуральную величину из игр The Sims, поэтому они не выглядят злыми — просто странные и не совсем такие, какие вы ожидаете увидеть, сев в кресло дома.\n\n\r\nНо более странным вариантом является создание бота на основе того, кого вы любите. Это напоминает эпизод из «Черного зеркала» («Be Right Back»), где главная героиня возвращает своего мужа к жизни как робота, который выглядит точно так же, как он, и запрограммирован внутри по образцу «оригинала». \n\r\nВсе это кажется немного странным. \n\r\nP.S. — Интересный момент который отметил уже я — функционал робота в принципе может быть расширен за счет более широкой сферы применения при доработке.\n\r\nНапример это может выглядеть так. \n\n\r\nВ конце концов пить с роботом, станет намного приятнее чем с нынешними вариантами роботов-барменов.     Только зарегистрированные пользователи могут участвовать в опросе. Войдите, пожалуйста. Согласны вы с мнением Courtney Linder? \n            56.25%\n           Да \n            9\n           \n            43.75%\n           Нет \n            7\n            \n       Проголосовали 16 пользователей. \n\n       Воздержались 23 пользователя.", {"day": "25", "month": "ноября", "time": "00:28"}, {"rate": 4, "views": 4400}], ["Швейцарская компания Advanced Robotics закупит около тысячи российских роботов «Промобот» и получит права на их продажу по всему Евросоюзу. Сумма контракта на поставки до 2024 года составит 18,5 млн евро.\n\n\nИсточник: sk.ru\n\r\nКак рассказал «Ведомостям» сооснователь компании «Промобот» Олег Кивокурцев, в 2019 году российская компания отправит заказчику 27 роботов, а затем ежегодно объем поставок будет увеличиваться.\n\nПо мнению генерального директора Advanced Robotics Габриэля Гартнера, компания «Промобот» «предоставляет лучший баланс технологических возможностей, стоимости и гибкости в использовании». Российский производитель предлагает высокие технологии по справедливой цене, считает он.\n\r\nAdvanced Robotics планирует продавать российских роботов ритейлерам, отелям, бизнес-центрам, аэропортам. Среди потенциальных покупателей Габриэль Гартнер отмечает Media Markt, Deutsche Post, Marks & Spencer, BMW и другие компании.\n\n\r\nВ прошлом году «Промобот» заключил контракт на поставку роботов с американской Intellitronix, дочерней компанией US Lighting Group. По его условиям, за пять лет российская компания должна поставить заказчику 2800 «Промоботов». Пока в США отправлено только 97.\n\r\nПо словам исполнительного директора Национальной ассоциации участников рынка робототехники Алисы Конюховской, за рубежом растет интерес к российской робототехнике, но пока только «Промоботу» удалось получить так много заказов на сравнительно крупные суммы. 65% выручки компании генерирует именно экспорт. По данным Олега Кивокурцева, в 2018 году выручка составила 213,5 млн рублей.\n\r\n«Промобот» производит сервисных роботов. По данным компании, сейчас 492 их робота в 34 странах мира выполняют функции сотрудников – гидов, консьержей, консультантов, промоутеров – «заменяя и дополняя их». \n\r\nРоботов можно встретить в аэропортах, отделениях сотовой связи и банках, торговых и бизнес-центрах, ресторанах, музеях, жилых комплексах.\n\n«Робот общается с людьми, распознает лица и речь, самостоятельно передвигается, избегая препятствия. Робот автономный – он не нуждается в контроле со стороны человека. Робот подключается к любой внешней системе: базам данных, системе безопасности, сайтам и сервисам», — сообщает компания. \r\nИнтервью с техническим директором компании и экскурсия на производство в Перми — в статье на Хабре.", {"day": "23", "month": "сентября", "time": "21:24"}, {"rate": 21, "views": 5500}], ["13 сентября Национальной Ассоциации участников рынка робототехники исполняется 4 года! За это время Ассоциация провела более сотни мероприятий, организовали с десяток поездок и бизнес-миссий, а число участников Ассоциации выросло с 2 до 45. \n\n\n\r\nНАУРР — отраслевой союз, объединяющий игроков рынка промышленной робототехники, включая отечественных и зарубежных производителей и интеграторов, а также производителей сервисной робототехники, исследовательские и образовательные организации, разработчиков подсистем и программного обеспечения для роботов. \n\nУчастники НАУРРООО «Фанук»\r\nООО «Кука Раша»\r\nООО «УРТЦ Альфа-Интех»\r\nООО «ДС-Роботикс»\r\nАО «РОББО»\r\nООО «Вебер Комеханикс»\r\nООО «Эйдос-Робототехника»\r\nООО «Вектор-Групп»\r\nООО «АВИ Солюшнс»\r\nООО «Авиатех»\r\nФГАОУ ВО Национальный Исследовательский Томский Политехнический университет\r\nООО «ФРУКТОНАД ГРУПП»\r\nООО «АББ»\r\nООО «КАВАСАКИ ХЭВИ ИНДАСТРИЗ РУС»\r\nООО «Абаджи Роботик Системс»\r\nООО «ПРОМОБОТ»\r\nООО «ТРА РОБОТИКС»\r\n ООО «Аврора Роботикс»\r\nЛаборатория робототехники Сбербанка\r\nООО «Альфа Роботикс Трейд» \r\nUniversal Robots\r\n ООО «Производственное объединение «Зарница»\r\nООО «ВИСТ МАЙНИНГ ТЕХНОЛОДЖИ» \r\nЦНИИ РТК\r\nПермский Национальный Исследовательский Политехнический Университет \r\nООО «АвангардПЛАСТ»\r\nООО «ИТСК»\r\nООО «Мицубиси Электрик (РУС)»\r\nООО «Омрон Электроникс»\r\nООО «Сервостар»\r\nООО «Смайтек»\r\nООО «Рэди Робот»\r\nФГАОУ ВО «УРФУ имени Первого Президента России Б.Н. Ельцина»\r\nАНО «Вектор Технологий»\r\nЯСКАВА Нордик АБ\r\nООО «ПРОИНТЕГРАЦИЯ»\r\nАО МГК «ИНТЕХРОС»\r\nООО «ИнКрафт»\r\nООО «АМ Сервис»\r\nООО «ХАРТУНГ»\r\nООО «КОПТЕР ЭКСПРЕСС ТЕХНОЛОГИИ»\r\nООО «Технологический Центр Тена»\r\nООО «Арипикс Роботикс»\r\nООО «ИнноДрайв»\r\nУниверситет Иннополис\n\n\n\r\nRussian Robotics Party — мероприятие для нетворкинга. Помимо робототехников в мероприятии будут участвовать партнеры НАУРР из государственных ведомств и институтов развития, инвесторы и журналисты. \n\r\nЕсть ощущение, что все уже утомились от всевозможных форумов, лекций и дискуссий, есть потребность в новом формате встреч для живого человеческого общения, для расширения контактов и связей. Именно из такого общения могут рождаться новые партнерства и новые проекты, когда нужные люди собираются в одном месте и просто хорошо проводят друг с другом время.\n\nПрограмма19:30 — 20:00 Регистрация\r\n20:00 — 20:10 Приветствие\r\n20:00 — 21:00 Welcome dinner, прогулка по Робостанции, нетворкинг\r\n20:45 — 21:00 НАУРР: вчера, сегодня, завтра\r\n21:00 — 21:15 Как выходить на зарубежные рынки? \r\n21:30 — 21:45 Вручение сертификатов участника и благодарностей \r\n22:00 — 23:00 Игры и развлечения \r\n22:30 — 23:00 Торт =)", {"day": "13", "month": "сентября", "time": "09:06"}, {"rate": 10, "views": 562}], ["Роботы уже перестали быть героями фантастических фильмов и много лет живут среди нас. Просто мы не всегда это замечаем. \n\r\nОднако задач, которые мы готовы отдавать в их металлические (или пластиковые) «руки», все больше. В результате растет эффективность многих процессов, а вместе с этим появляются и страхи сокращения рабочих мест. По прогнозам McKinsey Global Institute, уже к 2025 году «вооруженные искусственным интеллектом» роботы могут заменить до 100 млн работников.\n\n\n\r\nВпрочем, такой настрой разделяют далеко не все эксперты. Несколько недель назад прошла конференция Skolkovo Robotics, и участники пленарной сессии «Роботы среди нас. Робототехника и искусственный интеллект в жизни современного человека» как раз обсуждали перспективы развития отрасли и то, как это скажется на нашей жизни.\n\r\nУчастниками сессии стали Председатель Фонда «Сколково» Аркадий Дворкович, Первый заместитель Председателя Правления Сбербанка Лев Хасис, Генеральный директор «ВИСТ групп» Дмитрий Владимиров и Председатель совета директоров компании «Промобот» Алексей Южаков. Делимся их тезисами в нашей подборке. \n\nО функциональных преимуществах роботов\n\nРоботы уже активно входят в нашу жизнь. Просто мы не всегда это замечаем, поскольку у них могут быть разные формы и виды. Например, в Сбербанке все меньше кредитных решений принимается людьми. Автоматизированные системы помогают бороться с потенциальным фродом, отслеживать интересы клиентов и не допускать дополнительного риска со стороны киберпреступников. \nПрограммные роботы уже активно используются для организации документооборота. В частности, обработка документов в цифровой вид осуществляется роботами. Но физические роботы также применяются широко. Ежегодно мы [в Сбербанке] пересчитываем около 100 тысяч тонн наличных денег. Роботизированный участок пересчета может обработать более полутонны денег в течение дня. Это примерно в три раза выше по производительности труда по сравнению с человеком.\nОдна из самых перспективных отраслей реального сектора для внедрения робототехники – горнодобывающая промышленность. Уже сейчас успешно осуществляются проекты по добыче твердых полезных ископаемых без применения живой рабочей силы.\nСегодня очевидна потребность и в роботизированной подземной технике, например, в подземных рудниках. Роботы в горнорудной отрасли позволят сделать труд горняка безопасным, но при этом сохранить производительность. Для горнодобывающих компаний неприемлема ситуация, при которой робот будет безопасен, но при этом менее производителен, чем традиционная техника.\n\nОб актуальных проблемах робототехники\n\nРоссия отстает в вопросах промышленного применения роботов. Когда деньги «дорогие», естественнее сохранять существенную часть живой рабочей силы, а не инвестировать в робототехнику. Конечно, эти вложения окупились бы, но на конкретной бизнес-модели это может не работать. \nВнедрение роботов сильно зависит от подготовки специалистов. Сейчас падает квалификация специалистов, в частности, водителей, машинистов. Новые профессионалы, которые будут управлять роботами и дистанционной техникой, – это будущее промышленности. \nСейчас рынок сервисной робототехники, по оценкам Международной ассоциации робототехники, прирастает в разы быстрее, чем промышленной робототехники. Это некая тонкая игла, которой мы в России можем прошивать мировое пространство. Прекрасно задавать тренды в сервисной робототехнике не только в нашей стране.\nСервисные роботы в бизнесе дают дополнительные возможности. «Промобот» создал и запатентовал свою систему распознавания речи, и уже сегодня мы можем обучить нейронную модель.\n\nО перспективах отрасли\n\nЕсть мнение, что роботы будут угрожать трудоустройству людей, но скорее они будут создавать высококвалифицированные рабочие места. В целом доказано, что искусственный интеллект в работе с человеком более полезен в использовании, чем просто робот.\nКультура взаимодействия с роботами в общественной среде будет формироваться не очень долго, гораздо быстрее, чем раньше происходила адаптация к новым технологиям. Однако на это уйдут не месяцы, а годы.\nРазработки стартапов и ученых-робототехников должны быть востребованы бизнесом. Необходимо поддерживать те организации, которые готовы использовать этих роботов, выполняя функции тестового полигона, но в реальных условиях.\nЛюбой опыт внедрения роботов в B2B и грамотная его оценка капитализирует не только поставщика, но и заказчика. Через быстрый перебор гипотез всем можно найти то решение, которое будет эффективным.", {"day": "15", "month": "июня", "time": "09:00"}, {"rate": 8, "views": 4900}], ["Второй рассказ о форуме “Атомэкспо-2019” посвящен экспозиции. В целом ее можно разделить на две части — большое, продвинутое, красивое и научно-популярное пространство Росатома и обычные стенды участников.\n\n\nПредставители атомных агентств мира открыли в Сочи сквер “Зеленый квадрат”, это дерево должны были пересадить туда после окончания работы форума\n\n\n\r\nСлоган “Будущее здесь” ощущается сразу на проходной. Будучи энтузиастом моноколес, я не мог не сфотографировать единомышленников.\n\n\n\r\nРосатом представил свою экспозицию в отдельном зале. Слово “научно-популярное” выше использовано совершенно справедливо, кроме конкретных проектов госкорпорации была организована демонстрация жизненного цикла атомного топлива от добычи до захоронения, дополненная интересной информацией. Центр зала был отдан под интерактивную инсталляцию, которая меняла изображения на экранах, играла хороший дроун-эмбиент и реагировала на жесты. Артефакт выглядел как произведение цетагандийских художников из фантастики Лоис Макмастер Буджод (для не читавших, это комплимент, цетагандийское искусство сложное, высокотехнологичное и красивое).\n\r\nПуть ядерного топлива начинался в секции с режущим глаз айтишника названием “Front End”.\n\n\n\r\nТак выглядит желтый кек — урановый концентрат U3O8. Конечно же, показана имитация, но высокий в целом реализм несколько портит непришитая перчатка, из-за которой “кек” рассыпан снаружи.\n\n\n\r\nАутентичная топливная сборка. Из уранового концентрата готовятся топливные таблетки, которые загружаются в тепловыделяющие элементы (ТВЭЛ), которые в свою очередь устанавливаются вот в такую сборку (ТВС).\n\n\n\r\nВырез крупным планом. “Трубочки” — ТВЭЛы, черное в них — топливные таблетки (хотя по пропорциям они выше своей ширины, т.е. цилиндрики).\n\n\n\r\nРаздел “Разработка и строительство”. Вообще, на экспозиции было много интерактивных стендов. А конкретно здесь можно было виртуально собрать плавучую АЭС и посмотреть на стадии строительства обычной станции.\n\n\n\r\nИнтерактивная модель наглядно иллюстрировала, насколько сложен и объемен проект АЭС — по мере движения по этапам подсвечивались все новые здания, а на экране шли пояснения.\n\n\n\r\nСледующий раздел, “Наука и инновации”, был посвящен новым проектам. Вот, например, макет реактора  “Шельф”, главной особенностью которого является минимальная необходимость в обслуживании (поэтому фигурка человека скорее для масштаба). Капсула герметична, поэтому ее можно, например, погрузить на морское дно около небольшого города и управлять с наземной станции. Раз в десять лет капсула извлекается и обслуживается.\n\n\n\r\nМодель сооружений проекта “Прорыв” — реактор “БРЕСТ-ОД-300” замкнет топливный цикл и, кроме выработки энергии, позволит извлекать из отработанного ядерного топлива все, что может быть полезно, уменьшая количество и активность ядерных отходов.\n\n\n\r\nСхема замкнутого ядерного цикла: бирюзовый слева — энергетические реакторы, синий в центре — “БРЕСТ”, сверху показан процесс обработки и разделения отработанного ядерного топлива, зеленый внизу — отходы.\n\n\n\r\nВ разделе “Машиностроение” показывали красивые анимированные модели реакторов с поясняющими данными.\n\n\n\r\nСамый серьезный стенд был в разделе “Генерация”. Сейчас у АЭС есть симуляторы (гид называл это также цифровой копией), которые используются на протяжении всего жизненного цикла станции. На стадии проектирования можно посмотреть, что как и где лучше разместить и показать это заказчику. Когда станция работает, на модели можно обучать персонал в условиях максимально приближенных к реальной обстановке, но без риска повредить настоящую станцию ошибочными действиями. Адекватная физика, отраженная в модели, позволяет устраивать даже симуляции аварий и получать опыт без реального риска и вреда.\n\n\n\r\nСтенд, демонстрирующий отжиг корпуса реактора. В условиях постоянного радиационного облучения металл становится хрупким. А если корпус нагреть и очень медленно охладить, то исходные свойства металла восстановятся, и реактор прослужит еще полтора десятка лет. \n\r\nМного интересного было в секторе “Новые бизнесы”. У большого экрана, рассказывающего про Северный морской путь, гидом был настоящий старший помощник ледокола “Таймыр”. Мы немного поговорили. Любопытно, что сейчас у ледоколов нет необходимости в собственной авиации для ледовой разведки — свежие спутниковые фотографии доступны и гораздо удобней. Поэтому у новых проектов ледоколов есть вертолетная площадка, но нет полноценного ангара. А необычная носовая часть объясняется просто — весовым балансом корабля. Жилые помещения на носу уравновешивают машины и оборудование на корме. “Ленин” имел традиционные пропорции, потому что был экспериментальным кораблем, у класса “Таймыр” инженеры победили дизайнеров и поставили, на мой взгляд, некрасивые кубические надстройки, а у Лидера“ инженеры и дизайнеры сумели соединить практические и эстетические потребности в красивое решение.\n\n\n\r\nМакеты источников ионизирующего излучения, которые используются в приборостроении, сельском хозяйстве, медицине.\n\n\n\r\nНовые композитные материалы.\n\n\n\r\nИнтересные дисплеи, я так и не разобрался, как они работают. Но выглядит симпатично — анимация накладывается на трехмерную картинку. А технологии 3D-печати — это уже почти мейнстрим.\n\n\n\r\nПростой симулятор умного города — выделяем ресурсы на проекты по улучшению инфраструктуры, смотрим на результат. Проиграть невозможно, но, в зависимости от выбранных проектов, польза для города будет разной.\n\n\n\r\nVR — красиво и наглядно.\n\r\nНу и, наконец, в “Бэкенде” завершение эксплуатации. Мы привыкли к тому, что радиоактивные отходы зеленые, жидкие и светящиеся, но в реальности совпадает лишь цвет. \n\n\n\r\nЯдерные отходы витрифицируют (связывают со стеклом). После такой операции захоронение отходов под землей становится скорее психологическим жестом, потому что при соблюдении технологии хранение их на поверхности будет настолько же безопасным.\n\n\n\r\nПереходим к стендам других участников. В целом можно выделить две заметно отличающиеся группы — демонстрирующие флаг и ищущие бизнес-партнеров. Первая группа — это уже известные всем игроки, организации, близкие к Росатому, и атомные станции. Отличительная черта киосков первой группы — там в лучшем случае есть бумажные листовки. И найти интересные для рассказа факты сложнее. В наиболее курьезном варианте представители российского бюджетного учреждения, увидев на мне бейдж “пресса”, банально отказались общаться. Вторая группа же старается подать товар лицом, поэтому их киоски лучше оформлены, наполнены экспонатами, и рассказывать о них интересней. Хотя и здесь не обошлось без курьезов, обитатели одного киоска, увидев, что я собираюсь его сфотографировать, срочно покинули свои места, не желая попадать в кадр.\n\n\n\r\nБольше всего расстаралась компания “Зенитчерноземье”, выкатившая промобота-зазывалу. А предлагает она несъемную опалубку из бетона, армированного металлической фиброй (“проволока” в пакете внизу). Мне, человеку далекому от строительства, казалось, что съемная опалубка должна быть экономически выгоднее, но, по словам представителя компании, на стройках с ней обращаются не особо бережно. А предлагаемая ими опалубка делается готовыми блоками, быстро устанавливается и имеет плюс для атомной отрасли в повышенном поглощении радиации. Но для бытового строительства она пока дороговата.\n\n\n\r\nНеобычность стенда МЦОУ в том, что его клиентами являются государства. МЦОУ — международный центр по обогащению урана, и его цель — обеспечение поставок ядерного топлива. Страна-участник отказывается от самостоятельного проекта по обогащению урана, тем самым поддерживая договор о нераспространении ядерного оружия, а взамен получает доступ к ядерному топливу, пригодному только для АЭС. Пока что в организации кроме России состоят только Казахстан, Армения и Украина, но, кто знает, может быть, в будущем появятся новые участники.\n\n\n\r\nСистемы видеонаблюдения для строек компании “Техно-щит”. Говорят, востребованы для случая, когда работы выполняются субподрядчиком.\n\n\n\r\n“Гринатом” является дочерней компанией Росатома, поэтому относится к первой категории и демонстрирует флаг, но креативно. За неделю на Python+OpenCV специально к конференции написали программу, которая считает посетителей и определяет их настроение, так что киоск выглядит интереснее. Кроме того компания взяла на форум разработчиков нетворкинга ради, и, судя по обсуждениям, которые я заметил, идея оказалась удачной.\n\n\n\r\nСтартап, занимающийся карбидом кремния, предлагал контейнеры для радиоактивных отходов и футеровку для печей.\n\n\n\r\nМодель реактора APR-1400 южнокорейской компании KEPCO. Конструкция, которую начали разрабатывать в 1992, дошла до уровня, когда ее можно предлагать на рынке — дома запущен один блок, тестируются два, строятся три. Кроме того идет строительство АЭС Барака, первой в ОАЭ.\n\n\n\r\nА вот стенд китайской CNNC напротив вызывал ощущение слабой заинтересованности — меньше сотрудников, минимум буклетов и никаких сувениров.\n\n\n\r\nМобильный агрегат для проверки клапанов без снятия от Пензенского конструкторско-технологического бюро арматуростроения.\n\n\n\r\nВообще, немало компаний-участников форума работают не только с атомной отраслью, но и с нефтяной. Вот, например, расходомеры ЭМИС.\n\n\n\r\nСтенд резидентов Сколково. Здесь предлагались разнообразные продукты — химические предшественники для ядерной медицины, датчики наклона построек (их продукция, кстати, стоит на здании, где проходил форум), дозиметрические системы, антикоррозионные покрытия, оборудование для электротомографического мониторинга.\n\n\n\r\nАтомная отрасль для обычного человека ассоциируется с треском счетчика Гейгера, но именно дозиметров было представлено мало — вот чуть ли не единственный стенд компании Атомтех.\n\n\n\r\nТитановая роза от компании ВСМПО-АВИСМА. Многие слышали про ее поставки титана авиации, но он применяется и в атомной отрасли.\n\n\n\r\nРаз уж зашла речь об искусстве, здесь отличилась Трубная металлургическая компания, представившая “Мыслителя” из проволоки. Вообще, отличный ход, это был один из самых фотографируемых объектов форума.\n\r\nВыражаю благодарность за приглашение пресс-службе Росатома и лично Олегу Кондраненкову.\n\r\nОкончание следует.", {"day": "23", "month": "мая", "time": "06:58"}, {"rate": 23, "views": 2600}], ["Компания Promobot — это молодая компания из Перми, это стартап с продуктом, признанным во всем мире. Сейчас это крупнейший производитель автономных сервисных роботов на территории Северной и Восточной Европы. В посте краткая история разработки и достижения успеха. Под катом много уникальных фото с производства. Производство компании занимает две тысячи квадратных метров в г.Перми, на базе технопарка «Морион». Производственный цикл включает в себя производство электроники, пластиковых и металлических деталей. На базе предприятия осуществляется разработка программного обеспечения, сборочные операции, тестирование основных систем, пусконаладочные работы и техническая поддержка.\r\nНа вопросы отвечает Игорь Еремеев, технический директор Промобот.\n\n\n\nВаша компания уникальна для России. Вы не останавливаетесь на достигнутом и постоянно развиваетесь. Можете ли сейчас вспомнить как все начиналось? \n\r\nКомпания Промобот была основана в 2015 году Алексеем Южаковым, мной, Олегом Кивокурцевым и Максимом Утевым. Мы представляли робота-снегоуборщика на конкурсе инновационных проектов «Большая разведка» в 2014 году. Там Алексей Южаков выступал в качестве спикера.\n\r\nПосле выступления, Олег познакомился с Алексеем, рассказал о том, что мы занимаемся различными проектами в области робототехники и предложил внедрить результаты в проекты Алексея. Южакову идея понравилась и он предложил встретиться для обсуждения перспектив.\n\r\nДалее, именно Южаков предложил сделать робота-промоутера. Он предложил нам помещение и финансирование. Мы же должны были построить первый прототип.\n\n\n\r\nПостроили. Повезли тестировать в один из торговых центров, и там он привлек очень много внимания. И так решили продолжать.\n\nЧто Вас мотивировало? \n\r\nВсе начиналось как хобби. Точнее, все началось с учебы, потом перешло в хобби, и потом появилась финансовая составляющая. \n\nОглядываясь назад, все ли Вы сделали правильно? Какие грабли собрали по дороге? \n\r\nВ случае с Промобот мы сделали все правильно. До этого мы делали робота-снегоуборщика, и он был не востребован. Несколько мы продали и получили не самую хорошую обратную связь. Он был недостаточно удобен, недостаточно технологичен. Поэтому она не ушла в массы. Мы вовремя переключились на Промобот.\n\n\n\r\nТогда как раз мы познакомились с Алексеем Южаковым. Он стал идейным вдохновителем. До этого были технари — я и Максим Утев, был Олег Кивокурцев, который умел продавать.\n\r\nИ еще одна деталь, я всегда работал с друзьями или с родственниками. Это были мои грабли. Но когда я связался с Олегом и Максимом, я начал работать с абсолютно незнакомыми мне людьми. У нас не было к друг другу претензий, обстоятельств, обязательств. Мы просто начали делать то, что было нужно.\n\n\n\nС какими сложностями вы столкнулись и как их преодолели? \n\r\nФинансирование. Когда мы делали снегоуборщика, то мы делали его за свои средства. Тогда у меня был свой бизнес и я мог себе это позволить. Но, наверное, ребятам, которые только закончили университет, самостоятельно заняться коммерческой робототехникой будет сложно.\n\r\nУпорство. Промобот отличается от других команд, где я работал, именно этим качеством. Здесь непозволительно откладывать на завтра то, что можно сделать сегодня. Нужно брать и делать. Мы сидим здесь постоянно и работаем на результат. Любыми путями. Чем раньше результат, тем лучше. Любой результат. \n\n\n\nСейчас Вы больше стартап или технологическая компания? \n\r\nЗдесь очень тонкая грань. Мне кажется, что внутри офиса мы все еще остаемся стартапом — в плане управления, структуры, людей, мобильности. Вне офиса, наверное, мы уже комания. Однако никому не нужно стремиться переставать быть стартапом.\n\nИгорь, делаете ли Вы что-то руками? Приходиться ли моделировать, кодить или браться за дрель? \n\n\n\n\r\nМне очень много чего приходится делать своими руками. Час назад я мог быть системным администратором и разбираться с серверами, через полчаса я программист и пробую новый код для общих нужд, а еще через два я уже строю стол в переговорку и занимаюсь обустройством офиса. Поэтому да.\n\n\n\nКак работает Ваш робот? Какие аппаратные компоненты Вы используете? \n\r\nБольшинство аппаратных компонентов разработаны нами собственноручно, за исключением вычислительных модулей. Вычислительные модули — это обычный компьютер, уменьшенный в разы. А все платы управления, сервоприводы и так далее — все это сделано нашими специалистами в Перми. \n\n\n\r\nЕсли смотреть в процентном соотношении, то у нас сейчас 70 отечественных и собственных комплектующих на 30 импортных. Из этих 70 — половина наших комплектующих. Металл изготавливается подрядчиками в Перми, по нашим чертежам. Детали корпуса — сам пластик закупаем, но формуем у нас на производстве. Вся аппаратная составляющая разрабатывается и собирается тоже нами. Практически все делаем сами.\n\n\n\nИспользуете ли Вы ROS? Какие-то другие технологии в софте? \n\r\nМы использовали его с самого начала. Когда мы начинали, у нас не было программистов и я делал все сам. Я случайно выбрал ROS, по нему было много видео-пособий. А в последствии оказалось, что это было правильным решением.\n\n\n\r\nКстати, говоря о граблях, то не стоит изобретать велосипед и пытаться придумать все с нуля. Нужно пользоваться тем, что уже есть и адаптировать.\n\r\nМы это делаем по сей день. Если нам нужен пакет навигации, то берем что-то из открытых источников и дорабатываем под себя. И когда долго идет работа, уж ничего не остается от исходных данных. Но в начале это дает некую точку роста, относительно которой ты можешь двигаться.\n\n\n\r\nРаньше использовали OpenCV — библиотека для распознавания образов и изображений. Она до сих пор у нас используется, но очень мало. Распознавание лиц сейчас у нас реализуется через решение от партнеров. Это не наша разработка, однако мы давно работаем с ними и поставляем массивную BigData. То есть слепки изображений со всех роботов, которых уже больше четырех сотен. На их основе программа все лучше и лучше распознает.\n\n\n\r\nЛингобаза, с помощью которой общается робот, также полностью наша разработка. Она начала свою разработку еще с 2014 года, потом претерпела значительную доработку и вышла вторая версия системы. По сути, сейчас она содержит несколько составляющих — это база данных с парами ответ-вопрос, и есть часть, написанная с применением нейросетей, с помощью которой он может искать ответы на вопросы по тексту.\n\n\n\r\nРаспознавание речи пробовали от Google и Яндекс. В итоге, сейчас работаем над своим. Потому что параметры распознавания у телефона, который лежит рядом, и у робота на выставке — разные. Мы вручную обрабатывали запросы с роботов из шумных мест, с разными особенностями речи, и на основе этих данных научили систему распознавать хорошо в тех условиях, в которых находится робот.\n\n\n\nПоддерживаете ли Вы какие-то opensource проекты? Публикуете ли в открытый доступ часть своих наработок? \n\r\nНет.\n\n\n\nИспользуете ли Вы технологии непрерывного улучшения? Что ждать от promobot V.5? \n\r\nДа, мы постоянно работаем над улучшением робота. Например, робот четвертой версии сегодня и год назад — это совершенно разные роботы. У нас постоянно выходят релизы, где улучшаются распознавание, навигация, появляются новые системы безопасных движений или скриптов. \r\nВ начале каждого года мы обозначаем области оптимизации и далее уже занимаемся реализацией. \n\n\n\nВы сделали классный сервис для создания движений роботов. Как работает Motion studio? Какие технологии используете? Как происходит рендеринг? \n\r\nЭто веб-сервис. В основе лежит 3D модель робота, на ней есть интерактивные узлы, которые можно крутить, вертеть, строить из них движения. Из этого можно создать сценарий, добавить музыку, поменять цвета подсветки и так далее. Сценарий сохраняется и переносится на робота в виде файла.\n\n\n\nКакие у вас планы и перспективы, связанные с Промобот? \n\r\nВ скором времени мы запускаем свой техноблог. Вести его буду я и мои коллеги, мы планируем рассказывать о том, как делается наш робот, создавать обзоры на новинки, технику, тренды в мире робототехники. \n\n\n\r\nЕсли говорить о глобальных планах компании, то сейчас мы работаем над расширением географии поставок, отработке новых кейсов применения, например, робот-консьерж, робот-консультант, робот-экскурсовод. Это некая совокупность функций, разработанная для работы в специфичной отрасли. В компании мы называем это кейсами применения. И непрерывное улучшение, конечно же.\n\r\nP.S.: От себя хочу добавить, что безумно приятно, что у нас в России есть такие компании. Это показатель того, что для успеха не обязательно уезжать из РФ, не обязательно даже переезжать в Москву. Все барьеры находятся внутри нас. Promobot, спасибо!", {"day": "29", "month": "января", "time": "07:44"}, {"rate": 14, "views": 7400}], ["Думаю, не надо быть экспертом по туризму, чтобы предположить, что Пермь — не самое популярное направление для отдыха. Если, конечно, вы не житель Пермского края или не фанат оперы. Да-да, оперы: Пермский театр оперы и балета не может похвастаться историей Большого или Мариинки, но сумел выйти на их уровень по значимости. Я же, как и многие жители Москвы, видел бы Россию не дальше Шереметьево, если бы не работа. И именно по делам мне выпала зачекиниться в аэропорту Большое Савино недавно в первый раз, когда 18 мая я прилетел в ссылку на конференцию «Концепция развития цифровой экономики Пермского края», организованную Московской школой управления СКОЛКОВО совместно с пермской компанией АО «ЭР-Телеком Холдинг» с подачи нового губернатора Пермского края Максима Решетникова.\n\n\nКак вы можете догадаться, на фото это выглядит так же скучно, как звучит. Поэтому для КДПВ мне пришлось прибегнуть к дорогостоящей компьютерной графике\n\r\nПермь оказалась неожиданно близко — всего в двух часах лёту от Москвы. И в двух часовых поясах — поэтому, по приземлении, стрелка часов перепрыгивает на 4 часа от московского времени вылета. Это не круто. Но зато обратно лететь очень весело: самолёт, словно лангольер, проглатывает два часа времени, и садится в Москве примерно в то же время, в какое и вылетал. Или даже раньше — вполне можно перед вылетом записать послание «себе пять минут назад» и при посадке, когда часы перестроятся на московское время, вы как раз можете оказаться в пяти минутах назад.\n\r\nСели мы в совершенно новом, открытом только в ноябре прошлого года международном терминале аэропорта Перми. Он выглядит довольно компактным — никакого сравнения с московскими монстрами, тянущимися на километры — и при этом всё время, что я там провёл, он был практически безлюден. Опять же, по сравнению с практически везде перегруженными аэропортами — это приятная перемена. Рейсы из Москвы и обратно летают с раннего утра и до позднего вечера. График плотный, как расписание автобуса. Опоздали на рейс? Не вставайте, всё равно скоро будет следующий. Цены, по меркам авиации, тоже почти автобусные — 2000–3000₽. Всё вместе это оставляет приятное ощущение «от Москвы рукой подать».\n\r\nПермь в 2018 году представляет собой слоёный торт из эпох, покрытый сверху слоем глобализации. Сквозь мировые бренды сетевых заведений и магазинов, связывающих в единое культурное пространство Прагу, Москву, Пермь и Амстердам, очень явно проглядывает не успевший пока до конца износиться советский фундамент, покрытый пятнами треш-архитектуры нулевых, создавая приятно-сюрреалистичное ощущение «попаданца» между мирами: словно я вернулся в детство, в постсоветский Северодвинск, не выпуская при этом айфона из рук. Но McDonalds и Pull&Bear — это всё-таки показатель нормальности для современного мегаполиса, один из элементов конструктора, формирующего единый глобальный контекст, понятный городским жителям всей планеты. \n\r\nУникальность же Перми — в её культурных амбициях, унаследованных городом от «просвещённого губернатора» Олега Чиркунова. Логотип города, сделанный в студии Лебедева в 2009 году, вызвал шквал стёба в рунете. Но успех Пермской оперы поводом для шуток уже не кажется. Копродукции с европейскими оперными театрами вызывают уважение (а ещё в опере разбираться надо, а как дело доходит до логотипов — так каждый у мамки арт-директор). Уникальна и ситуация, когда мода, прививаемая новым начальником, переживает уже две смены губернаторов и превращается в реальный тренд. Для России это важный феномен: даже самые благие начинания у нас обычно оказываются эффектом «новой метлы» и держатся, только пока не кончатся бюджетные деньги, но всё равно не дольше, чем сидит в своём кресле их начинатель. \n\r\nНо я не театральный критик и в опере, честно говоря, не разбираюсь. Моя тема — это IT, и в Перми я потому, что именно IT новый губернатор Пермского края Максим Решетников (назначен на пост в 2017 году), выбрал в качестве хештега, под которым, видимо, хочет остаться в истории своей малой родины. \n\r\nНа мероприятии под официальным названием «Стратегическая сессия ”Концепция развития цифровой экономики Пермского края”» в прошлую пятницу собрались разные московские эксперты, сам Решетников, представители пермского IT-сектора, а также местное чиновничество в качестве зрителей в зале. Первая часть рабочего дня состояла из череды выступлений с общими рассуждениями о том, где у Перми есть шанс занять место в мировом IT и рассказов экспертов о собственных успешных кейсах по автоматизации и ИИ-зации. \n\r\nВо второй части дня все собравшиеся разошлись из большого зала по пяти аудиториям для работы по группам «Стратегия и создание условий для цифровой трансформации региона», «Цифровая трансформация производства», «Кадры для цифровой трансформации», «Цифровая трансформация госуправления» и «Умный город». Местные чиновники и IT-предприниматели совместно с приглашёнными экспертами в качестве модераторов должны были в процессе мозгового штурма набросать список проблем и хотелок, трансформировать их в список задач, которые позже уже снова будут озвучены с большой сцены в заключительной части дня. \n\r\nПо названиям групп видны направления, которые решили вытаскивать за счёт «цифровизации» когда всё остальное уже не сработало: ЖКХ, общественный транспорт, промышленность, образование и работа государства как таковая. \n\r\nТипичную проблему благих начинаний, когда энергия на преобразования уходит на создание планов этих самых преобразований, на них и заканчиваясь, Решетников решил устранить так: «А не будет никаких планов». Мол, выводы рабочих групп запишем, но формализовать не станем — просто будем в таком формате собираться раз в квартал, практически неформально сверяя часы и пополняя блокнотики новыми идеями, решениями и предложениями. Впрочем, выглядело всё происходящее более чем формально, но приём понятный и даже остроумный: оставлять гештальт незакрытым вместо обычного ощущения законченности после планирования задачи. Прикольно — да, но реальную ценность происходящего покажет только результат. \n\r\nОбещание навести порядок на дорогах и в социалке — часть обязательной программы каждого «крепкого хозяйственника», начиная, наверное, с глав сельсоветов. И с каждым новым хозяйственником приходят и новые обещания. \n\r\nПермская инициатива — пример, как говорят историки, «модернизации сверху». И поэтому, слушая первые выступления со сцены, знакомство с ней я решил начинать тоже с самого верха. Вообще-то интервью с губернатором Решетниковым мне никто не обещал, но спросить его было о чём. Идею хабраинтервью организаторы поддержали, но его судьба до последнего висела на волоске. Причиной тому — занятость губернатора. Спонтанность и госуправление вообще плохо сочетаются. Как мне потом сказали, организовать интервью с чиновником такого уровня менее чем за несколько дней — нереально. Но ведь получилось же.\n\r\nВпрочем, полноценным интервью это назвать нельзя — быстро стало ясно, что со своим, как мне казалось, скромным запросом «максимум полчаса» я губу раскатал пошире Камы. В губернаторский график мне удалось буквально просочиться, а изначальный список вопросов пришлось сократить сперва до семи, а потом до четырёх — на которые можно было получить максимально содержательные ответы. Вот и не вышло у меня поинтересоваться, например, какие у него любимые статьи на Хабре или как развивать цифровые технологии в стране, где действуют целые ведомства по борьбе с ними (Роскомнадзор). В шорт-листе, в итоге, остались:\n\n\nКакова ваша мотивация как губернатора в развитии цифровой экономики Перми — это личная амбиция, это продиктовано политически или ещё как-то иначе мотивировано?\nМногие инновации требуют серьёзных изменений в законах. Например, самоуправляемые автомобили. В США некоторые штаты уже приняли поправки, позволяющие ездить по дорогам машинам-роботам без присутствия водителя. Возможно ли такое в России на региональном уровне или это федеральный вопрос?\nКакие направления цифровой экономики легче всего внедрить без изменений законов на федеральном уровне, меняя законы на уровне региона?\nПочему пермяки могут рассчитывать на то, что весь пар не уйдёт в свисток и вся работа по модернизации не закончится только на составлении планов этой самой модернизации?\n\r\nРовно об этом мы и успели поговорить — пусть и ценой нелёгкого игнора пресс-секретаря Решетникова, в последние минуты интервью сигнализировавшей за кадром об истёкшем времени и взглядом требующей, чтобы ей вернули её губернатора.\n\n\n— Привет, Хабр, меня зовут Егор Коткин. Сейчас я нахожусь в Перми, где собрались местные чиновники во главе с губернатором и московские эксперты, чтобы решить вопрос развития цифровой экономики — как и зачем это нужно делать. Сегодня у меня есть возможность поговорить с фронтменом этого процесса — губернатором региона Максимом Решетниковым, который ответит на несколько вопросов специально для Хабрахабра.\n\r\nЯ впервые в Перми, но у меня сложилось впечатление, что все кивают на вас как инициатора этого процесса. Поэтому мой вопрос будет о вашей мотивации: связано ли это для вас с личными амбициями или с реализацией какого-то политического плана; вы хотите выделиться среди губернаторов, выполнить поручения президента или что-то ещё?\n\r\n— Ну, во-первых, здесь собрались не только чиновники и эксперты. Здесь собрались очень разные люди. В основном это представители бизнеса: как те, кто внедряют цифровые технологии и проводят цифровую трансформацию, так и те, кто производят решения и продукты для этого. Также здесь находятся представители сфер образования и науки. Так что мы постарались собрать всех участников процесса. Чиновники тоже присутствуют, но в первую очередь здесь представители предприятий и организаций, ведущие процесс цифровой трансформации и предоставляющих услуги, в том числе в системе здравоохранения. Мы тоже внедряем те же самые инновации и у нас такие же проблемы, как и у крупных промышленных предприятий: как менять бизнес-процессы, как менять организационные сферы, где брать людей, чему и как их учить. Речь идёт о больших масштабах, когда мы говорим о цифровизации здравоохранения, потому что до каждого фельдшерско-акушерского пункта в каждом селе надо подвести интернет, причём четырёхполосный, обучить фельдшеров, поставить компьютеры, предоставить соответствующее программное обеспечение. Но главное — придётся изменить все бизнес-процессы. Допустим, раз в две недели приезжает машина, забирает биоматериал, везёт в лабораторию. В лаборатории делают анализы, и уже на следующее утро их результаты фельдшер может посмотреть. Это сейчас реализуется.\n\n— Вы сказали, что чиновники здесь больше слушают и учатся, это так?\n\r\n— Да. Чиновники в данном случае — это такие же участники обсуждения, они не хуже и не лучше остальных. Есть как хорошие предприятия, которые активно внедряют [инновации], так есть и те, кто ещё к этому не пришёл. И чиновники точно такие же. У нас есть ведомства, где процесс цифровой трансформации идёт полным ходом, а есть те, кто по разным причинам отстаёт. Наша задача — максимальное вовлечение процессов внутри госуправления, предприятий, муниципалитетов, коммунальщиков и так далее. По поводу личной мотивации могу сказать, что с моей точки зрения, здесь создаётся большой шанс для Прикамья в целом измениться. У нас накопилась компетенция, и чтобы дальше поддерживать компании и заниматься развитием цифровой экономики, мы должны сами принять нововведения.\n\n— А где конкретно открылось окно возможностей?\n\r\n— Вы знаете, наверное, оно накоплено исторически, то есть у нас очень много компаний, которые предлагают и внедряют новые технологии. У нас второй крупнейший оператор широкополосного доступа к интернету в стране, теперь уже частный — Ростелеком. У нас «Промобот» сейчас находится на пике сервисной роботизации. У нас мощные университеты и очень мощная связка бизнеса, образования и науки.\n\n— То есть вы считаете, что уже накопили достаточные количественные изменения, и хотите их теперь перевести в качество?\n\r\n— Да.\n\n— А как вы будете это делать на законодательном уровне? Ведь многие инновации требуют изменения законов. Приведу свежайший пример: буквально на днях я прочитал о том, что в Америке ряд штатов разрешил машинам-роботам кататься по дорогам без человека за рулём и вообще человека в салоне. У них такие моменты решаются на уровне штатов. Что вы планируете делать с подобными инновациями, какие можно реализовать на региональном уровне и какие потребуют вмешательства в федеральное законодательство?\n\r\n— Думаю, что законодательство, наверное, хоть и является некоторым ограничителем, то есть устанавливает некий потолок, но мы его ещё не достигли по очень многим направлениям, поэтому говорить сейчас о том, что законодательство мешает цифровой трансформации, некорректно.\n\n— Давайте поговорим о направлениях, которые свободны. Какие направления открыты для вас на региональном уровне, чтобы вы могли проводить реформы? Можете ли вы те же самоуправляемые автомобили запустить по Пермскому краю без согласования?\n\r\n— А если ли у нас потребность в самоуправляемых автомобилях?\n\n— Ну например, с точки зрения безопасности дорожного движения.\n\r\n— Понимаете, любая технология должна быть востребованной. Всё будет проходить естественно, если она будет экономически целесообразна. Сейчас у нас стоят другие задачи. Рассмотрим конкретный пример. Если говорить о пассажирском транспорте, нам необходимо сменить модель распределения маршрутов. Мы обсуждаем внедрение так называемой «московской модели»: город, муниципалитеты сами заказывают транспортную работу, соответственно, предъявляя требования к качеству подвижного состава, вводя единую билетную политику, разрабатывая единую систему учёта и так далее. Так давайте выстроим эту структуру, поймём, сколько у нас реально стоит один час транспортной работы, а потом будем соотносить экономические показатели.\n\n— Это что касается общественного транспорта. Меня интересует конкретная очень популярная инновация — машины-роботы. Смогут ли они ездить по Пермскому краю, в вашей ли власти сделать так, чтобы в регионе заработало первое, допустим, Яндекс-такси без водителя?\n\r\n— Во-первых, разумеется, это не во власти региона — и вы это прекрасно знаете, это прерогатива федерального законодательства. А существует ли экономическое предложение: посчитайте, сколько сейчас стоит услуга такси без водителя и сколько с водителем? Есть ли конкретное предложение?\n\n— Экономическая выгода там огромная, на самом деле. Такси будет в разы дешевле, повысится безопасности движения.\n\r\n— Ключевое слово тут «будет». \n\n— Но Яндекс уже испытывает этих роботов. Британцы это делают, американцы.\n\r\n— Так это прекрасно. Будет услуга — будем, конечно, внедрять активно. Здесь есть два аспекта. Первое — это внедрение технологий. Конечно, мы должны быть чемпионами в этой сфере. Другой момент — это производство технологий, когда наши пермские предприятия могут предложить уникальный продукт. Разумеется, мы пытаемся эти два аспекта совместить и призываем компании брать пермских партнёров, открывать здесь центры компетенции.\n\n— Какие направления вы сможете развивать без ограничений со стороны федерального законодательства? Какие из них вы можете назвать приоритетными?\n\r\n— Вся цифровая трансформация внутри госуправления, вопросы, связанные с умными городами — тут практически нет ограничений, вернее, всё зависит от нас.\n\n— А ЖКХ?\n\r\n— ЖКХ в первую очередь. ЖКХ, транспорт, освещение, безопасность.\n\n— Поясните про безопасность, пожалуйста.\n\r\n— Ведение и контроль трафика, соблюдение скоростных режимов, габаритный контроль. Всё это мы прекрасно понимаем.\n\n— Ну, в общем, вещи муниципального уровня.\n\r\n— Так, на самом деле, надо понимать, что поскольку цифровая экономика и цифровая трансформация затрагивают конкретные процессы, мы идём туда, где эти процессы и эта конкретика присутствуют. То есть то, с чем человек сталкивается каждый день.\n\n— А образование, здравоохранение входят в это?\n\r\n— Это тоже относится к госуправлению. Когда мы говорим о цифровой трансформации госуправления, мы не имеем в виду выдачу справок, мы имеем в виду все сферы.\n\n— Мне уже сигнализируют, что у нас время заканчивается, поэтому задам главный вопрос, который не могу не задать. Как можно быть уверенными в том, что вся эта инициатива не закончится тем, что пар весь уйдёт, как только вы выполните план, как это обычно происходит с государственными инициативами? Какие основания для такой уверенности вы сможете предоставить пермякам?\n\r\n— Во-первых, мы не делаем план, потому что это действительно, наверное, не очень хороший признак. Мы даже не утверждаем эту концепцию. Это живой документ, в который мы будем постоянно вносить изменения. Мы будем всё время обсуждать, где мы сдвинулись, а где нет. Планы у нас — это конкретные проекты. Мы запустили пилотный проект по умному освещению, две площадки по умному городу, запустили большую трансформацию в здравоохранении, которую люди уже видят: работает электронная запись к врачу, люди видят, как доктор ведёт работу, всё документируется в электронных картах.\n\n— Что будет двигать эти проекты, если не брать во внимание фактор вашей личной вовлеченности? Поменяется губернатор или поменяются ваши приоритеты, как будут проекты продолжаться?\n\r\n— Там, где мы внедрим цифровые технологии, вернуться назад будет уже невозможно. А вперед проекты будет двигать общее понимание всех участников процесса, в каком направлении необходимо двигаться.\n\n— Когда будет пройдена эта точка невозврата? Когда произойдёт внедрение первого проекта, который вы не сможете развернуть?\n\r\n— В системе здравоохранения это уже идёт. Везде электронные медицинские карты; нам пока не всё там нравится, как и самим врачам, поэтому мы не останавливаемся на достигнутом. Система государственных закупок также уже внедрена. Портал «Управляем вместе» [портал правительства Пермского края] уже работает.\n\n— Спасибо, что ответили на вопросы. Будем наблюдать в режиме реального времени. Читайте статью на Хабре.\n\r\n— Вам спасибо, что приехали. Приезжайте ещё!", {"day": "30", "month": "мая", "time": "19:00"}, {"rate": 30, "views": 6700}], ["Речь естественно не идет про промышленных роботов, те прочно заняли свою нишу и у них все хорошо. Но вот «бытовые» роботы, роботы для простых людей как-то до сих пор не получили хоть какое-то приличное распространение.\n\r\nПри этом фантастические произведения, да и так сказать теоретическая концепция робототехники, рисовали нам радужные картины повсеместного использования роботов. Роботы должны были помогать людям, беря на себя сложную либо муторную работу.\n\r\nОднако, когда дело дошло до собственно разработок, разработчики натолкнулись на отсутствие нормальных идей по использованию роботов. При том, что с технологической стороны всё, в общем, неплохо, но вот куда применять этот опыт не очень понятно, а те попытки, что есть, выглядят неубедительно. \n\r\nНо все по порядку, и начну я, собственно, с того хорошего, что есть.\n\n\n\nРоботы-конструкторы\n\r\nПервое, что возможно приходит в голову, это конструкторы роботов. Lego mindstorms и тому подобные вещи.\r\nКонструкторов роботов достаточно много и представляют они из себя обычно набор деталей для сбора шасси робота, контроллер в том или ином виде («мозг робота») и набор различных датчиков.\n\r\nИмея небольшую инструкцию и чутка упорства, из этих деталей можно собрать небольшого робота, хоть это и будет по сути лишь передвигающаяся машинка.\n\r\nИспользуя же возможности Lego, можно собирать просто безумные механизмы. От гексаподов, до танков с ракетницами. От механизма для собирания кубика Рубика, до механического художника рисующего Мону Лизу.\n\r\nВсем хороши такие конструкторы, и особенно хорош Lego. Однако есть одно но. Это ни разу не продукт для простых людей. Это продукты для инженеров. Инженеров, возможно, не по профессии, а по призванию, но все же инженеров, то есть для тех людей, которые любят конструировать механизмы, а таких по определению не так чтобы много, что означает, что эти конструкторы не сделают роботов чем-то естественным для общества. Чем-то естественным как, например, в свое время стали компьютеры.\n\n\n\nРоботы-пылесосы\n\r\nСамое, наверное, массовое использование роботов в быту на данный момент, это роботы-пылесосы. Притом, что стоимость их со временем все уменьшается, они вполне неплохо выполняют свою функцию, помогая в уборке в доме. \n\r\nКонечно, полностью сделать уборку за человека они не способны, однако их использование точно повышает чистоту в доме. И вот это пока что наиболее удачное использование роботов в быту, о чем говорят и продажи таких роботов, люди их покупают миллионами. \n\n\n\r\nВ итоге у нас есть один действительно массовый продукт, и один продукт для обучения. И пока что это все, чем может похвастаться робототехника. Остальные представители роботов, уже не так впечатляют.\n\nРоботы-собака\n\r\nВ свое время Sony выпустила забавную собаку-робота Aibo. Тогда казалось, что, наконец-то, роботы придут в дом каждого человека. Однако по итогу, хороших продаж эти собаки не показали, и дело было не только в не самой маленькой цене, сейчас аналогов дешевле хватает, да вот продажи у них тоже посредственные. Дело в том, что такие роботы являются всего лишь дорогой игрушкой, а у подобных вещей существует не самое хорошее свойства, с ними играют неделю – две, а потом забрасывают в дальний угол, за ненадобностью. Поэтому-то они и не стали массовым продуктом. Ими долго пользоваться не будут. \n\n\n\nРоботы «андроиды»\n\r\nNao, Darwin OP и ряд остальных. С одной стороны используется в качестве обучающих, и тогда выступают в одной категории с Lego mindstorms, а с другой используются для развлечения. В этом случае у них те же самые проблемы, как и у роботов-собак. Это дорогая игрушка, с которой играются неделю, а потом забрасывают куда подальше.\n\n\n\nВыставочные роботы\n\r\nТут из личного опыта. Был на томском форуме молодых ученых U-novus, и там ездил робот от Московского технологического института. Про самого робота ничего не скажу, но так как я хотел на практике подтвердить свои теоретические догадки, то рядом с ним я провел достаточно много времени, наблюдая за людьми которые подходили к нему.\n\r\nИ народу заинтересованных было достаточно много! Одна проблема, поиграв с этим роботом пару минут, все теряли к нему интерес.\n\r\nЭто и есть основная проблема таких «промоботов». Они одноразовые. Они действительно привлекают к себе внимание, но только один раз, дальше на них уже всем плевать, а значит, те задачи, которые им теоретически приписываются, как лучшее привлечение клиентов, выполняться будут, но ровно до того момента, пока все не насмотрятся на этих роботов.\n\r\nСправедливости ради, надо отметить, что в качестве экскурсоводов или передвижных справочных они вполне себе могут неплохо справляться, но тут вопрос в том, много ли нужно экскурсоводов или нужны ли передвижные справочные, когда есть просто таблички с информацией…\n\n\n\nКвадрокоптеры\n\r\nУсловимся, что мы не рассматриваем те коптеры, которые управляются напрямую с пультов, а значит, роботами не являются.\r\nОстанется у нас не так уж много применений, которые пока что придумали.\n\n\n\r\nНу, во-первых «дорогая палка для селфи». Квадрокоптер летающий за хозяином и снимающий его на видео. В общем и в целом идея-то неплохая, не то, чтобы экстремалов было очень много, но видеоролики с ними, которые получаются с коптеров, выглядят всегда просто потрясно. Однако есть одно но, о котором скажу чуть позже. Ну, и кроме того, в основном это для экстремалов, в крайнем случае для туристов, так что о массовости тут, наверное, говорить не приходится.\n\r\nВторое, это доставка грузов. От маленьких дронов в ресторане, до перевозки пиццы или других мелких посылок. Ну, дроны в ресторанах идея сразу плохая, все кто видел рваные раны от лопастей квадрокоптера, сразу поймут весь ужас использования их в закрытых помещениях. \n\n\n\r\nПеревозка грузов, это уже лучше. Если убрать риски того, что малолетние вандалы с радостью начнут на такие штуки охотиться, то мы получаем отличную альтернативу «человеческим» курьерам. Быстрота пересылки, независимость от пробок на дороге, да и общая дешевизна и в итоге отличнейший продукт! Был бы…\n\r\nБыл бы, если бы не одна принципиальная проблема, стоящая в прочем не только перед именно индустрией роботов, но и, в общем, перед человечеством. И проблема это – низкая емкость современных аккумуляторов. Все нынешние квадрокоптеры могут летать около 30 минут. Некоторые умудряются до целого часа растянуть время полета, но не более. Много ли можно сделать за полчаса? Не очень. \n\r\nДля тех же экстремалов, что грозит коптеру, когда пройдет эти полчаса? Он упадет куда-нибудь в пещеру/воду/вулкан/что угодно, а это потеря не самого дешевого коптера и уж точно дорогой камеры. Перевозка грузов также не шибко реалистичной видится, ты либо перевез одну посылку и потом сидишь заряжаешься, либо рискуешь уронить какой-нибудь фарфор на головы уличных прохожих.\n\r\nТут, правда, надо уточнить, что большие компании пытаются обойти это ограничение, например, создавая станции для подзарядки дронов, в которых коптер либо перезарядится и продолжит перевозить посылку, либо передаст ее другому дрону, который уже заряжен.\n\r\nНо это все полумеры, и пока не смогут принципиально улучшить емкость аккумуляторов дроны навряд ли смогут выполнять свои функции так, как это задумывалось.\n\nДругое\n\r\nЕсть еще несколько видов роботов, роботы телеприсутствия, роботы няньки, роботы учителя, и т.п. Но некоторые из них в принципе мало нужны, а другие пока что на слишком раннем этапе разработки, чтобы говорить об их успехе. Ну и в любом случае эти роботы, даже если получатся, будут занимать сильно узкую нишу.\n\r\nЕсли же чего забыл или дурак и ничего не понимаю, пишите в комментариях. \n\nИтог\n\r\nА в итоге достаточно грустная ситуация. За редким исключением люди еще не придумали, зачем именно нужно использовать роботов, так, чтобы они прочно вошли в жизнь простых людей, и стали таким же естественным «спутником человека», как, например, компьютеры. \n\r\nP.S. автопилоты у автомобилей не рассматривал, так как они немного выбиваются из стандартного «облика» роботов", {"day": "9", "month": "сентября", "time": "18:35"}, {"rate": 9, "views": 30000}], ["Чего только не придумаешь ради красивой истории\n\n\r\nС 15 по 20 июня многие российские и зарубежные СМИ опубликовали новость о том, что робот нового поколения Promobot V3 с системой искусственного интеллекта и встроенным GPS-навигатором «сбежал» с испытательного полигона пермской компании Promobot. Экземпляр IR77 выехал на проезжую часть, и там у него кончился заряд аккумуляторов. \n\r\nО новости написали технические СМИ вроде Gizmodo, десятки массовых изданий типа британских BBC, Mirror и Daily Mail, не говоря уже о российских телеканалах вроде НТВ.\n\r\nИнформацию распространила пресс-служба пермской компании «Промобот»: вот сообщение в корпоративном блоге от 15 июня. Компания написала, что Promobot V3 «сбежал» во время запланированных испытаний, которые проходят перед официальной презентацией этой модели. Во время тестирования самообучаемый робот должен был передвигаться по окрестностям и распознавать препятствия без постороннего контроля. Но один из инженеров компании «случайно» забыл закрыть ворота полигона. Робот воспользовался возможностью — и «убежал».\n\n\n\r\nУдивительно, что информация настолько широко разошлась по СМИ, несмотря на все признаки фейка. Компания «Промобот» ведёт блог на английском языке, рассчитывая на западную аудиторию. Это и понятно, ведь фирма запланировала провести презентацию робота на конференции TechCrunch Disrupt в сентябре.\n\r\nСамое интересное, что новость про побег робота снабжена качественными фотографиями со всех ракурсов (разумеется, с предусмотрительно удалёнными метаданными). И это при том, что отсутствие робота якобы удалось обнаружить только через 40 минут после побега.\n\r\nНовость опубликована на следующий день после инцидента, со всеми фотографиями и видеозаписью, которые якобы сделали прохожие.\n\r\nКстати, во всех предыдущих записях в блоге компании метаданные фотографий оставлены нетронутым. Только в этой записи метаданные удалены.\n\r\n«Втайне» покинув территорию полигона, экземпляр IR77 проехал около 50 метров, затем выехал на середину улицы и остановился, потому что у него кончился заряд аккумуляторов. Как пишет компания, робот «частично парализовал» дорожное движение, перекрыл одну из полос, а водители на других полосах притормаживали, чтобы разглядеть «невиданное существо».\n\r\n«Затор образовался и на пешеходной дорожке, — сообщает пресс-служба. — Прохожие фотографировали, а дети упрашивали родителей поиграть с роботом». На Youtube с аккаунта Promobot оперативно выложили видео с «любительской» съёмкой происшествия.\n\n\n\r\nВ конце концов, к роботу подъехал для разбирательства патруль ДПС, а инженер роботехнической компании получил выговор от сотрудника ДПС и был вынужден писать объяснительную.\n\r\nКак уже говорилось, у этой истории все признаки фейка. Например, на следующей фотографии с «места происшествия» видно, что у робота включен экран и монитор «лица», хотя по официальной легенде у него сели аккумуляторы.\n\n\n\r\nВ общем, такую замечательную историю с удовольствием подхватили многие СМИ, ведь звучит так красиво: безобидный робот с искусственным интеллектом сбежал из лаборатории на свободу!\n\n\n\r\nМожно было бы не обращать внимания на эту пиар-акцию, если бы она не получила продолжения. Что делает дальше пресс-служба «Промобот»? Через неделю, когда резонанс от первой новости утих и частота упоминаемости в СМИ упала почти до нуля, они распространяют вторую новость: несчастный робот V3 опять сбежал с испытательного полигона! И это при том, что его максимальная скорость по документации составляет 0,5 км/ч.\n\r\nВ результате, после нескольких попыток «сбежать» разработчики якобы решили утилизировать экземпляр IR77!\n\r\n«Мы дважды производили перепрошивку робота с серийным номером IR77, но он продолжает настойчиво двигаться к выходу с полигона, — сказал сооснователь «Промобота» Олег Кивокурцев в интервью телеканалу Russia Today. — Сейчас мы рассматриваем возможность утилизировать образец IR77, поскольку клиентам, которые примут его к себе на работу, данная особенность может не понравиться».\n\r\nСлова про утилизацию робота были очень даже к месту. Пользователей почти две недели обрабатывали новостями и добром роботе, который жаждет свободы. Разумеется, в комментариях к видеоролику некоторые из них стали высказываться, что «убийство» робота негуманно. Некоторые просят отдать робота в добрые руки, словно какого-то котёнка.\n\r\nТаким образом, история получила развитие и она продолжает освещаться в СМИ. Причём есть все намёки на то, что этот сериал продолжится и дальше. Скоро мы узнаем новые подробности о судьбе несчастного IR77. Пресс-служба пермской компании «Промобот» может подавать заявку на получение профессиональной премии в области пиара.\n\n\n\r\nИстория с пермским роботом удивительно напоминает другой знаменитый фейк — про мифическую «дружбу» тигра Амура и козла Тимура. Этот совершенно феерический бред странный инфоповод несколько месяцев освещали крупнейшие российские СМИ. Например, только агентство РИА «Новости» опубликовало более 100 информационных материалов (!) о развитии отношений козла и тигра, со всеми нюансами их отношений, вплоть до оплеухи и выбора места для сна. История, которую выдумала пресс-секретарь Приморского сафари-парка Евгения Патановская, освещалась на федеральных телеканалах как одна из важнейших тем (это нам подтвердили несколько человек, которые смотрят российское телевидение).\n\r\nКак относиться к подобной истории, которая настолько нравится людям? Может быть, действительно нет разницы, насколько она правдива?     Только зарегистрированные пользователи могут участвовать в опросе. Войдите, пожалуйста. Вы верите в историю про «сбежавшего» робота? \n            2.67%\n           Да, верю \n            38\n           \n            54.74%\n           Нет, но она забавная \n            780\n           \n            42.6%\n           Нет, такие методы пиара я считаю неприемлемыми \n            607\n            \n       Проголосовали 1425 пользователей. \n\n       Воздержался 231 пользователь.", {"day": "26", "month": "июня", "time": "22:06"}, {"rate": 9, "views": 26000}], ["Решил написать статью о выставке Skolkovo Robotics 2016. Должен сказать, что было представлено достаточно много проектов, но я рассматривать все не буду — только самые яркие. Если интересно, что там было еще, то полный список проектов можно посмотреть на официальном сайте выставки Skolkovo Robotics International Conference 2016. \n\r\nНа выставке были представлены уже всем известные Promobot от ООО «Промобот» и Webot от ООО «Викрон». Для тех, кто в танке: Promobot – это универсальный робот, предназначенный для оказания помощи, консультаций и навигации. Иными словами – это робот-промоутер.\n\n\r\nWebot — робот телеприсутствия, который позволяет человеку производить действия в месте нахождения робота, используя компьютер и интернет. Он передвигается, при этом дает возможность удаленно наблюдать за происходящим и разговаривать с людьми.\n\n\r\nВпечатлил робот «Деревяка» от Robodem — я даже его сфотографировал. «Деревяка» – это тоже робот-промоутер, он же «попрашайка», плюс он может быть помощником воспитателя. В основе робота лежат американские патенты. Работает «Деревяка» по принципу нейронных сетей, управляется и настраивается в специальном приложении с планшета. Прикрепил видео с демонстрацией работы.\n\n\n\n\r\nТакже был выставлен протез от «Клайбер бионикс» — Kleiber Solo. Kleiber Solo – это протез руки человека. Технология позволяет 12-ю способами выполнять надёжный захват предметов массой до 4 кг для выполнения последующих манипуляций, а также переносить различные грузы массой до 15 кг, такие как сумки и пакеты. Главная фишка в том, что для установки данного протеза не нужно вшивать в человека какие-либо чипы, то есть установка подобной технологии обходится без хирургического вмешательства. Способ силы и сжатия определяется посредством давления мышц человека. Из разговора с представителем я понял, что технология будет не особо дорогой, а также возможна установка протеза инвалидам за счет государства.\n\n\r\nВпечатлил «железный дровосек» от компании «Мивар» — «Муром-ИСП».\r\n«Муром-ИСП» – это гибрид андроида и колесного робота. Выглядит внушительно, снабжен нехилым железом. На вопрос, сколько стоит такой робот, получил ответ: «Дорого, как автомобиль среднего класса». В промо-листовке было указано, что робот может иметь руки-манипуляторы, но на нем их не было. Время работы такого робота — до 8 часов, скорость передвижения — до 15 км/ч. Также можно заметить, что в верхней части робота встроен экран-планшет, на который он также выводит различную информацию. \r\nМеня еще заинтересовали «мозги» робота. Представитель компании рассказал, что логика поведения робота создана при помощи специального программного обеспечения «Роборазум». Из разговора выяснилось, что в основе лежит логическое ядро «Разуматор», которое также применяется в программе по созданию экспертных систем Wi!Mi. Я очень удивился, что подобную систему смогли реализовать на ней. Почему удивился? Модель описания управления подобным роботом должна быть не просто большой -она должна быть громадной. Откуда я это знаю? Все очень просто: сталкивался уже с этим продуктом ранее и даже написал статью на «хабре» об этой штуке.\r\nТакже представитель компании добавил, что они использовали уже вторую версию данного ПО — Wi!Mi 2.1. Оказывается, что у проекта была недавно пресс-конференция. Добавляю видео, в нем более подробно описывается составляющая Мурома.\n\n\n\r\nЕще компанией «Мивар» были представлены мини-роботы «Мипы». Как я понял, их планируют использовать в рамках больших многоуровневых комплексов. То есть будет здоровенный робот размером с «Камаз», робот среднего класса типа «Муром-ИСП» и маленькие недорогие роботы-датчики, которых при ЧП отправляют на разведку. Эти «Мипы» как раз играют роль роботов-датчиков для «Мурома».\n\n\r\nНациональный исследовательский Нижегородский государственный университет им. Н.И. Лобачевского на выставке представил экзоскелетонный роботизированный комплекс «Илья Муромец». Если кратко, то «Илья Муромец» — это экзоскелетон нижних конечностей, который позволяет ходить инвалиду. Главная его фишка — уникальная трехуровневая система управления. Она включает компьютерный интерфейс управления непосредственно сигналами мозга с помощью электроэнцефалограммы, что, собственно, и позволяет человеку передвигаться в этом экзоскелете. Изначально я вообще подумал, что этот экзоскелет применим для подъема и переноса тяжелых различных грузов, а также для преодоления человеком больших расстояний. Но сотрудник на стенде поправил: данная разработка ориентирована только на инвалидов. На youtube можно посмотреть ролик, где представлена концепция этого экзоскелета.\n\n\r\nТакже ННГУ им. Н. И. Лобачевского представил систему регистрации и декодирования биоэлектрической активности мозга и мышц человека (СРД-1). По сути, это еще один протез. Парень на фото синхронизировался с протезом руки и манипулировал им. Выглядело эффектно.\n\n\r\nВ целом, я ожидал от выставки роботов большего. Мне казалось, что современные технологии уже приблизились к созданию Терминатора или человекоподобного ИИ, но на деле… на деле мы стоим еще только в начале этого длинного пути.", {"day": "26", "month": "мая", "time": "08:23"}, {"rate": 4, "views": 5000}]], "refs_quant": 21}